[
  {
    "id": "a3b9eecb31f67107def4d12647b9c9d4",
    "title": "The bear case on Eli Lilly has played out, says only firm to have called it a sell",
    "source": "https://www.marketwatch.com/story/the-bear-case-on-eli-lilly-has-played-out-says-only-firm-to-have-called-it-a-sell-10ce7d62?mod=mw_rss_topstories",
    "generatedAt": "2025-08-27T11:28:59.441Z",
    "publishedAt": "2025-08-27T11:25:00.000Z",
    "feedName": "MarketWatch Top Stories",
    "author": "Steve Goldstein",
    "category": "General",
    "essence": "The bear case for Eli Lilly has now played out following the reaction to the drugmaker’s oral obesity drug trial, an analyst said Wednesday in upgrading the stock.",
    "reactions": [
      "Latest update from MarketWatch Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "261fc8d195c7f5f184e76ebc740e0a14",
    "title": "Lululemon faces lack of fashion cohesion and investor ‘frustration’ ahead of earnings. Here’s why.",
    "source": "https://www.marketwatch.com/story/lululemon-faces-lack-of-fashion-cohesion-and-investor-frustration-ahead-of-earnings-heres-why-3810bfa3?mod=mw_rss_topstories",
    "generatedAt": "2025-08-27T11:28:59.481Z",
    "publishedAt": "2025-08-27T11:15:00.000Z",
    "feedName": "MarketWatch Top Stories",
    "author": "Bill Peters",
    "category": "General",
    "essence": "As the athleisure company prepares to report quarterly results next week, some Wall Street analysts say they still don’t have a clear sense of why its North American business has stumbled.",
    "reactions": [
      "Latest update from MarketWatch Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "de349ef3fe504a28b86344940017ef2b",
    "title": "The central bank with the third-largest reserves is swapping dollars for euros",
    "source": "https://www.marketwatch.com/story/the-central-bank-with-the-third-largest-reserves-is-swapping-dollars-for-euros-672ef5d9?mod=mw_rss_topstories",
    "generatedAt": "2025-08-27T11:28:59.518Z",
    "publishedAt": "2025-08-27T11:12:00.000Z",
    "feedName": "MarketWatch Top Stories",
    "author": "Jules Rimmer",
    "category": "General",
    "essence": "There has been lots of talk about central banks diversifying away from dollars but the SNB is among the first to confirm it.",
    "reactions": [
      "Latest update from MarketWatch Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "4cfbe810b27368e38312b98309502fd2",
    "title": "Getting a lodger: how to earn extra cash by letting a room in your home",
    "source": "https://www.theguardian.com/money/2025/aug/27/getting-a-lodger-extra-cash-letting-a-room-in-your-home",
    "generatedAt": "2025-08-27T11:28:58.567Z",
    "publishedAt": "2025-08-27T11:00:01.000Z",
    "feedName": "Guardian Business",
    "author": "Emma Lunn",
    "category": "Renting property",
    "essence": "Taking in a lodger Illustration: Jamie Wignall/The Guardian View image in fullscreen Taking in a lodger Illustration: Jamie Wignall/The Guardian Money hacks Renting property Getting a lodger: how to earn extra cash by letting a room in your home The government’s ‘rent a room’ scheme lets you earn up to £7,500 a year tax-free from letting out accommodation Emma Lunn Wed 27 Aug 2025 13.00 CEST Share What is a lodger? Technically, a lodger is different to a tenant. A lodger is someone who rents a room in someone else’s home, usually sharing living spaces such as the kitchen and bathroom. By contrast, tenants generally rent the whole property. Unlike a tenant, a lodger does not have exclusive rights to any part of the property – meaning you, as the landlord, can access their room (however, you should respect their privacy). Matt Hutchinson, a director at the flatshare website SpareRoom, says tenants generally have more rights than lodgers because the law recognises that homeowners and landlords are distinct roles, and sharing a home “requires a different set of rules”. He adds: “Homeowners who rent out (always furnished) rooms to lodgers do so under a licence rather than a tenancy agreement, which sets out the conditions of their stay in your property. “For example, you’re only required to serve ‘reasonable’ notice if you want your lodger to move out. That’s usually the length of the rental payment period, so typically one month, but it can be shorter. There’s also no minimum term required by either party.” Live-in landlords can ask lodgers for a deposit. But unlike a residential landlord letting an entire property on an assured shorthold tenancy (AST), there is no obligation to protect the deposit using a deposit protection scheme. Who can take in one? Most homeowners can take in a lodger, but if you have a mortgage, it is best to speak to your lender first. Mark Harris, the chief executive of the mortgage broker SPF Private Clients, says: “Even those lenders who don’t have an issue with lodgers may have certain caveats, such as a cap on the number of lodgers. Principality [building society] will only allow one, while Nationwide and Santander will allow up to two lodgers. Some lenders will forbid lodgers altogether.” Bear in mind that if you let rooms to more than two people, your property may then be classed as a “house in multiple occupation” (HMO) by your local authority. There are extra safety requirements and standards for HMOs, and you will often need a licence. If your home is leasehold, check the lease to see whether you need the freeholder’s permission to sublet part of the property. Council tenants can also sublet a room to a lodger, assuming the local authority gives the go-ahead. Private tenants can take someone in, too, as long as they have their landlord’s permission. Find the right person SpareRoom is the go-to site for lodgers and flatmates. As well as advertising your room, check the “room wanted” ads and sign up for alerts, so you will be aware of anyone looking in your area. Other websites worth checking out include Roomies UK and Ideal Flatmate, while MondaytoFriday and GetDigs UK specialise in weekday lets. Use word of mouth, too: ask friends, family or colleagues whether they know someone looking for a room. There is social media too: local Facebook groups are a good place to start. View image in fullscreen SpareRoom is the go-to site for lodgers and flatmates, but there are also other websites worth checking. Photograph: M4OS Photos/Alamy Earn up to £7,500 tax-free The government’s “rent a room” scheme lets you earn up to £7,500 a year (£625 a month) tax-free from letting out furnished accommodation in your home. The threshold is halved to £3,750 if you share the income with someone else. Most live-in landlords include bills in the rent. To determine how much rent to charge, research local market rates for similar rooms and adjust based on your specific circumstances. Consider factors such as the size and condition of the room, shared living spaces and the location. The income limit covers everything you charge your lodger – so if you charge them for cleaning, meals or laundry, you will need to count these fees or costs too. You do not need to do anything unless you earn above the threshold – in which case you will need to pay income tax on the amount above £7,500. “The tax-free threshold hasn’t been increased since 2016 and is no longer representative of average room rents today,” says Hutchinson. “This means many people who rent out rooms earn more than the threshold. If they do, they must opt into the scheme and complete a tax return to claim their tax-free allowance.” Do your homework When choosing someone to share your home with, it is important to check you are compatible. A quick chat will help you decide if someone’s lifestyle and personality fit with yours. Ask about working hours (including whether they work from home), smoking, pets, regular guests, cleaning habits and expectations. If you are in England, once you have found a potential lodger, you need to do a “right to rent” check to make sure they are legally allowed to live in the country. You can be fined or sent to prison for failing to carry out this check. To do this, you should ask to see relevant documents . There is an online guide that can help with this process. You may also want to carry out credit checks and ask for references before signing an agreement. Make an agreement A “lodger agreement” – or “licence to occupy” – is used by live-in landlords to rent out a spare room in their home. This is a different type of contract to an AST, which is what you would use if you let the entire property to tenants. You can include various terms in the lodger agreement, such as about rules on overnight guests and noise, cleaning responsibilities and use of common areas. Having everything in writing at the beginning can avoid disputes later on. The agreement should also set out the rent amount, payment frequency, how it should be paid (for example, by standing order) and any notice period required. View image in fullscreen If you use the ‘rent a room’ scheme to earn tax-free income, you must provide a furnished room. Photograph: JulPo/Getty Images Consider your finances If you are claiming benefits and take in a lodger, you must inform the Department for Work and Pensions at your local jobcentre immediately. Taking in a lodger can affect your benefit entitlements, and failing to report this change can lead to overpayments, penalties or even prosecution for fraud. If you normally get the 25% single-person discount on your council tax, this will end when a lodger moves in. However, if the lodger is a full-time student, the discount may still apply. Tell your home insurer Make sure your tell your buildings and contents insurer about your lodger, as failing to do so can invalidate your policy. You may need a home insurance policy that includes cover for lodgers, or you may have to pay an extra premium on your current policy. Your insurer may also add exclusions to your cover – such as theft if there is no forced entry. You will need to check with your provider whether the policy will cover your lodger’s possessions, or if they need to take out their own contents policy. Set up the room If you use the “rent a room” scheme to earn tax-free income, you must provide your lodger with a furnished room. This means providing a bed and mattress, wardrobe or other storage, and a desk or table if there is space. You will also need to ensure the room meets fire safety standards, such as having working smoke alarms, fire-safe furnishings and proper ventilation. You will need to comply with gas safety regulations, too. This means your gas appliances must be checked every year by a Gas Safe registered engineer. On moving-in day It’s helpful to be around when your lodger moves in – do not just hand over the keys and disappear. They could have questions, so being available makes settling in smoother. Of course, you do not need to hover while they unpack, but make sure they know where to find you if they need anything. Explore more on these topics Renting property Money hacks Property Consumer affairs Consumer rights features Share Reuse this content",
    "reactions": [
      "Latest update from Guardian Business",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "30b6733c9fbe929a17bcb6ed08fcf1ad",
    "title": "No one is expecting a global boom. This former hedge-fund manager says it’s coming and has a way to play it.",
    "source": "https://www.marketwatch.com/story/no-one-is-expecting-a-global-boom-this-former-hedge-fund-manager-says-its-coming-and-has-a-way-to-play-it-c0ceac1c?mod=mw_rss_topstories",
    "generatedAt": "2025-08-27T11:28:59.559Z",
    "publishedAt": "2025-08-27T10:58:00.000Z",
    "feedName": "MarketWatch Top Stories",
    "author": "Barbara Kollmeyer",
    "category": "General",
    "essence": "A global economic boom is on few radars right now. But what if it happens? The best way to play that involves an unpopular asset.",
    "reactions": [
      "Latest update from MarketWatch Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "cc8f4be9989dd68d4cfafb0ebbf7497b",
    "title": "Annual energy bills set to rise £35 in October, Trump slaps 50% tariff on India – business live",
    "source": "https://www.theguardian.com/business/live/2025/aug/27/energy-price-cap-rise-trump-tariff-india-business-live-news",
    "generatedAt": "2025-08-27T11:28:59.112Z",
    "publishedAt": "2025-08-27T10:38:57.000Z",
    "feedName": "Guardian Business",
    "author": "Lauren Almeida",
    "category": "Business",
    "essence": "08.26 CEST Ofgem lifts the energy price cap - the details The energy regulator for Britain, Ofgem , has said it will increase the cap on energy bills from October by 2%, the equivalent of a £35 rise in annual bills for the average home. Here’s more details of the energy price cap just announced, from Ofgem. A table showing the latest energy price cap Photograph: Ofgem Typical annual energy bill to rise to £1,755 in Great Britain from October Read more Electricity rates If you are on a standard variable tariff (default tariff) and pay for your electricity by Direct Debit, you will pay on average 26.35p pence per kilowatt hour (kWh). The daily standing charge is 53.68 pence per day. This is based on the average across England, Scotland and Wales and includes VAT. Gas rates If you are on a standard variable tariff (default tariff) and pay for your gas by Direct Debit, you will pay on average 6.29 pence per kilowatt hour (kWh). The daily standing charge is 34.03 pence per day. This is based on the average across England, Scotland and Wales and includes VAT. Why energy prices have gone up Volatile global wholesale prices for energy are partly behind the increase, as well as the cost of the government’s expansion of its warm home discount policy. Share Updated at 11.27 CEST",
    "reactions": [
      "Latest update from Guardian Business",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "c2bfe28d9bc04ab7bbe11612d72b8a63",
    "title": "‘She absolutely cannot afford this procedure’: My friend, 61, signed a $20K contract for dental implants. Can she fight it?",
    "source": "https://www.marketwatch.com/story/she-absolutely-cannot-afford-this-procedure-my-friend-61-signed-a-20k-contract-for-dental-implants-can-she-fight-it-1c7a62b8?mod=mw_rss_topstories",
    "generatedAt": "2025-08-27T11:28:59.598Z",
    "publishedAt": "2025-08-27T10:15:00.000Z",
    "feedName": "MarketWatch Top Stories",
    "author": "Quentin Fottrell",
    "category": "General",
    "essence": "“After her room and board is paid at the assisted-living home, she has $9,000 left for the year.”",
    "reactions": [
      "Latest update from MarketWatch Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "ee7208dc003cb4227c0f31e208f14379",
    "title": "JD Sports sales slump in UK as fragile consumer confidence concerns retailers",
    "source": "https://www.theguardian.com/business/2025/aug/27/jd-sports-sales-slump-in-uk-as-fragile-consumer-confidence-concerns-retailers",
    "generatedAt": "2025-08-27T11:28:59.171Z",
    "publishedAt": "2025-08-27T09:26:08.000Z",
    "feedName": "Guardian Business",
    "author": "Sarah Butler",
    "category": "JD Sports Fashion",
    "essence": "Shoes on display at a JD Sports store in London. Revenues in established UK shops fell 6.1%. Photograph: Hollie Adams/Reuters View image in fullscreen Shoes on display at a JD Sports store in London. Revenues in established UK shops fell 6.1%. Photograph: Hollie Adams/Reuters JD Sports Fashion JD Sports sales slump in UK as fragile consumer confidence concerns retailers Leisurewear firm cuts prices online amid tough market, especially in footwear for women and children Sarah Butler Wed 27 Aug 2025 11.26 CEST Last modified on Wed 27 Aug 2025 13.26 CEST Share JD Sports has revealed a slump in UK sales, amid mounting concern that brittle consumer confidence will damage retailers. Revenues in established UK shops fell 6.1% as the leisurewear company struggled to beat strong trading last year, when it received a boost from the men’s Euro 2024 football tournament and women’s growing taste for sports footwear such as Adidas’s Samba and Gazelle. The company said it had invested in cutting prices online amid “tough comparatives”, especially on footwear for women and children. Debenhams may sell Pretty Little Thing and shut distribution hub Read more The sales slide in the UK in the 13 weeks to 2 August contributed to a 3% fall in underlying group sales in the period, with sales increasing only in the Asia Pacific region. Sales in the US fell 2.3%, although this was better than had been expected amid the impact of new import tariffs introduced by the Trump administration this year. Despite falling sales, shares in JD rose 5% on Wednesday morning, reflecting relief that the company confirmed it was still on track to produce full-year profits in line with expectations – although those have been downgraded in recent months. The company also announced a £100m share buyback. The poor UK sales for JD, however, are likely to increase fears of a tougher consumer environment, which hit retail share prices across the London stock market on Tuesday. Régis Schultz, the chief executive of the retail group, which operates the JD Sports fashion chain globally but also owns the Finish Line and Shoe Palace chains in the US, Sport Zone and Courir in mainland Europe, and Blacks and Go Outdoors in the UK, said: “Across our regions and fascias, in general we see a resilient consumer, albeit very selective on their purchases. We therefore remain cautious on the trading environment going into [the second half of the year].” He said there had been an “improved performance” in the US after several product launches were deferred into the second quarter and stronger sales trends in clothing and online. In mainland Europe and the UK he said there was “a good underlying performance” in clothing and newer footwear lines despite tough market conditions. skip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion In another sign of concern about the future for traditional UK retail, Frasers, whose brands include the Sports Direct chain and House of Fraser department stores, said it had added We Do Play, the operator of social leisure venues including the Flip Out trampolining indoor adventure parks and the crazy golf specialist Putt Putt Social, to its portfolio. Frasers’ chief acquisition officer, James France, said: “Today’s announcement marks a significant milestone in our strategy to diversify and create more dynamic consumer and leisure experiences.” Explore more on these topics JD Sports Fashion Retail industry Frasers Group news Share Reuse this content",
    "reactions": [
      "Latest update from Guardian Business",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "8897ea6fdf4f30c27e3f62c5f7ffc37f",
    "title": "People in the UK: how have you been affected by the rise in food prices?",
    "source": "https://www.theguardian.com/business/2025/aug/27/people-in-the-uk-how-have-you-been-affected-by-the-rise-in-food-prices",
    "generatedAt": "2025-08-27T11:28:59.214Z",
    "publishedAt": "2025-08-27T09:16:16.000Z",
    "feedName": "Guardian Business",
    "author": "Guardian community team",
    "category": "Food & drink industry",
    "essence": "A shopper at a supermarket in London. Photograph: Andy Rain/EPA View image in fullscreen A shopper at a supermarket in London. Photograph: Andy Rain/EPA Food & drink industry People in the UK: how have you been affected by the rise in food prices? We would like to hear from people on how they feel about food inflation and if it’s affected their shopping habits Guardian community team Wed 27 Aug 2025 11.16 CEST Last modified on Wed 27 Aug 2025 11.18 CEST Share Food inflation in the UK has hit 4.2% this month with there being a “significant increase” in the cost of staple foods such as butter and eggs. The British Retail Consortium (BRC) said prices had risen at their fastest pace for 18 months. Those on low incomes are most affected by food price inflation because they spend disproportionately more of their monthly budgets on the essentials of life compared with the wealthiest, who have more room to cut discretionary spending. How do you feel about food inflation? Have the price rises changed your shopping or eating habits? Share your experience You can tell us how you have been affected by the increase in food prices by filling in the form below, or messaging us. Please share your story if you are 18 or over, anonymously if you wish. For more information please see our terms of service and privacy policy . Tell us here Message us Your responses, which can be anonymous, are secure as the form is encrypted and only the Guardian has access to your contributions. We will only use the data you provide us for the purpose of the feature and we will delete any personal data when we no longer require it for this purpose. For true anonymity please use our SecureDrop service instead. Name Where do you live? Tell us a bit about yourself (e.g. age and what you do for a living) Optional Tell us how you feel about food inflation in the UK Please include as much detail as possible. If the increase in food prices has changed your shopping or eating habits, please tell us more here Optional Please include as much detail as possible. If you think it will add to your story, you can upload a photo here Optional Please note, the maximum file size is 5.7 MB . Choose file Can we publish your response? Yes, entirely Yes, but contact me first Yes, but please keep me anonymous No, this is information only Phone number Optional Your contact details are helpful so we can contact you for more information. They will only be seen by the Guardian. Email address Your contact details are helpful so we can contact you for more information. They will only be seen by the Guardian. You can add more information here Optional If you include other people's names please ask them first. Would you be interested in speaking to our audio and/or video teams? Audio only Video only Audio and video No, I'm not interested By submitting your response, you are agreeing to share your details with us for this feature. Submit Contact us on WhatsApp at +447766780300 . For more information, please see our guidance on contacting us via WhatsApp . For true anonymity please use our SecureDrop service instead. Message us on WhatsApp If you’re having trouble using the form click here . Read terms of service here and privacy policy here . Explore more on these topics Food & drink industry Inflation callout Share Reuse this content",
    "reactions": [
      "Latest update from Guardian Business",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "3e23e4cd3845889c092a80a74277bdb3",
    "title": "UK’s richest set to produce 13 times more transport emissions than poorest by 2035",
    "source": "https://www.theguardian.com/environment/2025/aug/27/transport-emissions-gap-rich-poor-uk-forecast-to-widen",
    "generatedAt": "2025-08-27T11:28:59.251Z",
    "publishedAt": "2025-08-27T08:51:22.000Z",
    "feedName": "Guardian Business",
    "author": "Damien Gayle Environment correspondent",
    "category": "Carbon footprints",
    "essence": "The IPPR says policies should focus on reducing excess private car travel and flights for the those with the means to change their behaviours fastest. Photograph: Leon Neal/Getty Images View image in fullscreen The IPPR says policies should focus on reducing excess private car travel and flights for the those with the means to change their behaviours fastest. Photograph: Leon Neal/Getty Images Carbon footprints UK’s richest set to produce 13 times more transport emissions than poorest by 2035 Thinktank predicts wider inequality gap and calls for revised policies to tackle flying and excess private car use Damien Gayle Environment correspondent Wed 27 Aug 2025 10.51 CEST Last modified on Wed 27 Aug 2025 11.03 CEST Share Inequality in transport emissions between the richest and the poorest in the UK is set to widen dramatically over the next decade, an analysis has found. The most affluent and mobile already produce 10 times more carbon through their domestic travel than the poorest and least mobile. Under current decarbonisation policies, thinktank researchers forecast this to grow to 13 times by 2035. But revised policies that tackle domestic flying and excess private car use could not only lessen inequality, they say, but also reduce emissions faster overall. “Fairness isn’t a barrier to climate action – it’s the key to unlocking it,” said Stephen Frost, the head of transport policy at the Institute for Public Policy Research (IPPR). “A fairer approach doesn’t just cut carbon faster, it builds a healthier, more inclusive transport system for everyone.” The IPPR research updates a study last year that broke down transport emissions by income, gender, location, ethnicity and age, finding that wealthy white men from rural areas are the country’s biggest emitters of greenhouse gases. They found there was a stark divide in people’s experience of getting around, with some having effectively unlimited ability to travel how, when and where they like, while millions of others are unable to access community life or jobs. Transport emissions chart In the current research, they used the same 12 traveller profiles on which the original study was based, ranging from the most to least affluent and mobile, and projected their decrease in transport emissions over the next decade according to the government’s current policies. They found that the poorest groups were due to decarbonise much faster than the wealthiest, with the richest 4% set to emit 13 times more carbon from their domestic travel than the poorest 14% by 2035 – up from a tenfold gap today. When international travel was included, the richest were expected to emit 22 times more than the poorest – up from 20 times today. Transport is the highest emitting sector in the UK and almost 30% of emission savings will potentially come from surface transport between now and 2030. The government’s approach to decarbonising the sector focuses heavily on the adoption of climate technologies, such as zero-emission vehicles and sustainable aviation fuels, with limited policies focusing on demand reduction. A fairer approach, proposed by the IPPR, would focus on reducing excess private car travel and flights for those with the means to change their behaviours fastest, while increasing transport options for the least mobile. It would not only promote a faster uptake of zero emission vehicles and sustainable aviation fuels , but also encourage less car use among all groups, increased use of public transport and active travel, such as cycling, and a significant reduction in flights for the highest emitting groups. “A fairer pathway would see the emissions gap fall, with the highest polluting group emitting eight times more than the lowest,” the IPPR report says, adding that it could also lead to an overall cut in transport emissions of 71%, compared with 55% under existing policy. However, moves towards this fairer pathway will require a decade of growth in bus use, as well as active travel, with the most affluent cutting their car use by 25% and their domestic air travel by 46%. Explore more on these topics Carbon footprints Transport Ethical and green living Greenhouse gas emissions Air transport Road transport news Share Reuse this content",
    "reactions": [
      "Latest update from Guardian Business",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  }
]