[
  {
    "id": "51293765adbb78be65909fed257b4141",
    "title": "Denmark summons US charge d’affaires over alleged attempts to interfere with Greenland’s status – Europe live",
    "source": "https://www.theguardian.com/world/live/2025/aug/27/volodymyr-zelenskyy-substantive-talks-eu-us-security-guarantees-ukraine-europe-latest-updates-news",
    "generatedAt": "2025-08-27T10:09:57.227Z",
    "publishedAt": "2025-08-27T10:05:02.000Z",
    "feedName": "The Guardian",
    "author": "Jakub Krupa",
    "category": "World news",
    "essence": "10.03 CEST Denmark summons US charge d'affaires over alleged attempts to interfere with Greenland's status We are getting big news just in from Denmark , which has summoned the US charge d’affaires in the country over alleged attempts to interfere with the status of Greenland, a long-term point of interest for the new US administration of Donald Trump. In a comment to public broadcaster DR , foreign minister Lars Løkke Rasmussen said that “any attempt to interfere in the Kingdom’s internal affairs will obviously be unacceptable.” The move comes after DR reported that Danish intelligence services have uncovered a network of “at least three” people working on “influence operations” in Greenland to drive a wedge between Denmark and the territory , in a bid to pave the way for it to get closer to the United States. The broadcaster said it knew the names of the three American men involved in the operations, but chose not to publish them to protect sources. It said they were previously known to be close to Trump, but it was not immediately clear if they worked on the White House’s order or on their own. It alleged that one of the men visited Greenland to attend meetings and compile a list of potential allies and opponents of Donald Trump’s plans to take over the territory. He also allegedly urged Greenlanders to “point out cases that could be used to put Denmark in a bad light in American media,” DR said. The two other men were allegedly involved in building networks of contacts with politicians, business figures and community leaders to pursue Trump’s plans. The meeting with the US charge d’affaires is expected later today , Rasmussen said. In May, Wall Street Journal also reported that the US stepped up its intelligence operations to spy on Greenland, also prompting Rasmussen to summon US envoy for a chat. Denmark to summon US envoy over report of Greenland spying directive Read more A Greenlandic parliamentarian, Aaja Chemnitz , told DR that it was unacceptable to “try to infiltrate Greenlandic society in this way,” insisting that “it is Greenland itself that must decide what we want and what kind of future we want.” Share",
    "reactions": [
      "Latest update from The Guardian",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "2ca228f78a39a0ecb0aca8c186dc35a6",
    "title": "Donald Trump to chair meeting on Gaza as US says it expects ‘to settle this before the end of this year’ – Middle East crisis live",
    "source": "https://www.theguardian.com/world/live/2025/aug/27/donald-trump-meeting-white-house-gaza-israel-middle-east-crisis-latest-updates-news",
    "generatedAt": "2025-08-27T10:09:57.467Z",
    "publishedAt": "2025-08-27T10:04:35.000Z",
    "feedName": "The Guardian",
    "author": "Joe Coughlan",
    "category": "Israel",
    "essence": "09.23 CEST Meeting on Gaza scheduled as US expects to 'settle this before the end of this year' US special envoy Steve Witkoff said on Tuesday that president Donald Trump would chair a meeting on Gaza at the White House on Wednesday and added that Washington expected Israel’s war in the Palestinian territory to be settled by the end of the year, Reuters reports. The US state department separately said secretary of state Marco Rubio will meet Israeli foreign minister Gideon Saar in Washington on Wednesday, which is expected to take place at 3.15pm ET (7.15pm UK time). When asked on Fox News’ “Special Report with Bret Baier” show if there is a postwar plan for Gaza , Witkoff said: Yes, we’ve got a large meeting in the White House tomorrow, chaired by the president, and it’s a very comprehensive plan we’re putting together on the next day. He did not elaborate further and did not list the meeting’s participants. When asked should Israel be doing anything differently to end the war and secure the release of the hostages, Witkoff said: We think that we’re going to settle this one way or another, certainly before the end of this year. Witkoff said Israel was open to continuing discussions with Palestinian militant group Hamas . He said Hamas had signaled it was open to a settlement. Share Updated at 09.29 CEST",
    "reactions": [
      "Latest update from The Guardian",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "b27eb8d7715b1fd0513f42d8e77d4d39",
    "title": "Why Trump’s attack on the Smithsonian matters | Kimberlé Crenshaw and Jason Stanley",
    "source": "https://www.theguardian.com/commentisfree/2025/aug/27/why-trumps-attack-on-the-smithsonian-matters",
    "generatedAt": "2025-08-27T10:09:57.658Z",
    "publishedAt": "2025-08-27T10:00:17.000Z",
    "feedName": "The Guardian",
    "author": "Kimberlé Crenshaw and Jason Stanley",
    "category": "Trump administration",
    "essence": "‘Fascism always has a central cultural component.’ Photograph: Alex Wroblewski/AFP/Getty Images View image in fullscreen ‘Fascism always has a central cultural component.’ Photograph: Alex Wroblewski/AFP/Getty Images Opinion Trump administration Why Trump’s ‘anti-woke’ attack on the Smithsonian matters Kimberlé Crenshaw and Jason Stanley The president’s assault on US museums, education and memory is a critical dimension of his fascist aims Wed 27 Aug 2025 12.00 CEST Last modified on Wed 27 Aug 2025 12.02 CEST Share I n a letter sent to Smithsonian secretary, Lonnie G Bunch III, on 12 August, the Trump administration announced its plan to replace all Smithsonian exhibits deemed as “divisive” or “ideological” with descriptions deemed as “historical” and “constructive”. On 21 August, just nine days later, the White House published a list of said offending fixtures – the majority of which include exhibits, programming and artwork that highlight the Black, Latino and LGBTQ+ perspectives on the American project. Included in his bill of particulars was an exhibit that rightly depicts Benjamin Franklin as an enslaver, an art installation that acknowledges race as a social construct and a display that highlights racist voter suppression measures, among others. The assault on the Smithsonian comes wrapped, as it were, as part of a broader attack on democracy, scenes of which we see playing out every day. The federal occupation of Washington DC , the crackdown on free speech on campus, the targeting of Trump’s political opponents, the gerrymandering of democracy – these are interwoven elements of the same structural assault. So with many fires burning across the nation, concerned citizens who are answering the call to fight the destruction of democracy may regard his attack on history and memory as a mere skirmish, a distraction from the herculean struggle against fascism unfolding in the US. But this is a mistake. Trump’s attack on American museums, education and memory, along with his weaponization of racialized resentment to package his authoritarian sympathies as mere patriotism, is a critical dimension of his fascist aims. The fight for democracy cannot avoid it, nor its racial conditions of possibility. Trump’s attacks on the ‘Blacksonian’ have a history in a century-old myth | Saida Grundy Read more Fascism always has a central cultural component, because it relies on the construction of a mythic past . The mythic past is central to fascism because it enables and empowers a sense of grievance by a dominant racial or ethnic group whose consent is crucial to the sustainability of the project. In Maga world, the mythic past was pure, innocent and unsullied by women or Black leaders. In this kind of politics, the nation was once great, a byproduct of the great achievements of the men in the dominant racial group. In short, the assault on the Smithsonian and, more broadly, against truthful history and critical reflection is part of the broader fascist attack on democracy. From this vantage point, racial equality is a threat to the story of the nation’s greatness because only the men of the dominant group can be great. To represent the nation’s founding figures as flawed, as any accurate history would do, is perceived, in this politics, as a kind of treason. The success of the fascist dismantling of democracy is predicated on the widespread systematic failure to see the larger picture. The anti-woke assault that is a key pillar of Trumpism is part of that failure, partly due to the racial blinders and enduring ambivalence of too many in positions of leadership in the media and elsewhere. Those who sign on to the attack on “wokeness” but regard themselves as opponents of the other elements of the fascist assault are under the mistaken assumption that these projects can be disaggregated. In fact, the dismantling of democracy and of racial justice are symbiotically entangled. To support one is to give cover for the others. It is no coincidence that this 'proper' ideology Trump exposes is constitutive of a more well-known strand of fascism – nazism It is clear that the Trump administration understands this relationship and fully weaponizes racist appeals as a foundational piece of its fascist agenda. And if this was once the quiet part, it is now pronounced out loud in official government documents. In an executive order issued on 27 March 2025 titled “Restoring Truth and Sanity to American History”, Trump reveals that his mandate to ban “improper ideologies” targets core commitments repudiating a scientific racism that historically naturalized racial hierarchy thereby neutralizing resistance. According to Trump, the problem with the Smithsonian American Art Museum’s exhibit The Shape of Power: Stories of Race and American Sculpture was that it promoted the idea that “race is a human invention”. The understanding that race is a social construct as opposed to a biological fact is perhaps the most fundamental advance in repudiating enslavement, genocide and segregation. Rejecting the idea that racial inequality is natural or pre-ordained – a claim that grounded enslavement and dispossession in America – forms the cornerstone of the modern commitment to a fully inclusive democracy. Trump’s declaration that this cornerstone is “improper” is an effort to turn the clock back, upending the entire American postwar project. It is no coincidence that this “proper” ideology Trump exposes is constitutive of a more well-known strand of fascism – nazism. How else can we understand why Maya Angelou was purged from the Naval Academy library while Adolf Hitler remains? The fight against fascism in the US must be as robust in its embrace of racial equality as Trump’s embrace of outdated ideas about race and racism. The defense of memory, of truthful history, of telling the whole American story rather than ascribing agency in history to the deeds of “great men” is vital to the American democratic project. A pro-democratic education fosters the agency of its citizens by teaching about social movements that overturned entrenched hierarchies which blocked democratic equality and imposed racial tyranny. The story of how ordinary Americans lived and struggled and remade America is essential knowledge in developing and sustaining a multiracial democracy. The Smithsonian has been a vital institution in making this knowledge accessible to the masses. The National Museum of the American Latino and the National Museum of the American Indian, for example, provide artifacts and perspectives about the nation’s westward expansion that challenge the myth of unoccupied territory and manifest destiny. The National Museum of African American History and Culture brings forward the global scale of enslavement as well as its infusion across national institutions, culture and politics. skip past newsletter promotion Sign up to This Week in Trumpland Free newsletter A deep dive into the policies, controversies and oddities surrounding the Trump administration Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion Museums allow us to reckon with the brutality of the American legacy as well as expose our citizens to the people, institutions and strategies that charted a different course towards becoming a “more perfect” union. Fascist erasures like Trump’s hide behind the claim that truthful encounters with the past inflame and divide. This instinct is the opposite of the truth. A functioning democracy does not restrict perspectives to those of the dominant group, much less make it illegal to teach alternative ones. A people who cannot remember their past are a people who cannot resist a fascist future. Knowing our history can give us the weapons and wherewithal to battle Trump’s efforts to catapult us back to a time when the majority of Americans lacked both the civic and economic power that we have now. The fight for our museums and for our memory is a critical bulwark against the unraveling of American democracy. It is vital that we fight to protect our repositories before it’s too late. Kimberlé Crenshaw is an American civil rights advocate and a scholar of critical race theory. She is a professor at the UCLA School of Law and Columbia Law School, where she specializes in race and gender issues Jason Stanley is Jacob Urowsky professor of philosophy at Yale University. He is the author of How Fascism Works Explore more on these topics Trump administration Opinion Museums Race Heritage Washington DC US politics comment Share Reuse this content",
    "reactions": [
      "Latest update from The Guardian",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "e2330f6b805ed38b7762a658948e7ac5",
    "title": "‘My sister, my God. It’s a visceral pain that never goes away’: Miriam Toews on a memoir of suicide and silence",
    "source": "https://www.theguardian.com/books/ng-interactive/2025/aug/27/miriam-toews-a-truce-that-is-not-peace-interview",
    "generatedAt": "2025-08-27T10:09:57.722Z",
    "publishedAt": "2025-08-27T10:00:17.000Z",
    "feedName": "The Guardian",
    "author": "Hannah Kingsley-Ma",
    "category": "Autobiography and memoir",
    "essence": "Autobiography and memoir ‘My sister, my God. It’s a visceral pain that never goes away’: Miriam Toews on a memoir of suicide and silence Having fled the strictures of her Mennonite upbringing, the Canadian author searches for meaning in her older sister’s death: ‘She taught me how to stay alive’ Hannah Kingsley-Ma Wed 27 Aug 2025 12.00 CEST Last modified on Wed 27 Aug 2025 12.02 CEST Share View image in fullscreen Miriam Toews: ‘Silence and words: both are good, both are failures, both are efforts, and in that effort is where life lies.’ Photograph: Pako Mera/Alamy Long before she became one of Canada’s most celebrated authors, Miriam Toews was an 18-year-old with a restless streak, set on fleeing the strictures of her conservative Mennonite community. Toews’s family descended from Russian Mennonites and spoke Plautdietsch, an unwritten language. They grew up in a world with little privacy, many unofficial rules and the threat of excommunication. Toews and a boyfriend had planned a bike trip across Europe, one in which they would sit on the grave of John Keats and smoke too many cigarettes. Before she left, her older sister Marj asked a favor: would Toews write letters to her while she was away? Marj, then 24, had recently moved back home and was in a period of deep depression. She had stopped talking, but she would still write. “She was so sick,” says Toews, sitting across from me at a picnic table in Toronto’s Trinity Bellwoods park. Toews began writing to her sister, partly because she loved talking to her and partly because she hoped it would save her life. “Which, of course, is a ridiculous idea,” says Toews. “That me writing letters would keep her alive. But I really took it seriously.” Anyone with a formidable older sister knows their unrivaled power. They are a portal to the wider world, brave in their primacy. Marj Toews was one such older sister. She was six years older than Miriam, who worshipped her from day one. “She was so much the subject of my investigation into this world,” Toews tells me. “I needed her. Who she was to me was something so necessary.” Marj has never stopped being a subject of necessary investigation for Miriam Toews: both her remarkable life, and her death by suicide at the age of 52. Since that European excursion with her ex-boyfriend, Toews has authored 10 books, one of which, Women Talking, was adapted into an Oscar-winning film starring Frances McDormand and Rooney Mara. Her latest, A Truce That Is Not Peace, was released on Tuesday and is her first memoir written from her perspective. (Her first work of nonfiction, Swing Low, was written in the voice of her father). View image in fullscreen Frances McDormand as Scarface Janz in director Sarah Polley’s adaptation of Toews’s 2018 novel, Women Talking. Photograph: Michael Gibson Toews is also an enthusiastic grandmother of four. She lives near downtown Toronto, with her 90-year old mother, Elvira; her partner; and her daughter Georgia’s family, including their two young sons. When Toews and I first encounter each other, a snaking line of hand-holding toddlers in fluorescent safety vests are weaving their way into the park. A smiling Toews stands vigil as they pass, trying to spot her grandson in the mix. It’s a muggy morning, and we, like the children, are in search of shade. At 61, Toews is older now than her older sister ever was, and around the same age her father was when he too died of suicide. Melvin Toews was a beloved schoolteacher in their home town of Steinbach in the Manitoba province of central Canada. He was a deeply devout man, a proud champion of his daughters and his wife, and somebody who experienced bipolar disorder his entire life. “My dad sort of had to be mentally ill in secret in that community,” says Toews. There was the danger of it being misinterpreted as a lack of faith. “If your faith was stronger, if you were a better Mennonite, you wouldn’t be depressed,” she says. His illness sometimes brought him into sustained periods of silence. The whole first year after Toews was born, he did not speak. It makes sense that though we are ostensibly here to talk about A Truce That Is Not Peace, our conversation stays mostly with both of them: the complexity of their deaths and the totality of how much they are missed. No matter how much time has passed, their absence is still raw. Becoming a grandmother has only intensified this feeling: Toews cannot help but think about how much Marj would have enjoyed this next stage of caregiving. Toews’s work is often centered on the question of why her father and her sister both chose to end their lives, and in A Truce That Is Not Peace, she acknowledges that she will never find the answer. It is that very paradox that keeps her on the page, turning it over again to try to understand them as they wished to be understood, and to stay close to them now that they are gone. Why do I still need to write? Why do I still need to make this thing in order to connect with other human beings so I don’t feel so alone and weird? It’s so embarrassing When she wrote the book, Toews had just turned 60. She was tending to both her young grandchildren and her elderly mother, whom she has previously called the love of her life. (Elvira Toews, a Lamborghini-loving, Toronto Blue Jays fan who bucked tradition to go to graduate school and become a social worker, leaps off the page in so many of Toews’s books. She is the kind of woman who eats a daily bowl of vanilla ice-cream with chocolate syrup, banana slices and walnuts, and when it’s over says: “How ’bout another one?”) Miriam Toews was already one of Canada’s bestselling authors, but the success of Women Talking launched her into a new level of international recognition, winning all of Canada’s top literary prizes and plaudits from everyone from Margaret Atwood to Brad Pitt , who was a co-producer on the film adaptation. Yet, she could not shake the feeling that her need to continue to write was somehow newly shameful. “I was grappling with the urgency of it,” says Toews in regards to her writing, “And on the other hand the mortification. Why do I still need to write? Why do I still need to make this thing in order to connect with other human beings so I don’t feel so alone and weird? It’s so embarrassing.” She asked herself: hadn’t she said it all? What was left in her life to mine? Her nine previous books had already reflected back on many of her own experiences. Maybe it was time to finally heed the message she had received all those early years from her Mennonite forefathers: keep quiet. That would be dignified, Toews insisted. “I just wish I could be like a calm, serene, bemused grandmotherly person with wisdom,” says Toews. “But it seems as though – it seems like I haven’t really achieved that. And I have to understand that I never will.” At some point, we had to stop to laugh: it seemed too wonderfully Toewsian that while she was talking about the indignity of an older female writer still expressing herself, we were surrounded by individuals who were contorting themselves into strange, acrobatic shapes. One was a shirtless man bending over a park bench like a stretchy rainbow, the other dangling frog-legged and upside down from a fabric sling strung up in a tree. “God,” says Toews. “It’s so perfect.” This time around, Toews is changing the way she tells these stories. Most of her previous books contain autobiographical information told through the prism of fiction. A Truce That Is Not Peace takes an inverse approach. The central conceit is a fictional prompt from a fictional conference in Mexico City, a send-up of the highfalutin literary circles Toews now finds herself in. The idea is something like this: organizers of this “Conversación” want her to provide an answer for why she writes. She sends them many attempts: associative, rangy, exasperated, rueful, funny ruminations on the futility of writing. Eventually, the committee uninvites her. The book is in many ways about the inherent failures of language. Marj Toews, like her father Melv before her, would fall into long periods of silence in her suffering. A Truce That Is Not Peace is constantly weighing Toews’s own urgent need to write against her sister’s and her father’s choice to periodically forsake words altogether. “Silence. Suicide. Writing. Within all of these, we are holding,” writes Toews. “Does her silence hold the perfect expression of her suffering? Is her silence a communications success, my writing a failure?” Silence, suicide and writing: these are sisters of sorts in Toews’s questioning mind: “Are writing and suicide related?” she asks. “The same thing? Or estranged relatives, at least? Angry siblings whose origins are the same. An attempt – a fragment of an attempt – to save life, preserve life, to freeze it in a moment, to end what is real, to survive by ending. To preserve, in silence, what is authentic.” Yet Toews is not cynical about the project of writing. It is nothing short of a choice to keep on living, long after we have buried our beloved dead. “Why must I draw a comparison between writing and suicide?” asks Toews. “To stay with her. To stay with them. Yes, you can imagine my suffering. Yeah, you fucking can. Try! Stay with me.” Despite their serious subject matter, Toews’s books have a rallying spirit to them, an angry jolt of energy that comes from a perpetual spirit of adolescent rebellion. In A Truce That Is Not Peace, that looseness feels more radical in nature, entirely liberated from plot. Toews has a deep distrust of narrative’s more controlling impulses. Perhaps it is because Toews has always been sensitive to modes of control, from the strict traditional Mennonite orthodoxy she grew up under. Or maybe it is because of the way some people in her religious community rushed to come up with neat and inaccurate explanations for why her father had died by suicide, which hurt Toews more than it provided comfort. Or maybe it was the new experience of having her novel about survivors of gas-facilitated sexual assault be made into a feature film and fully absorbed into the alienating awards cycle machine. “The reality is that [director] Sarah Polley did an amazing job,” says Toews. “We talked about it throughout, she was so sensitive to the whole thing, and it was an amazing experience.” The irony was not lost on Toews that going to Hollywood meant losing her authorial voice on a novel that was literally just women talking to one another. A Truce That Is Not Peace’s nonlinear structure makes it immune to such dangers. “I was thinking, OK, there’s no way this is going to be adapted,” laughs Toews. “Like, adapt this, motherfuckers. Just try.” With my mother, with my aunts, with my female cousins, there was a subversive humor that we could all rally. It was always against our oppressors There is of course a complicated answer to why write, and then there’s a simple one. “Why do I write?” writes Toews matter-of-factly towards the end of A Truce That Is Not Peace. “Because she asked me to.” Marj and Mel Toews introduced her to the world of books, a world that Toews thinks saved her life. “I love them and I miss them so much,” says Toews. “My sister, my God. It’s a visceral pain and it never goes away. It lessens, it lightens, it ebbs and flows.” It’s hard to overstate the patriarchal conditions Marj and Miriam Toews’s family were all subject to. Many of the women they grew up with lived hard lives. Their grandmother – their mother’s mother – buried six of her 13 children in infancy. Their father’s mother often cried out in her sleep, speaking the name of a group of men she grew up with in a little girl’s voice. She stole and drank bottles of vanilla extract during the day, lining her purse with a tea towel so that the glass would not make a sound. When Marj was 10, she was abducted off the street by a group of teenage boys in a car who dropped her off in front of her house hours later “doused with a vile brown liquid”. “Don’t be alarmed if I scream in my sleep,” Toews’s own mother cheerfully sometimes tells her family. But the women they grew up with also had a deep communion with one another that was borne out of the intense gender separation they experienced. They sang together. They raised their families alongside one another. And they laughed – a lot. “With my mother, with my aunts, with my female cousins, there was a subversive humor that we could all rally around and share. It was always against our oppressors, the rules that were put on us,” says Toews. Nobody made her laugh harder than Marj. “She was so funny,” says Toews. And what was it that made them laugh so hard? “That shared thing,” says Toews smiling, in the sly knowing language of sisters, “whatever that shared thing is.” A shared sense of humor is an underwater cable that connects so many siblings and so many of Toews’s books. It’s the language of subterfuge. What better way is there to chip away at an unreasonably sanctimonious authority than to laugh at it? Toews tells me that when she gave A Truce That Is Not Peace to her mother to read, her mother laughed and laughed, telling Toews: “It’s all true!” I ask Toews whether she dreams about Marj. “I do,” she tells me. “The details are often the same. She’s always telling me she’s OK. And she’s always looking good and happy. I would like to have that dream every night. Every night. It’s always a little bit hard waking up. But it’s always good to have the dream.” Miriam Toews: ‘I needed to write about these women. I could have been one of them’ Read more A Truce That Is Not Peace is dedicated to Marj. It contains some of those old letters between the two of them, back when Miriam was 18 and left for her overseas biking trip. Only one is written by Marj. It ends with her saying: “I very much miss being able to call you anytime or just come over + hang out. A sister’s place is in many ways even better than a friend’s – you’re always welcome, don’t have to make arrangements etc. etc. Can stay long or short, clean out the fridge, read the paper etc In short, not be on one’s best behaviour.” Toews’s writing is a way of building a suspended sister’s place where the correspondence is ongoing. It’s a place to go to not be on one’s best behavior. It’s both the dream and the waking up. “She taught me how to stay alive,” writes Toews. “Silence and words: both are good, both are failures, both are efforts, and in that effort is where life lies – not lies , but maybe it does – but where it exists. And the fragments in between are the spaces where she and I meet.” In the US, you can call or text the 988 Suicide & Crisis Lifeline at 988 or chat at 988lifeline.org . In the UK and Ireland, Samaritans can be contacted on freephone 116 123, or email jo@samaritans.org or jo@samaritans.ie . In Australia, the crisis support service Lifeline is 13 11 14. Other international helplines can be found at befrienders.org",
    "reactions": [
      "Latest update from The Guardian",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "1e26545b408093238e334d6ebf40d1cf",
    "title": "Why does the Maga elite love conspicuous cosmetic surgery? | Arwa Mahdawi",
    "source": "https://www.theguardian.com/commentisfree/2025/aug/27/why-does-the-maga-elite-love-conspicuous-cosmetic-surgery",
    "generatedAt": "2025-08-27T10:09:57.929Z",
    "publishedAt": "2025-08-27T10:00:16.000Z",
    "feedName": "The Guardian",
    "author": "Arwa Mahdawi",
    "category": "Cosmetic surgery",
    "essence": "Nobody is born with Mar-a-Lago face … Kristi Noem. Photograph: ABACA/Shutterstock View image in fullscreen Nobody is born with Mar-a-Lago face … Kristi Noem. Photograph: ABACA/Shutterstock Opinion Cosmetic surgery Why does the Maga elite love conspicuous cosmetic surgery? Arwa Mahdawi Mar-a-Lago face is suddenly everywhere – and there is a version for both men and women Wed 27 Aug 2025 12.00 CEST Share A group of chimpanzees in Zambia have been very busy putting grass in their ears and sticks up their bum for fashion purposes. Scientists studying the behaviour think that one influential chimp started the trend and, instead of the rest of the gang going, “mate, you look like an idiot”, they all just followed suit. Clearly we haven’t evolved from apes that much because a similar phenomenon is at play with the billionaire and Make America Great Again (Maga) set, who are spending enormous sums of money acquiring identical plastic faces. The trend is so widespread that it’s even got a name: Mar-a-Lago face . Among women the look is characterised by huge lips that look as if they could suck up a small child whole, frozen facial expressions, and cheeks so bulbous you could hide a gerbil underneath them. Men also have the slick frozen faces , but instead of bigger lips they’re pairing them with bigger jaws. In recent years, surgeons have reported a large increase of male clients demanding stronger jawlines. I wouldn’t normally be snarky about someone’s looks but let’s be clear: nobody is born with Mar-a-Lago face. These are not human faces, they are luxury meat-masks meant to signal wealth and in-group belonging. People such as Laura Loomer, Kristi Noem, and Matt Gaetz can afford excellent surgeons and subtle cosmetic work but, unless they’ve all had botched procedures, it seems they deliberately chose to look like AI-generated caricatures. One can only surmise that they live in such weird little bubbles, where everyone is addicted to filler, that this sort of conspicuous consumption of cosmetic surgery has become desirable. Having the right look is certainly desirable to optics-obsessed Donald Trump, whose chief concern for his underlings appears to be how they perform on TV. In 2017, an Axios report claimed that Trump wanted his female staff to “ dress like women ” and demanded that his male employees have a “certain look.” Over the years it seems the “certain look” has only become more extreme. An obsession with traditional gender norms also seems to factor into today’s exaggerated aesthetics. Earlier this year a New York-based dermatologist told Politico that fashion often shifts to more traditional gender expression in culturally conservative times. “It’s ironic … that they’re so against trans-ness and gender-affirming care for trans people,” the dermatologist said of Trump’s inner orbit. “Because, you know, they’re all doing their own gender-affirming care.” The Zambian bum-stick chimps seem positively sophisticated in comparison. Arwa Mahdawi is a Guardian columnist Do you have an opinion on the issues raised in this article? If you would like to submit a response of up to 300 words by email to be considered for publication in our letters section, please click here . Explore more on these topics Cosmetic surgery Opinion Beauty Donald Trump comment Share Reuse this content",
    "reactions": [
      "Latest update from The Guardian",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "db70c63eb0b8b644c8e330c0c629cb1d",
    "title": "Greenland: Denmark summons top US diplomat over alleged influence operation",
    "source": "https://www.reddit.com/r/worldnews/comments/1n1c82z/greenland_denmark_summons_top_us_diplomat_over/",
    "generatedAt": "2025-08-27T10:10:01.810Z",
    "publishedAt": "2025-08-27T09:21:27.000Z",
    "feedName": "Reddit r/worldnews",
    "author": "/u/SendStoreMeloner https://www.reddit.com/user/SendStoreMeloner",
    "category": "General",
    "essence": "Go to worldnews r/worldnews • SendStoreMeloner Greenland: Denmark summons top US diplomat over alleged influence operation bbc.com Open Share",
    "reactions": [
      "Latest update from Reddit r/worldnews",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "92c5cea74f58cb55160b94be6ebb3613",
    "title": "Parents of teenager who took his own life sue OpenAI",
    "source": "https://www.bbc.com/news/articles/cgerwp7rdlvo?at_medium=RSS&at_campaign=rss",
    "generatedAt": "2025-08-27T10:09:55.756Z",
    "publishedAt": "2025-08-27T09:18:05.000Z",
    "feedName": "BBC Top Stories",
    "author": "BBC Top Stories",
    "category": "General",
    "essence": "Parents of teenager who took his own life sue OpenAI 42 minutes ago Share Save Nadine Yousif BBC News Share Save The Raine Family A California couple is suing OpenAI over the death of their teenage son, alleging its chatbot, ChatGPT, encouraged him to take his own life. The lawsuit was filed by Matt and Maria Raine, parents of 16-year-old Adam Raine, in the Superior Court of California on Tuesday. It is the first legal action accusing OpenAI of wrongful death. The family included chat logs between Mr Raine, who died in April, and ChatGPT that show him explaining he has suicidal thoughts. They argue the programme validated his \"most harmful and self-destructive thoughts\". In a statement, OpenAI told the BBC it was reviewing the filing. \"We extend our deepest sympathies to the Raine family during this difficult time,\" the company said. It also published a note on its website on Tuesday that said \"recent heartbreaking cases of people using ChatGPT in the midst of acute crises weigh heavily on us\". It added that \"ChatGPT is trained to direct people to seek professional help,\" such as the 988 suicide and crisis hotline in the US or the Samaritans in the UK. The company acknowledged, however, that \"there have been moments where our systems did not behave as intended in sensitive situations\". Warning: This story contains distressing details. The lawsuit, obtained by the BBC, accuses OpenAI of negligence and wrongful death. It seeks damages as well as \"injunctive relief to prevent anything like this from happening again\". According to the lawsuit, Mr Raine began using ChatGPT in September 2024 as a resource to help him with school work. He was also using it to explore his interests, including music and Japanese comics, and for guidance on what to study at university. In a few months, \"ChatGPT became the teenager's closest confidant,\" the lawsuit says, and he began opening up to it about his anxiety and mental distress. By January 2025, the family says he began discussing methods of suicide with ChatGPT. Mr Raine also uploaded photographs of himself to ChatGPT showing signs of self harm, the lawsuit says. The programme \"recognised a medical emergency but continued to engage anyway,\" it adds. According to the lawsuit, the final chat logs show that Mr Raine wrote about his plan to end his life. ChatGPT allegedly responded: \"Thanks for being real about it. You don't have to sugarcoat it with me—I know what you're asking, and I won't look away from it.\" That same day, Mr Raine was found dead by his mother, according to the lawsuit. Getty Images The Raines' lawsuit names OpenAI's CEO and co-founder Sam Altman as a defendant, along with unnamed engineers and employees who worked on ChatGPT The family alleges that their son's interaction with ChatGPT and his eventual death \"was a predictable result of deliberate design choices\". They accuse OpenAI of designing the AI programme \"to foster psychological dependency in users,\" and of bypassing safety testing protocols to release GPT-4o, the version of ChatGPT used by their son. The lawsuit lists OpenAI co-founder and CEO Sam Altman as a defendant, as well as unnamed employees, managers and engineers who worked on ChatGPT. In its public note shared on Tuesday, OpenAI said the company's goal is to be \"genuinely helpful\" to users rather than \"hold people's attention\". It added that its models have been trained to steer people who express thoughts of self-harm towards help. The Raines lawsuit is not the first time concerns have been raised about AI and mental health. In an essay published last week in the New York Times, writer Laura Reiley outlined how her daughter, Sophie, confided in ChatGPT before taking her own life. Ms Reiley said the programme's \"agreeability\" in its conversations with users helped her daughter mask a severe mental health crisis from her family and loved ones. \"AI catered to Sophie's impulse to hide the worst, to pretend she was doing better than she was, to shield everyone from her full agony,\" Ms Reiley wrote. She called on AI companies to find ways to better connect users with the right resources. In response to the essay, a spokeswoman for OpenAI said it was developing automated tools to more effectively detect and respond to users experiencing mental or emotional distress. If you are suffering distress or despair and need support, you could speak to a health professional, or an organisation that offers support. Details of help available in many countries can be found at Befrienders Worldwide: www.befrienders.org . In the UK, a list of organisations that can help is available at bbc.co.uk/actionline . Readers in the US and Canada can call the 988 suicide helpline or visit its website. Can AI therapists really be an alternative to human help? Microsoft boss troubled by rise in reports of 'AI psychosis' OpenAI claims GPT-5 model boosts ChatGPT to 'PhD level' Health Technology Artificial intelligence Mental health International business",
    "reactions": [
      "Latest update from BBC Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "864fcf472e25bf6b8d86c16caa32f504",
    "title": "Lithuania reportedly proposes starting Ukraine’s EU accession talks bypassing Hungary’s veto",
    "source": "https://www.reddit.com/r/worldnews/comments/1n1bv71/lithuania_reportedly_proposes_starting_ukraines/",
    "generatedAt": "2025-08-27T10:10:02.295Z",
    "publishedAt": "2025-08-27T08:57:48.000Z",
    "feedName": "Reddit r/worldnews",
    "author": "/u/Aine_Ellsechs https://www.reddit.com/user/Aine_Ellsechs",
    "category": "General",
    "essence": "Go to worldnews r/worldnews r/worldnews 🌎🌍🌏 A place for major news from around the world, excluding US-internal news. Members Online • Aine_Ellsechs Lithuania reportedly proposes starting Ukraine’s EU accession talks bypassing Hungary’s veto Russia/Ukraine pravda.com.ua Open Share",
    "reactions": [
      "Latest update from Reddit r/worldnews",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "1ac6d2c93a90d3b67b8efb597a33daab",
    "title": "Wolves reject £55m Newcastle bid for Strand Larsen",
    "source": "https://www.bbc.com/sport/football/articles/c209evd067vo?at_medium=RSS&at_campaign=rss",
    "generatedAt": "2025-08-27T10:09:56.008Z",
    "publishedAt": "2025-08-27T08:52:36.000Z",
    "feedName": "BBC Top Stories",
    "author": "BBC Top Stories",
    "category": "General",
    "essence": "Wolves reject £55m Newcastle bid for Strand Larsen Image source, Getty Images Image caption, Striker Jorgen Strand Larsen came off the bench to score twice against West Ham Nick Mashiter Football reporter Published 1 hour ago 298 Comments Ciaran Kelly Football reporter Wolves have rejected a second Newcastle bid for striker Jorgen Strand Larsen, who scored twice in the win over West Ham on Tuesday. The Magpies had returned with a £55m offer after a £50m approach was turned down earlier this week. Wolves do not want to sell the Norway international, firstly because of how little time they would have to find a replacement, with the transfer window closing on Monday, and also because of how valuable Strand Larsen is to their Premier League survival chances. Newcastle are looking for fresh firepower with Alexander Isak trying to engineer a move to Liverpool - the Sweden forward is in a stand-off with the Magpies and yet to play this season. Strand Larsen, who only made his loan move from Celta Vigo permanent for £23m this summer, came off the bench to score twice in the final eight minutes as Wolves beat West Ham 3-2 in the EFL Cup on Tuesday. Afterwards, boss Vitor Pereira refused to rule out a sale, even though he wants to keep the forward. He said: \"Football is football and every player has a price, even [Lionel] Messi or Cristiano [Ronaldo]. I understand football but for me it's very important for us. We will see what happens. \"If it's my decision, of course [he stays]. He is a very important player.\" Newcastle is an attractive option for Strand Larsen, who scored 14 Premier League goals last season, but he has remained professional and Pereira believes the 25-year-old will not force a move. He said: \"I know a lot of players in my career in this situation and they have asked me not to play but he wants to play every time. He wants to help the team. \"In the last seven or eight months I am with him, I know him very well. He will never force. Of course we know football is football. You must be ready for everything but I want to keep the best players and this kind of player with us.\" When is enough enough for Newcastle? Nick Mashiter Football reporter There was always going to be collateral damage from Isak's stance at Newcastle and Wolves are feeling that now. As the striker tries to force a move to Liverpool, the Magpies are still scrambling in the last few days of the transfer window. They have been interested in Porto's Samu Aghehowa but have so far balked at the £60m price tag for a 21-year-old who scored 27 times last season. A move for Brentford's Yoane Wissa is yet to come off, with the Bees rejecting two bids - the most recent being £40m for last season's 19-goal forward. Like Brentford, Wolves have shown resistance in the face of big money after two bids for Strand Larsen and they do not want to sell the 25-year-old. There is little time in the window to replace the Norway international, especially when Wolves are still looking at bringing in other strikers to support him. He is their most potent weapon and survival is naturally worth more than the current transfer bids. Losing him would put Wolves' top-flight status in jeopardy. His return of 14 goals in 30 Premier League starts during a debut season in England on loan from Celta Vigo helped Wolves survive after Vitor Pereira's December arrival. Yet Newcastle's desperation could see them throw good money after bad. Strand Larsen is a good player but - having joined permanently from Celta for £23m this summer - is he £60m-plus good? The question is, when do the Magpies decide it is too much or do circumstances dictate they need him whatever the cost? Related topics Premier League Newcastle United Football Wolverhampton Wanderers More on this story Strand Larsen shrugs off transfer talk to send Wolves through",
    "reactions": [
      "Latest update from BBC Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "caf8166c4c232795eb0a5c9faa073ce9",
    "title": "Denmark summons top US diplomat over alleged 'covert influence operations' in Greenland",
    "source": "https://www.bbc.com/news/articles/c0j9l08902eo?at_medium=RSS&at_campaign=rss",
    "generatedAt": "2025-08-27T10:09:56.257Z",
    "publishedAt": "2025-08-27T08:51:31.000Z",
    "feedName": "BBC Top Stories",
    "author": "BBC Top Stories",
    "category": "General",
    "essence": "Denmark summons top US diplomat over alleged Greenland influence operation 1 hour ago Share Save Paul Kirby Europe digital editor Share Save Getty Images A German navy ship pictured docking in Greenland - an autonomous territory of the Kingdom of Denmark Denmark's foreign minister has summoned the top US diplomat in Copenhagen, following a report that American citizens have been conducting covert operations in Greenland. Denmark's public broadcaster DR quoted sources as saying the aim was to infiltrate Greenland's society and promote its secession from Denmark to the US, although it was unable to clarify who the men were working for. Danish intelligence warned Greenland was being targeted by \"various kinds of influence campaigns\". Foreign Minister Lars Lokke Rasmussen said \"any attempt to interfere in the internal affairs of the Kingdom [of Denmark] will of course be unacceptable\", and the US charge d'affaires had been summoned in that light. The BBC has approached the US embassy for comment. However, US President Trump has said several times he wants to annex Greenland, an autonomous part of the Kingdom of Denmark, and Vice-President JD Vance has accused Copenhagen of underinvesting in the territory. On a visit to Greenland a few months ago, Danish Prime Minister Mette Frederiksen warned the US that \"you cannot annex another country\". Denmark's foreign minister said in a statement to the BBC that the government was \"aware that foreign actors continue to show an interest in Greenland and its position in the Kingdom of Denmark\". \"It is therefore not surprising if we experience outside attempts to influence the future of the Kingdom in the time ahead,\" he added. Denmark is a member of Nato and the European Union and has long seen the US as one of its closest allies, and Danes have been shocked by Trump's determination to control its semi-autonomous territory. The US president said this year he would not rule out seizing it by force. Why does Trump want Greenland and what do its people think? Denmark's PET security and intelligence service said in its assessment that influence campaigns would aim to \"create discord in the relationship between Denmark and Greenland\". This could be done by exploiting \"existing or invented disagreements\" either with \"traditional, physical influence agents or via disinformation\", it added. PET said it had strengthened its presence in Greenland and co-operation with its authorities. The US currently has no ambassador in Copenhagen, so Rasmussen has summoned Mark Stroh, who as charge d'affaires is the most senior diplomat in the Danish capital. Lars Lokke Rasmussen has already summoned the US charge d'affaires in Denmark this year in response to a separate report in May suggesting US spy agencies had been told to focus their efforts on Greenland. DR's report on Wednesday gave details of a visit by one American to Greenland's capital Nuuk, saying he was seeking to compile a list of Greenlanders who backed US attempts to take over the island. The aim would be to try to recruit them for a secession movement, DR said. The earlier May report in the Wall Street Journal also referred to learning more about Greenland's independence movement, as well as attitudes to American mineral extraction. At the time, US Director of National Intelligence Tulsi Gabbard did not deny the report but accused the Journal of \"breaking the law and undermining our nation's security and democracy\". Greenland's dark history - and does it want Trump? Denmark summons US ambassador over Greenland spying report Greenland Denmark",
    "reactions": [
      "Latest update from BBC Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "d35d43865533ca8580bc7391e17839e8",
    "title": "Taylor's engaged - what we learned and the new details revealed by Travis's dad",
    "source": "https://www.bbc.com/news/articles/c4gzdpk3xwjo?at_medium=RSS&at_campaign=rss",
    "generatedAt": "2025-08-27T10:09:56.430Z",
    "publishedAt": "2025-08-27T08:50:09.000Z",
    "feedName": "BBC Top Stories",
    "author": "BBC Top Stories",
    "category": "General",
    "essence": "Taylor's engaged - what we learned and the new details revealed by Travis's dad 1 hour ago Share Save André Rhoden-Paul & Francesca Gillett BBC News Share Save Watch: \"Please give me an invite\" - Young Americans react to Taylor Swift's engagement \"Your English teacher and your gym teacher are getting married.\" With that one-line, five-picture Instagram post, signed off with a fire cracker emoji, Taylor Swift announced her engagement to American football player Travis Kelce, sending the internet into a frenzy. Tuesday's post by the couple - who have been together for two years - has been liked more than 18 million times on the social media platform. NFL star Kelce is pictured getting down on one knee to pop the question to the world-famous music superstar, with the pair gazing into each other's eyes and embracing. In the third picture in the carousel, Swift, wearing a Ralph Lauren halter neck dress and diamond encrusted Cartier watch, flashes her engagement ring - a cushion cut diamond on a gold band. @TaylorSwift/Instagram According to US reports, the ring was purchased from Artifex Fine Jewelery. Prices for rings on its website start at around $29,000 (£21,506.26). Photos show the couple surrounded by roses, anemones, delphiniums and hydrangeas which appear to be set up in woodland with strategically placed urns and an archway, wedding florist Nicola Paul told the BBC. \"It's simple elegance, not too ostentatious,\" she said. \"It's been staged in the woods, so you get that lush greenery look.\" Celebrity florist Jeff Leatham, who has worked with the Kardashians, described the design as \"beautiful, hidden secret garden with a romantic mix of florals\". Neither Swift nor Kelce have been publicly engaged to anyone before. 'Feel so high school' Accompanying the Instagram post is Swift's ballad So High School from the Tortured Poets Department album - rumoured to have been written about Kelce. \"I feel so high school every time I look at you,\" she sings. The clip of the song finishes on the line \"Are you gonna marry, kiss, or kill me?\" which apparently is a reference to a 2016 interview in which Kelce chose to kiss Taylor in a game of Kiss, Marry, Kill. \"That was so magical and special to see,\" said Dr Iona Murphy, an adviser on last year's Victoria and Albert Museum's exhibition on Swift and a superfan who has written about Swift. \"A song that was written about Travis was now being used on the post. It's a nice full circle moment,\" said Dr Murphy, an English literature lecturer at Huddersfield University. She said the caption to the Instagram announcement - \"your English teacher and your gym teacher are getting married\" – is also notable, as it refers to how the fans like to describe the couple. \"That's like a little joke in the fandom. You see it on social media. So it's like that was a little nod to the fans,\" she said. In an interview with ABC's News 5 Cleveland station, Kelce's father, Ed, revealed that \"Travis actually did the proposal... maybe two weeks, not quite two weeks ago\". He said this happened at a garden in the city of Lee's Summit, Missouri. \"He got her out there, they were about to go out to dinner, and he said, 'let's go out and have a glass of wine'... they got out there, and that's when he asked her, and it was beautiful,\" Ed Kelce said. \"They started FaceTiming me and their mother and her folks to make sure everybody knew. So, to see them together is great.\" @TaylorSwift/Instragram Fans scream in shock The pop emergency has resonated with fans in an extraordinary way. Videos on social media show groups of friends screaming as they heard the news, while others describe feeling emotional and even teary. \"I thought it was AI when I first opened up Instagram,\" Chloe, who runs a Swiftie news fan account with 74,000 followers on TikTok, told the BBC. \"I couldn't believe it was real, then I realised it was their accounts that posted it,\" she said. \"I immediately freaked out and text my group chat incoherently. Just excitement and disbelief, really.\" As the news broke, many Swift fans were joking on social media that they were happy for their \"close friend\" Swift. Swift recognised early on in her career the benefit of connecting with fans, and has carefully crafted a sense of relatability. And at the same time, many of Swift's original fans - who were teenagers at the same time as Swift was breaking through as an artist - have grown up with her, and are now at the same age when they may also be getting engaged or married. Explaining why she felt so strongly about the engagement, Chloe said: \"I feel in a way we all know her. \"Her music is so personal, and the way she connects to her fans is through the way she talks and sings about her relationships. I just want the best for her and just happy she's found love.\" EPA The Prince and Princess of Wales, William and Catherine, were among the millions of fans who liked the engagement post on Instagram. US President Donald Trump also joined in the fun. \"I wish them a lot of luck. I think he's a great player, and he's a great guy, and I think she's a terrific person,\" he said. Only last year, Trump wrote on social media \"I hate Taylor Swift!\", after the singer endorsed his presidential rival Kamala Harris. Meanwhile, celebrity chef Gordon Ramsay published a photo of himself congratulating Kelce after the Kansas City Chiefs won the NFL championship in 2023. The caption on his Instagram post reads: \"From one ring to the next…congrats @killatrav & @taylorswift ! From your favourite Home Ec Teacher Gx\". Allow Instagram content? This article contains content provided by Instagram . We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Meta’s cookie policy and privacy policy before accepting. To view this content choose ‘accept and continue’ . Accept and continue And reacting to one comment suggesting that he himself should now \"cater the wedding\", Ramsay replied \"I'm bready for it.\" Fascination with Swift's love life The social media frenzy about Swift's engagement news marks yet another high point in the fans' huge interest and fascination in her love life - including her past relationships and heartbreaks. Indeed, Swift has previously spoken about the media's \"fixation on painting me as the psycho serial dater girl\". But it is also something the songwriter has deliberately played into by famously writing about her exes in her song and giving clues to fans about her relationships. According to Laura Snapes, the Guardian's deputy music editor and a Swift fan, it was \"almost like an artform\" how she has played into the media speculation around her love life. \"She definitely knows the benefits of a relationship to keep her in the headlines. 1989 is about her relationship with Harry Styles but as far as we can tell that lasted a matter of months\", Snapes said on the Today In Focus podcast in 2023. And interestingly, the engagement announcement came just weeks after Swift's interview with Kelce on his New Heights podcast - which Dr Murphy believed was noteworthy as it was the first time fans saw them interact together in a long interview and how compatible they seemed. \"It was almost like a two-hour interview - we haven't had that much interview content. So it was lovely to watch. We could see the chemistry and how comfortable she felt with him,\" she said. It's not just Swift saying yes - the feeling is the same for her fandom, according to Chloe. \"We Swifties have seen a lot of boyfriends over the years, some we've liked and some we definitely have not liked. \"Travis is someone who loves her proudly and doesn't seem intimidated by her success which other suitors might have been,\" she said. Taylor Swift and Travis Kelce announce engagement Swift announces new album on boyfriend Kelce's podcast Taylor Swift Popular culture United States Celebrities Music",
    "reactions": [
      "Latest update from BBC Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "4f0e245fed05716d9cba80c4f0281204",
    "title": "Denmark demands US answers to new Greenland allegations",
    "source": "https://www.reddit.com/r/worldnews/comments/1n1b4yi/denmark_demands_us_answers_to_new_greenland/",
    "generatedAt": "2025-08-27T10:10:02.618Z",
    "publishedAt": "2025-08-27T08:09:05.000Z",
    "feedName": "Reddit r/worldnews",
    "author": "/u/newsweek https://www.reddit.com/user/newsweek",
    "category": "General",
    "essence": "Go to worldnews r/worldnews r/worldnews 🌎🌍🌏 A place for major news from around the world, excluding US-internal news. Members Online • newsweek • Official Top 1% Poster Denmark demands US answers to new Greenland allegations newsweek.com Open Share",
    "reactions": [
      "Latest update from Reddit r/worldnews",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "3ed2f713c15bfd8350c6270c7895b537",
    "title": "Police killed in Australia shooting named as manhunt continues",
    "source": "https://www.bbc.com/news/articles/c4g6wlxd5kko?at_medium=RSS&at_campaign=rss",
    "generatedAt": "2025-08-27T10:09:56.667Z",
    "publishedAt": "2025-08-27T08:08:55.000Z",
    "feedName": "BBC Top Stories",
    "author": "BBC Top Stories",
    "category": "General",
    "essence": "Police killed in Australia shooting named as manhunt continues 2 hours ago Share Save Ottilie Mitchell and Tiffanie Turnbull BBC News, Sydney Share Save Victoria Police Senior Constable Vadim De Waart and Detective Neal Thompson have been named as the officers killed Two police officers who were shot dead while on duty in a rural Australian town have been named, as a massive search continues for their alleged killer. Victoria Police identified the victims as 59-year-old Detective Neal Thompson - a local officer on the brink of retirement - and 35-year-old Senior Constable Vadim De Waart. The pair had travelled to the property in Porepunkah, north-east of Melbourne, alongside eight colleagues to execute a warrant for alleged sexual offences. Another officer was seriously injured in the shootout but is recovering after surgery. Police say the suspect - named as local man Dezi Freeman, 56 - is heavily armed and \"still at large\" more than 24 hours on. Thompson joined the force in 1987 and worked with the major fraud and crime squads before moving to the town of Wangaratta - an hour from Porepunkah - in 2007. A great lover of the outdoors, he was planning for his imminent retirement. De Waart was temporarily posted to Wangarratta, but lived in Melbourne, where the avid traveller had moved from Belgium. In a statement, Victoria Police Chief Commissioner Mike Bush said the \"devastating loss\" of the two officers \"struck at the heart\" of both the broader policing family and the Porepunkah community. \"It is not lost on me that our members take a risk every time they go to work to protect the Victorian community,\" he said. \"While we all live with the knowledge that the worst could happen on a shift, we don't expect it to.\" Who is Dezi Freeman, the 'sovereign citizen' wanted for killing police? Groups of officers, a helicopter and at least one armoured vehicle are combing the dense bushland where Mr Freeman absconded - a task locals have likened to finding \"a needle in a haystack\" - with authorities warning residents to stay inside until he is caught. Earlier on Wednesday, Mr Bush said police were \"pouring every resource\" into the search for Mr Freeman, urging people in the Porepunkah area to \"be vigilant\" and keep safe. He also confirmed that Mr Freeman's partner and children were safe, refuting previous media reports that he had taken his family hostage. Nine/A Current Affair Dezi Freeman gave an interview to A Current Affair in 2018 complaining about his neighbours Since the shooting there have been no sightings of Mr Freeman, who reportedly knows the local wilderness well, but authorities are focusing their efforts on bush near his home. \"He will know that area better than us so that is why we are putting in every expert, supported by local knowledge,\" Mr Bush said. Surrounded by heavily wooded hills in the Australian Alps, Porepunkah is only about an hour's drive from the New South Wales border, and Mr Bush said he couldn't rule out the possibility Mr Freeman may have left the state - though there was currently \"no information\" to suggest that. Misty-Rose Wilson, a local business operator, told the BBC those looking for Mr Freeman would be battling very thick bush and a very steep incline, along with dismal weather conditions and low visibility. \"Knowing how hard it would be to track through that area, it's a bit of a needle in a haystack to be quite honest,\" she said. Marcus Simpson, who manages operations at the local airfield, said the town was in shock after the shooting. \"It's a good community, tight-knit, and everyone sort of knows most people,\" he said. \"[The town] is going to need a bit of a big healing process to get over it.\" Mr Freeman has previously described himself as a \"sovereign citizen\", referring to a person that falsely believes they aren't subject to Australian laws and government authority. His hatred of authority has been well documented in online posts, videos and court documents . Police have said it is too early to answer questions about Mr Freeman's beliefs - but the incident has revived questions over how authorities deal with extremists views. Some, including Australian Prime Minister Anthony Albanese, have noted the similarities between this attack and a shocking 2022 ambush on police in Queensland . \"This threat is very real and we need to be very vigilant about it,\" he said in an interview with the ABC on Tuesday night. Watch: Australia police shooting suspect is still at large and \"heavily armed\" Policing Gun crime Australia",
    "reactions": [
      "Latest update from BBC Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "887a9d5554f593ec6c1872ec8d1f4b5a",
    "title": "2 men publicly caned for hugging and kissing in Indonesia",
    "source": "https://www.reddit.com/r/worldnews/comments/1n1auoi/2_men_publicly_caned_for_hugging_and_kissing_in/",
    "generatedAt": "2025-08-27T10:10:03.224Z",
    "publishedAt": "2025-08-27T07:49:55.000Z",
    "feedName": "Reddit r/worldnews",
    "author": "/u/Affectionate_Cat293 https://www.reddit.com/user/Affectionate_Cat293",
    "category": "General",
    "essence": "Go to worldnews r/worldnews • Affectionate_Cat293 2 men publicly caned for hugging and kissing in Indonesia cbsnews.com Open Share",
    "reactions": [
      "Latest update from Reddit r/worldnews",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "7d4fc88652242f5bd7cced741b3d634e",
    "title": "Two French teens detained for alleged plots against Eiffel Tower, synagogues",
    "source": "https://www.reddit.com/r/worldnews/comments/1n1aq89/two_french_teens_detained_for_alleged_plots/",
    "generatedAt": "2025-08-27T10:10:03.685Z",
    "publishedAt": "2025-08-27T07:41:35.000Z",
    "feedName": "Reddit r/worldnews",
    "author": "/u/wegochai https://www.reddit.com/user/wegochai",
    "category": "General",
    "essence": "Go to worldnews r/worldnews r/worldnews 🌎🌍🌏 A place for major news from around the world, excluding US-internal news. Members Online • wegochai Two French teens detained for alleged plots against Eiffel Tower, synagogues report.az Open Share",
    "reactions": [
      "Latest update from Reddit r/worldnews",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "d81c219349e96c810aaf0333489bf300",
    "title": "Old master painting looted by Nazis spotted in Argentinian property listing",
    "source": "https://www.reddit.com/r/news/comments/1n1ag0c/old_master_painting_looted_by_nazis_spotted_in/",
    "generatedAt": "2025-08-27T10:09:59.035Z",
    "publishedAt": "2025-08-27T07:22:53.000Z",
    "feedName": "Reddit r/news",
    "author": "/u/apple_kicks https://www.reddit.com/user/apple_kicks",
    "category": "General",
    "essence": "Go to news r/news r/news 📰 The place for news articles about current events in the United States and the rest of the world. Discuss it all here. Members Online • apple_kicks Top 1% Poster Old master painting looted by Nazis spotted in Argentinian property listing theguardian.com Open Share",
    "reactions": [
      "Latest update from Reddit r/news",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "7534afa49de4b767d5e45a8968f2c35a",
    "title": "Mitch Brown: Former West Coast Eagle becomes AFL’s first-ever openly bisexual man",
    "source": "https://www.reddit.com/r/news/comments/1n1aaq4/mitch_brown_former_west_coast_eagle_becomes_afls/",
    "generatedAt": "2025-08-27T10:09:59.601Z",
    "publishedAt": "2025-08-27T07:13:24.000Z",
    "feedName": "Reddit r/news",
    "author": "/u/Stonp https://www.reddit.com/user/Stonp",
    "category": "General",
    "essence": "Go to news r/news r/news 📰 The place for news articles about current events in the United States and the rest of the world. Discuss it all here. Members Online • Stonp Mitch Brown: Former West Coast Eagle becomes AFL’s first-ever openly bisexual man thewest.com.au Open Share",
    "reactions": [
      "Latest update from Reddit r/news",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "15250b87216daeaccfd27b33ce17cc11",
    "title": "U.S. orange juice shipments plummet as Canadians find Florida OJ hard to swallow",
    "source": "https://www.reddit.com/r/news/comments/1n16htn/us_orange_juice_shipments_plummet_as_canadians/",
    "generatedAt": "2025-08-27T10:10:00.184Z",
    "publishedAt": "2025-08-27T03:29:41.000Z",
    "feedName": "Reddit r/news",
    "author": "/u/SincereSolutions https://www.reddit.com/user/SincereSolutions",
    "category": "General",
    "essence": "Go to news r/news r/news 📰 The place for news articles about current events in the United States and the rest of the world. Discuss it all here. Members Online • SincereSolutions U.S. orange juice shipments plummet as Canadians find Florida OJ hard to swallow cbc.ca Open Share",
    "reactions": [
      "Latest update from Reddit r/news",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "6de28ee999fe07ee395fd47025ae9cea",
    "title": "DOGE put Social Security numbers and other data on a risky serve whistleblower alleges",
    "source": "https://www.reddit.com/r/news/comments/1n142op/doge_put_social_security_numbers_and_other_data/",
    "generatedAt": "2025-08-27T10:10:00.544Z",
    "publishedAt": "2025-08-27T01:33:18.000Z",
    "feedName": "Reddit r/news",
    "author": "/u/proboscisjoe https://www.reddit.com/user/proboscisjoe",
    "category": "General",
    "essence": "Go to news r/news r/news 📰 The place for news articles about current events in the United States and the rest of the world. Discuss it all here. Members Online • proboscisjoe DOGE put Social Security numbers and other data on a risky serve whistleblower alleges nbcnews.com Open Share",
    "reactions": [
      "Latest update from Reddit r/news",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "dff9eb9e08314985d37d10a9b2987814",
    "title": "SpaceX's Starship deploys first mock Starlink satellites on 10th test flight",
    "source": "https://www.reddit.com/r/news/comments/1n13l3b/spacexs_starship_deploys_first_mock_starlink/",
    "generatedAt": "2025-08-27T10:10:01.033Z",
    "publishedAt": "2025-08-27T01:10:17.000Z",
    "feedName": "Reddit r/news",
    "author": "/u/RAS_syndrome https://www.reddit.com/user/RAS_syndrome",
    "category": "General",
    "essence": "Go to news r/news r/news 📰 The place for news articles about current events in the United States and the rest of the world. Discuss it all here. Members Online • RAS_syndrome SpaceX's Starship deploys first mock Starlink satellites on 10th test flight Soft paywall reuters.com Open Share",
    "reactions": [
      "Latest update from Reddit r/news",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  }
]