[
  {
    "id": "c8f6a3c91d5bebc7692f6267feca2394",
    "title": "Bonding twelve 56K modems together to set dial-up broadband records",
    "source": "https://www.tomshardware.com/networking/enthusiasts-bond-twelve-56k-dial-up-modems-together-to-set-dial-up-broadband-records-a-dozen-screeching-boxes-achieve-record-668-kbps-download-speeds",
    "generatedAt": "2025-09-28T06:04:35.032Z",
    "publishedAt": "2025-09-28T00:59:51.000Z",
    "feedName": "Hacker News",
    "author": "Hacker News",
    "category": "General",
    "essence": "Networking Enthusiasts bond twelve 56K modems together to set dial-up broadband records \"> By Mark Tyson last updated 27 September 2025 Multilink PPP worked well on an era-appropriate Windows XP PC, after progress using an earlier Windows ME box stalled. When you purchase through links on our site, we may earn an affiliate commission. Here\"> You may like AOL will end dial-up internet service in September, 34 years after its debut 3Dfx Voodoo modded with 12 MB of RAM and two texture mappers Remaking a Commodore 64 Datasette from 1982 using 1993 microcassette tech Commercial solutions like \"> You may like AOL will end dial-up internet service in September, 34 years after its debut 3Dfx Voodoo modded with 12 MB of RAM and two texture mappers Remaking a Commodore 64 Datasette from 1982 using 1993 microcassette tech (Image credit: uppercase font-bold\"> AOL will end dial-up internet service in September, 34 years after its debut relative :object-cover :w-full :h-full mb-3.5\"> 3Dfx Voodoo modded with 12 MB of RAM and two texture mappers relative :object-cover :w-full :h-full mb-3.5\"> Remaking a Commodore 64 Datasette from 1982 using 1993 microcassette tech relative :object-cover :w-full :h-full mb-3.5\"> Windows 8.1 graphics get bit-crushed into working in 40-year-old EGA graphics mode relative :object-cover :w-full :h-full mb-3.5\"> Windows 95 on a PlayStation 2 kind of works \" data-recirc-id=\"article-river-stacked-ads:native-cards\" data-nosnippet data-ad-slot-path=\"feed-sponsored-post\" data-attribute-device=\"all\"> relative :object-cover :w-full :h-full mb-3.5\"> Enthusiast builds a fully functional CPU from old memory chips uppercase font-bold\">Latest in Networking SoftBank beams 5G to phones from the sky in successful stratospheric test flight relative :object-cover :w-full :h-full mb-3.5\"> Japan to subsidize undersea cable vessels over 'very serious' national security concerns relative :object-cover :w-full :h-full mb-3.5\"> Acer Predator Connect T7 mesh router review: Expensive and outclassed relative :object-cover :w-full :h-full mb-3.5\"> Taiwan increases defensive patrols around 24 undersea cables relative :object-cover :w-full :h-full mb-3.5\"> Netgear Orbi 370 Wi-Fi 7 mesh router review: Dual-band Wi-Fi 7 hardware finally makes Orbi affordable relative :object-cover :w-full :h-full mb-3.5\"> World's first laser communication link between a plane and satellite ran at 1 Gbps uppercase font-bold\">Latest in News Nvidia RTX 5070 Ti Super and RTX 5070 Super TDP leaked relative :object-cover :w-full :h-full mb-3.5\"> Scalpers sell ROG Xbox Ally X preorders for as much as $2,500 even though they are still in stock relative :object-cover :w-full :h-full mb-3.5\"> Asus addresses stuttering issues plaguing its gaming laptops relative :object-cover :w-full :h-full mb-3.5\"> Russia outlines EUV litho chipmaking tool roadmap through 2037 relative :object-cover :w-full :h-full mb-3.5\"> Nvidia CEO bets $100 billion on OpenAI becoming a multi-trillion-dollar company relative :object-cover :w-full :h-full mb-3.5\"> Enthusiasts bond twelve 56K dial-up modems together to set dial-up broadband records 10 Comments Comment from the forums ggeeoorrggee The latest regulations from the FCC define broadband as 100 Mbps or higher, but in 2000, a far slower connection of 200 Mbps or higher was considered adequate to earn the designation.",
    "reactions": [
      "Community perspective: ggeeoorrggee The latest regulations from the FCC define broadband as 100 Mbps or higher, but in 2000, a far slower connection of 200 Mbps or higher was considered adequate to earn the designation. Pre",
      "Community perspective: Zaranthos The per line cost plus taxes probably far exceed the cost of most broadband options. But if latency matters it would probably be faster than satellite internet, but most likely less bandwidt",
      "Community perspective: Sluggotg Modems were cool back in the day. Late one night I get all these calls from some Drunken dirt bag. He keeps yelling at me claiming, \"I know Suzy is with you\" Blah, Blah, Blah. I keep warning "
    ],
    "promoBanner": {
      "text": "Startup Stories by Axiologic.News",
      "url": "https://axiologic.news/"
    }
  },
  {
    "id": "d2aa3839aac9e3fc42d4708cbef034df",
    "title": "Typst: A Possible LaTeX Replacement",
    "source": "https://lwn.net/Articles/1037577/",
    "generatedAt": "2025-09-27T12:05:54.225Z",
    "publishedAt": "2025-09-27T07:31:39.000Z",
    "feedName": "Hacker News",
    "author": "Hacker News",
    "category": "General",
    "essence": "Benefits for LWN subscribers The primary benefit from subscribing to LWN is helping to keep us publishing, but, beyond that, subscribers get immediate access to all site content and access to a number of extra site features. Please sign up today! September 17, 2025 This article was contributed by Lee Phillips",
    "reactions": [
      "Community perspective: The problem is that some website push you to use the newest gimmick package that will break compatibility in two year instead of the tried and true solution. But how is it different from other softwar",
      "Community perspective: If you are publishing something, you don't (usually) have a choice. Your publisher will hand you a LaTeX template, probably with a big stack of arbitrary packages, and tell you to use that. But then w",
      "Community perspective: My impression (from what packages I was required to use) was the journals didn't pick the unstable (or new or modern or even maintained) packages, but the oldest ones (along with old compilers)? I'm n"
    ],
    "promoBanner": {
      "text": "Startup Stories by Axiologic.News",
      "url": "https://axiologic.news/"
    }
  }
]