[
  {
    "id": "cc88a958eb7d06bdd6e6c328119f25c7",
    "title": "Leipzig Gewandhaus/ Nelsons review – poignancy, poetry and powerful Sibelius in wide-ranging Prom",
    "source": "https://www.theguardian.com/music/2025/aug/27/leipzig-gewandhaus-orchestra-nelsons-faust-prom",
    "generatedAt": "2025-08-27T11:06:43.016Z",
    "publishedAt": "2025-08-27T11:02:57.000Z",
    "feedName": "The Guardian",
    "author": "Clive Paget",
    "category": "Proms 2025",
    "essence": "Filigree fingerwork … violinist Isabelle Faust and conductor Andris Nelsons with the Leipzig Gewandhaus Orchestra at the BBC Proms. Photograph: Chris Christodoulou/BBC View image in fullscreen Filigree fingerwork … violinist Isabelle Faust and conductor Andris Nelsons with the Leipzig Gewandhaus Orchestra at the BBC Proms. Photograph: Chris Christodoulou/BBC Proms 2025 Review Leipzig Gewandhaus/ Nelsons review – poignancy, poetry and powerful Sibelius in wide-ranging Prom Royal Albert Hall, London The venerable orchestra – among the world’s oldest – brought Pärt, Sibelius and Dvořák to the Proms. Isabelle Faust’s sensitive reading of the latter’s Violin Concerto was sleek and organic; the Sibelius well-paced and weighty Clive Paget Wed 27 Aug 2025 13.02 CEST Share A rvo Pärt has written much austerely beautiful music, but few works are as direct and affecting as his 1977 Cantus in Memoriam Benjamin Britten. The Estonian composer, who celebrates his 90th birthday this year , had only just discovered the purity of Britten’s music when the latter died. Pärt’s six-minute tribute pits undulating string scales against the sombre toll of a single bell. It was a fitting opening to a wide-ranging concert in which the venerable Leipzig Gewandhaus Orchestra was put through its paces by Pärt’s Estonian compatriot Andris Nelsons. Emerging from the most poignant of pianissimos, crisscrossing lines rose and fell before the conductor’s clenched hands wrang the final drop of pathos out of the final chord. Isabelle Faust was the late replacement for Hilary Hahn in Dvořák’s Violin Concerto, and although she kept one eye on the music to be on the safe side, this was an impressively organic reading of this amiable intermingling of 19th-century Romanticism and tangy folk idioms. Sleek and silvery at the top, and with a fine line in fluid phrasing, she highlighted the music’s shadier woodland tones while bringing a lightness and lift to the sunnier episodes that pepper the rhapsodic opening movement. View image in fullscreen Put through its paces … Leipzig Gewandhaus play Sibelius’s Second at the Royal Albert Hall. Photograph: Chris Christodoulou/BBC Faust is disinclined to showboat. Instead, she discovered a poetic delicacy in the concerto’s flashier corners, with Nelsons and his Gewandhaus players her willing and sensitive partners. The central adagio was warmly spun, while in the finale – a spirited Czech furiant – her filigree fingerwork flickered like mercury over the orchestra’s earthier stomp. Nelsons was generally a surefooted guide to Sibelius’s Second Symphony, though occasionally the music betrayed its fragmentary nature. Well-paced, if a little too loud too soon, he teased out plenty of internal dramatics, ratcheting up the tension in the opening movement. In the ensuing andante, baleful bassoons over a darkly determined pizzicato tread powered the tempest-tossed music towards its implacable conclusion. The whirling scherzo was tense, bracing even, while the conductor’s deftly broadened tempi imbued the long-breathed finale with the necessary weight and nobility. Listen again on BBC Sounds until 12 October. The Proms continue until 13 September. Explore more on these topics Proms 2025 Classical music Proms Antonín Dvořák Arvo Pärt reviews Share Reuse this content",
    "reactions": [
      "Latest update from The Guardian",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "8c75cd682e5428d6613b49a8d0731102",
    "title": "Girl who stabbed teachers in Welsh school had been considered for Prevent",
    "source": "https://www.theguardian.com/uk-news/2025/aug/27/girl-stabbed-teachers-welsh-school-considered-prevent",
    "generatedAt": "2025-08-27T11:06:43.150Z",
    "publishedAt": "2025-08-27T11:00:59.000Z",
    "feedName": "The Guardian",
    "author": "PA Media",
    "category": "Wales",
    "essence": "A referral to the government’s anti-terror scheme was discussed after the teenager was found with a knife at Ysgol Dyffryn Aman in Carmarthenshire. Photograph: Ben Birchall/PA View image in fullscreen A referral to the government’s anti-terror scheme was discussed after the teenager was found with a knife at Ysgol Dyffryn Aman in Carmarthenshire. Photograph: Ben Birchall/PA Wales Girl who stabbed teachers in Welsh school had been considered for Prevent Multi-agency report finds girl, 13, had fascination with Hitler, weapons and claimed to speak German and Russian PA Media Wed 27 Aug 2025 13.00 CEST Share A teenager who was interested in Adolf Hitler had been considered for referral to the anti-terror programme Prevent before she stabbed three people at her school, a report has revealed. The 13-year-old had a curiosity for war memorabilia and the Nazi dictator, a fascination with weapons, and claimed to speak German and Russian. After she was found with a knife at Ysgol Dyffryn Aman in Ammanford, Carmarthenshire, a referral to the government’s anti-terror scheme was discussed but not pursued. The girl later armed herself with her father’s multi-tool and attacked teachers Fiona Elias and Liz Hopkin and a pupil in April last year. After her arrest she told police : “That’s one way to be a celebrity.” She said: “I’m pretty sure this is going to be on the news, so more eyes will be looking at me.” View image in fullscreen Teachers Fiona Elias, left, and Liz Hopkin were injured in the attack in the Carmarthenshire school. Photograph: Dyfed-Powys Police The girl was sentenced in April at Swansea crown court to 15 years detention after being found guilty of three charges of attempted murder. A multi-agency report was commissioned by Carmarthenshire county council and Mid and West Wales safeguarding board. The report examined the two years before the incident and found that although a lot of information was known about the girl – referred to as Child A – it had not been shared between agencies. Gladys Rhodes White, the report’s author, said: “Child A is seen as ‘quirky’ and ‘not quite fitting in’, having unusual interests in war memorabilia, Hitler, a fascination with weapons and purporting to speak German and Russian. “Her father describes her as loving to read, research things and having a fertile imagination, creating fantasies. “Following the first knife-possession incident, there were discussions regarding whether a referral to Prevent should be made due to concerns that Child A may have the potential to be radicalised. There is no evidence to suggest a referral was made. “Whilst Child A may not have met the criteria for Prevent, this triggered an action for an early help assessment to be offered to holistically understand Child A’s needs. This referral was made and the team contacted the father, who declined the assessment. “Had this assessment occurred, this may have been a pathway through which agencies could consider alternative help, or for monitoring and support to be provided.” The girl had taken a ball-bearing gun in her bag to a previous school. After moving to Ysgol Dyffryn Aman, she threatened to use a knife on another pupil and her father agreed to carry out daily bag checks. Later, she was suspended for several days after being found with a knife in her schoolbag. Teachers at Ysgol Dyffryn Aman said they had not known much about the girl and her history and what they did know had related to her “emotional and behavioural needs”. On the day of the attacks, pupils knew she had a knife with her but had not informed any teachers, the report said. skip past newsletter promotion Sign up to Headlines UK Free newsletter Get the day’s headlines and highlights emailed direct to you every morning Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion The girl’s father told the review author he felt “services” had let her and the family down. The report said: “He described occasions when he tried to get help for Child A in dealing with her emotional and behavioural issues and felt none of the services understood Child A and her needs. He feels it is only since her conviction that she has started to receive help.” In her conclusions, Rhodes White said: “Each agency had their own pieces of the jigsaw. In collating all the pieces of the jigsaw, there is a much clearer picture of the extent of concerns around Child A’s state of mind and her associated behaviours. “It is important to note that no information held by agencies identified a clear ability to foresee the shocking and unexpected events which occurred in April 2024.” She said there needed to be more effective information-sharing between agencies and also a focus on how children who did not meet the threshold for Prevent were supported. Rhodes White added: “This is particularly pertinent for children who may be transitioning from one school to another, or when parents do not accept non-statutory help.” In a joint statement, Carmarthenshire county council, the school, Dyfed-Powys police and Hywel Dda University health board said they would be addressing the report’s recommendations. They said: “We acknowledge the challenging and difficult circumstance faced by the victims and the whole community of Ysgol Dyffryn Aman in the aftermath of the incident. We would like to pay tribute to the pupils, teachers, staff and parents of Ysgol Dyffryn Aman. “The school’s strong sense of community and empathy has enabled students to return to their classrooms promptly and safely, with their wellbeing promoted at all times.” Explore more on these topics Wales Schools Prevent strategy Crime Knife crime news Share Reuse this content",
    "reactions": [
      "Latest update from The Guardian",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "4cfbe810b27368e38312b98309502fd2",
    "title": "Getting a lodger: how to earn extra cash by letting a room in your home",
    "source": "https://www.theguardian.com/money/2025/aug/27/getting-a-lodger-extra-cash-letting-a-room-in-your-home",
    "generatedAt": "2025-08-27T11:06:43.285Z",
    "publishedAt": "2025-08-27T11:00:01.000Z",
    "feedName": "The Guardian",
    "author": "Emma Lunn",
    "category": "Renting property",
    "essence": "Taking in a lodger Illustration: Jamie Wignall/The Guardian View image in fullscreen Taking in a lodger Illustration: Jamie Wignall/The Guardian Money hacks Renting property Getting a lodger: how to earn extra cash by letting a room in your home The government’s ‘rent a room’ scheme lets you earn up to £7,500 a year tax-free from letting out accommodation Emma Lunn Wed 27 Aug 2025 13.00 CEST Share What is a lodger? Technically, a lodger is different to a tenant. A lodger is someone who rents a room in someone else’s home, usually sharing living spaces such as the kitchen and bathroom. By contrast, tenants generally rent the whole property. Unlike a tenant, a lodger does not have exclusive rights to any part of the property – meaning you, as the landlord, can access their room (however, you should respect their privacy). Matt Hutchinson, a director at the flatshare website SpareRoom, says tenants generally have more rights than lodgers because the law recognises that homeowners and landlords are distinct roles, and sharing a home “requires a different set of rules”. He adds: “Homeowners who rent out (always furnished) rooms to lodgers do so under a licence rather than a tenancy agreement, which sets out the conditions of their stay in your property. “For example, you’re only required to serve ‘reasonable’ notice if you want your lodger to move out. That’s usually the length of the rental payment period, so typically one month, but it can be shorter. There’s also no minimum term required by either party.” Live-in landlords can ask lodgers for a deposit. But unlike a residential landlord letting an entire property on an assured shorthold tenancy (AST), there is no obligation to protect the deposit using a deposit protection scheme. Who can take in one? Most homeowners can take in a lodger, but if you have a mortgage, it is best to speak to your lender first. Mark Harris, the chief executive of the mortgage broker SPF Private Clients, says: “Even those lenders who don’t have an issue with lodgers may have certain caveats, such as a cap on the number of lodgers. Principality [building society] will only allow one, while Nationwide and Santander will allow up to two lodgers. Some lenders will forbid lodgers altogether.” Bear in mind that if you let rooms to more than two people, your property may then be classed as a “house in multiple occupation” (HMO) by your local authority. There are extra safety requirements and standards for HMOs, and you will often need a licence. If your home is leasehold, check the lease to see whether you need the freeholder’s permission to sublet part of the property. Council tenants can also sublet a room to a lodger, assuming the local authority gives the go-ahead. Private tenants can take someone in, too, as long as they have their landlord’s permission. Find the right person SpareRoom is the go-to site for lodgers and flatmates. As well as advertising your room, check the “room wanted” ads and sign up for alerts, so you will be aware of anyone looking in your area. Other websites worth checking out include Roomies UK and Ideal Flatmate, while MondaytoFriday and GetDigs UK specialise in weekday lets. Use word of mouth, too: ask friends, family or colleagues whether they know someone looking for a room. There is social media too: local Facebook groups are a good place to start. View image in fullscreen SpareRoom is the go-to site for lodgers and flatmates, but there are also other websites worth checking. Photograph: M4OS Photos/Alamy Earn up to £7,500 tax-free The government’s “rent a room” scheme lets you earn up to £7,500 a year (£625 a month) tax-free from letting out furnished accommodation in your home. The threshold is halved to £3,750 if you share the income with someone else. Most live-in landlords include bills in the rent. To determine how much rent to charge, research local market rates for similar rooms and adjust based on your specific circumstances. Consider factors such as the size and condition of the room, shared living spaces and the location. The income limit covers everything you charge your lodger – so if you charge them for cleaning, meals or laundry, you will need to count these fees or costs too. You do not need to do anything unless you earn above the threshold – in which case you will need to pay income tax on the amount above £7,500. “The tax-free threshold hasn’t been increased since 2016 and is no longer representative of average room rents today,” says Hutchinson. “This means many people who rent out rooms earn more than the threshold. If they do, they must opt into the scheme and complete a tax return to claim their tax-free allowance.” Do your homework When choosing someone to share your home with, it is important to check you are compatible. A quick chat will help you decide if someone’s lifestyle and personality fit with yours. Ask about working hours (including whether they work from home), smoking, pets, regular guests, cleaning habits and expectations. If you are in England, once you have found a potential lodger, you need to do a “right to rent” check to make sure they are legally allowed to live in the country. You can be fined or sent to prison for failing to carry out this check. To do this, you should ask to see relevant documents . There is an online guide that can help with this process. You may also want to carry out credit checks and ask for references before signing an agreement. Make an agreement A “lodger agreement” – or “licence to occupy” – is used by live-in landlords to rent out a spare room in their home. This is a different type of contract to an AST, which is what you would use if you let the entire property to tenants. You can include various terms in the lodger agreement, such as about rules on overnight guests and noise, cleaning responsibilities and use of common areas. Having everything in writing at the beginning can avoid disputes later on. The agreement should also set out the rent amount, payment frequency, how it should be paid (for example, by standing order) and any notice period required. View image in fullscreen If you use the ‘rent a room’ scheme to earn tax-free income, you must provide a furnished room. Photograph: JulPo/Getty Images Consider your finances If you are claiming benefits and take in a lodger, you must inform the Department for Work and Pensions at your local jobcentre immediately. Taking in a lodger can affect your benefit entitlements, and failing to report this change can lead to overpayments, penalties or even prosecution for fraud. If you normally get the 25% single-person discount on your council tax, this will end when a lodger moves in. However, if the lodger is a full-time student, the discount may still apply. Tell your home insurer Make sure your tell your buildings and contents insurer about your lodger, as failing to do so can invalidate your policy. You may need a home insurance policy that includes cover for lodgers, or you may have to pay an extra premium on your current policy. Your insurer may also add exclusions to your cover – such as theft if there is no forced entry. You will need to check with your provider whether the policy will cover your lodger’s possessions, or if they need to take out their own contents policy. Set up the room If you use the “rent a room” scheme to earn tax-free income, you must provide your lodger with a furnished room. This means providing a bed and mattress, wardrobe or other storage, and a desk or table if there is space. You will also need to ensure the room meets fire safety standards, such as having working smoke alarms, fire-safe furnishings and proper ventilation. You will need to comply with gas safety regulations, too. This means your gas appliances must be checked every year by a Gas Safe registered engineer. On moving-in day It’s helpful to be around when your lodger moves in – do not just hand over the keys and disappear. They could have questions, so being available makes settling in smoother. Of course, you do not need to hover while they unpack, but make sure they know where to find you if they need anything. Explore more on these topics Renting property Money hacks Property Consumer affairs Consumer rights features Share Reuse this content",
    "reactions": [
      "Latest update from The Guardian",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "7b0c755d37803ed518d885bcad04625f",
    "title": "England and Wales fertility rate falls for third consecutive year",
    "source": "https://www.theguardian.com/uk-news/2025/aug/27/england-and-wales-fertility-rate-falls-for-third-consecutive-year",
    "generatedAt": "2025-08-27T11:06:43.533Z",
    "publishedAt": "2025-08-27T10:57:18.000Z",
    "feedName": "The Guardian",
    "author": "Rachel Hall",
    "category": "Population",
    "essence": "For a country’s population to remain stable over time – discounting any impact from migration – the total fertility rate needs to be about 2.1. Photograph: UK Stock Images Ltd/Alamy View image in fullscreen For a country’s population to remain stable over time – discounting any impact from migration – the total fertility rate needs to be about 2.1. Photograph: UK Stock Images Ltd/Alamy Population England and Wales fertility rate falls for third consecutive year Last year’s total fertility rate of 1.41 was lowest since comparable data was first collected in 1938, ONS says Rachel Hall Wed 27 Aug 2025 12.57 CEST Last modified on Wed 27 Aug 2025 13.02 CEST Share The fertility rate for England and Wales has fallen for the third year in a row to reach a record low, figures show. The total fertility rate across both nations, meaning the average number of live children women can expect to have across their child-bearing life, stood at 1.41 in 2024, down from 1.42 in 2023, the lowest since comparable data was first collected in 1938, according to the Office for National Statistics . This is despite a 0.6% increase in live births last year, with a 14% increase in babies born to fathers over 60, according to figures published last month. For a country’s population to remain stable over time – discounting any impact from migration – the total fertility rate needs to be about 2.1. Graph showing the changing fertility rate since 1938 The disparity is down to the fact the adult population increased in 2024, which outweighed the increase in births. Since 1938, an increase in births at the same time as a decrease in the fertility rate has only been observed six times, with four occurring since 2011. Greg Ceely, head of population health monitoring at the Office for National Statistics, said: “Fertility rates in England and Wales have been in overall decline since 2010. The total number of births increased last year, for the first time since 2021; but this was offset by population growth. As a result, fertility rates fell overall, and are now at the lowest rates on record.” The stats also showed that the long-term trend of the average age of parents rising steadily over the past 50 years is continuing: the average age of mothers and fathers both increased by 0.1 years in 2024, with mothers aged 31 and fathers 33.9, according to the ONS’ annual Births in England and Wales publication. Over the last two decades, the average age of mothers and fathers has increased by two years for mothers, and just under two years for fathers. Mothers living in London had the highest mean age across all English regions and Wales at 32.5 years in 2024, compared with the lowest in the north-east, at 30. In 2024, the average age of mothers in England and Wales having their first born (29.4) was noticeably lower than those having later-born children (31.8 for second, 32.9 for third, and 33.9 for fourth), suggesting that mothers tend to leave larger gaps between their first and second children than for subsequent children. When broken down by age group, the fertility rate for the age group 25 to 29 has decreased the most for both mothers and fathers, although there were falls for all under-30s. Conversely, it increased for mothers between 30 and 39, and for fathers it increased between 35 and 39 and decreased between 30 and 34. skip past newsletter promotion Sign up to First Edition Free daily newsletter Our morning email breaks down the key stories of the day, telling you what’s happening and why it matters Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion There were also notable increases for older fathers, with the fertility rate increasing for those over 60 and those aged 50-54, although it fell slightly for fathers in their 40s. The stats also shed light on regional disparities. Two regions experienced an increase in the fertility rate, representing the first regional increases since 2021: the West Midlands increased from 1.56 in 2023 to 1.59 in 2024, and London increased from 1.33 in 2023 to 1.35 in 2024. The north-west experienced no change and all other regions recorded declines. Luton was the area with the highest fertility rate at 2, while the City of London’s was the lowest at 0.32. Politicians have been voicing concerns about the falling birthrate recently, in particular over the question of how a decreasing number of people of working age can support an ever-increasing number of pensioners. In July, the education secretary, Bridget Phillipson, said the falling birthrate had “worrying repercussions” and that she hoped to be able to make it easier for women to have children. Explore more on these topics Population Office for National Statistics news Share Reuse this content",
    "reactions": [
      "Latest update from The Guardian",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "9fff95635ae30e7c529807908ae9a6e1",
    "title": "Conservative MSP Graham Simpson defects to Reform",
    "source": "https://www.bbc.com/news/articles/cr74kg1vg4jo?at_medium=RSS&at_campaign=rss",
    "generatedAt": "2025-08-27T11:06:41.389Z",
    "publishedAt": "2025-08-27T10:56:57.000Z",
    "feedName": "BBC Top Stories",
    "author": "BBC Top Stories",
    "category": "General",
    "essence": "Conservative MSP Graham Simpson defects to Reform 10 minutes ago Share Save Craig Williams BBC Scotland News Share Save Simpson says he has joined Reform to help get the SNP out of office Conservative MSP Graham Simpson has defected to Reform. Simpson announced his move as he appeared at a press conference in Scotland with Reform leader Nigel Farage. The new Reform MSP told journalists that many would not be surprised to see him defect, and that leaving the Conservatives was \"an enormous wrench\". He is the second MSP to leave the party's Holyrood group in the past week. The move means Simpson becomes Reform's sole current MSP. Michelle Ballantyne sat as a Reform member at the Scottish Parliament from January to May 2021, having left the Conservatives the previous year and sitting for a short spell as an independent. She lost her seat at the May 2021 election. PA Media Nigel Farage announced the defection of Graham Simpson in Broxburn Simpson has been an MSP for the Central Scotland region since 2016. He is a former journalist with The Sun and Daily Record. He said he would not step down from the Central Scotland regional list following his defection. Speaking at a press conference in Broxburn, West Lothian, he said: \"It's fair to say that some of you won't be surprised to see me here, given that the Scottish Tories have been touting my name as a potential defector for months now. \"So today, I'm giving them what they want, but perhaps not for the reasons that they think. \"Leaving the party that I first joined when I was 15 is an enormous wrench, and I've been through a lot of soul searching in the past few weeks.\" How achievable is Reform's plan on migration? How Reform has changed the debate on migration Simpson said he decided to join Reform UK to \"create something new, exciting and lasting\". Speaking with leader Nigel Farage by his side, he added: \"I've joined Reform because we have the chance to create something new, exciting and lasting that puts the needs of people over the system, that asks what is going wrong and how we can fix it.\" He said he thought Reform could \"help\" to remove the SNP from office after 19 years in power. Reuters Migrants board dinghies and small boats off the coast of France before attempting to cross the English Channel Farage's visit comes against a backdrop of increased tension and rhetoric around the immigration. On Tuesday, the Reform leader launched a scheme called Operation Restoring Justice, aimed at tackling the migrant issue. He said Reform would deport 600,000 migrants over five years if it won power at the next election. Farage said his party would bar anyone who comes to the UK on small boats from claiming asylum, under plans announced earlier. It says it would make £2bn available to offer payments or aid to countries like Afghanistan to take back migrants, with sanctions potentially imposed on uncooperative countries. His comments came after a poll, by the David Hume Institute and Diffley Partnership, suggested 21% of Scots think immigration is one of the top three issues in the country, up from 16% in May and just 4% in May 2023. It means immigration is now seen as the third biggest priority for the country, with only health and the cost-of-living crisis regarded as more important by voters. SNP slam Reform policies Speaking to the BBC's Good Morning Scotland programme a few hours ahead of Farage's visit, MP Stephen Gethins attacked the Reform MP for his \"extraordinarily damaging\" policies and rhetoric on immigration. Gethins, who is the SNP foreign affairs spokesman at Westminster, questioned Reform plans to work with the Taliban to send people back to Afghanistan, as well as having the UK leave the European Convention on Human Rights (ECHR). He said Brexit - which Farage campaigned for - had \"pushed up the small boats crisis\" in the UK. \"He is the architect, along with people like Boris Johnson and others, of the small boats crisis,\" he said. \"Now he wants to remove us from the European Convention on Human Rights, which was the convention introduced at the end of the Second World War to give us some of the most basic rights, like prohibition of torture and right to life and all these other basic things we take for granted.\" Gethins said these policies show Farage \"is an extraordinarily damaging politician\". \"I think most people can see that doing a deal with the Taliban to send back women, human rights advocates and others who have campaigned against that brutal regime is unrealistic,\" he added. \"I don't think it is realistic, and I think any basic reading of this is unrealistic. \"That is why Nigel Farage is one of the most disastrous politicians. He is one of the most consequential, but not in a good way.\" It felt like it was only a matter of time until a Conservative MSP jumped ship to Reform. With a Holyrood election next year, the Tory position looks bleak. Reform UK seems to be on the up. Graham Simpson's name was one that was doing the rounds as a likely defector. The Conservatives seem to be leaking MSPs fast. Will he be the last to depart? Simpson seems to see this as an opportunity to help shape something new. It may also be a route to make his re-election to Holyrood next year more likely. Graham Simpson is a big campaigner for recall - the right to essentially fire your MSP under certain circumstances. Ironically, there will be plenty who think that switching parties should be grounds for that. But Simpson insists it's right that he stays put on the Holyrood benches. Violence fears as council says asylum protesters being 'bussed in' Asylum hotel protests 'understandable', says Scottish Tory leader Campaigners say anti-asylum hotel protesters are 'extremists' Scotland Nigel Farage Scottish Conservatives Scottish Parliament Reform UK",
    "reactions": [
      "Latest update from BBC Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "52de4ad093269ab86f5e8cf7c61cd4e8",
    "title": "Watch: Balloons, balls and paper clips, did BBC Breakfast set a world record?",
    "source": "https://www.bbc.com/news/videos/cpwy94e00njo?at_medium=RSS&at_campaign=rss",
    "generatedAt": "2025-08-27T11:06:41.708Z",
    "publishedAt": "2025-08-27T10:48:25.000Z",
    "feedName": "BBC Top Stories",
    "author": "BBC Top Stories",
    "category": "General",
    "essence": "Balloons, balls and paper clips, did BBC Breakfast set a world record? To mark 70 years since the Guinness World Records first began to authenticate thousands of records in things like sport, technology, and the human body, our BBC breakfast presenters tried their hand at setting some of their own. 18 minutes ago BBC World records Share Save Downton Abbey 'iconic' props and costumes up for auction Props, costumes and set pieces from the popular British historical drama Downton Abbey are being auctioned for charity in London. 8 days ago Culture 'One-take wonder': David Jason on that iconic chandelier scene The British actor who portrayed Del Boy in the TV show Only Fools and Horses told BBC Breakfast about how the backstage crew reacted to the show's famous chandelier scene 14 Aug 2025 Culture 'I'm never washing this shoulder': BBC meets stars of Freakier Friday The stars of the Freaky Friday sequel speak to the BBC about the story and the friendship between the on-screen mother and daughter. 31 Jul 2025 Culture Music broke barriers in the Troubles - Fatboy Slim Ahead of his Belfast gig, DJ Fatboy Slim reminisces about his first visit to the city in the 1980s. 29 Jul 2025 Culture Watch: The story of Jane Birkin's £7.4m handbag Jane Birkin's original Hermès bag sells for a record-breaking €8.6m (£7.4m; $10.1m) at an auction in Paris. 10 Jul 2025 Culture Watch: Moment Oasis take to the stage for first gig in 16 years The Gallagher brothers play their first concert since reuniting, in front of a packed Cardiff stadium. 4 Jul 2025 Culture Watch: Kim Woodburn's memorable TV moments The TV personality appeared on several reality shows, after rising to fame on How Clean Is Your House. 17 Jun 2025 Culture 'As awkward as it gets': Ricky Gervais gets star on Hollywood Walk of Fame The British actor says he is \"humbled\" and his success was \"luck, persistence, and a little bit of pushing against the tide\". 31 May 2025 Culture Bessie Carter on why Netflix's Bridgerton was such a hit 25 May 2025 Culture Key looks from the Cannes Film Festival red carpet From Quentin Tarantino to Bella Hadid - celebrities hit the red carpet as the 78th Cannes Film Festival kicked off in the South of France. 14 May 2025 Culture Watch: Best moments of 2025 TV Baftas in under two minutes Emotional speeches, funny moments and heartwarming wins - here are some of the best moments of the evening. 11 May 2025 Culture Yungblud: 'I can't play a festival that's £800 a ticket' The singer and musician said he decided to launch his own festival as he was tired of the status quo. 11 May 2025 Culture Strictly star reveals how to 'dance like your gran' for VE Day 8 May 2025 Culture David Hockney: People would mock my accent 8 Apr 2025 Culture Davina McCall 'feels amazing' returning to work after brain tumour TV presenter Davina McCall says going back to work is \"like the final piece of the jigsaw.\" 17 Mar 2025 Culture Watch: What did we learn from Meghan's new Netflix show? The BBC's Daniela Relph takes a look at the Duchess of Sussex's new lifestyle series, 'With love, Meghan'. 4 Mar 2025 Culture From wedding videos to four Oscars: Anora director speaks to the BBC Baker is the first person to win four Oscars for one film, including Best Director. 3 Mar 2025 Culture Martin Compston on his love for Vegas and Greenock The Greenock-born actor says that despite liking life in the US, nothing beats his hometown. 1 Mar 2025 Culture EastEnders star says wife not over the moon at Martin's exit James Bye, aka Martin Fowler, came to a tragic end in the soap's special 40th anniversary live episode. 24 Feb 2025 Culture SAG Awards: Winners revealed on a glittering night in LA Conclave and Shogun took the top honours in film and TV while Jane Fonda accepted a lifetime achievement award 24 Feb 2025 Culture",
    "reactions": [
      "Latest update from BBC Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "e2ff82d2e79de1d076438854bd16b667",
    "title": "Investigations into deaths following Belfast dance music festival",
    "source": "https://www.bbc.com/news/articles/cgjye9wlx63o?at_medium=RSS&at_campaign=rss",
    "generatedAt": "2025-08-27T11:06:42.541Z",
    "publishedAt": "2025-08-27T10:40:07.000Z",
    "feedName": "BBC Top Stories",
    "author": "BBC Top Stories",
    "category": "General",
    "essence": "Investigations into deaths following Belfast dance music festival 26 minutes ago Share Save Peter Coulter BBC News NI Share Save Mia Keevan/Handout Mia Keevan, 17, and Trae Keenan died in separate incidents after attending Emerge music festival Investigations are continuing after two young people died and two remain in hospital after attending the Emerge dance music festival in Belfast at the weekend. Mia Keevan, 17, from County Tipperary in the Republic of Ireland, took unwell at the event and died shortly afterwards in hospital. In a separate incident 24-year-old Trae Keenan, from County Down, died in rented accommodation in the city centre a few hours after the event ended. Shine productions, which organised the festival, has been approached for comment. Emerge music festival is the biggest dance music event in Northern Ireland. It usually takes places over the August bank holiday weekend at Boucher Playing Fields in south Belfast and attracts crowds of about 40,000 dance music fans each day. This year the festival was headlined by Fatboy Slim on Saturday and Bicep on Sunday, while Sammy Virji, Fjaak, Sonny Fodera and Danny Howard were also on the line up. Pacemaker Around 80,000 people attended the Emerge festival over the weekend Mia was visiting Belfast from Carrick-on-Suir to attend the event. Investigations are still continuing into what caused her death. Belfast district commander Supt Allister Hagan said: \"During the event it was reported that a 17-year-old girl had become unwell. Sadly, she subsequently died in hospital.\" \"Police remained on the event site until Monday afternoon, 25 August. \"An investigation in order to establish the circumstances surrounding the tragic sudden death of this young person is ongoing, and our thoughts are with the family and friends of the deceased.\" Sarah Roche, who is raising money for Mia's family, posted on an online fundraising page to say the teenager was a \"bright, fun and much loved girl who touched the hearts of anyone that knew her\". \"Mia was such an outgoing person and lit up every room she walked into,\" she said. \"Her laughter and warmth will never be forgotten by those lucky enough to have known her.\" Belfast City Council, which operates Boucher Playing Fields, said it \"was deeply saddened by the death\" and added that it sent \"sincere condolences to the young person's family at this difficult time\". pacemaker The annual event is held at Boucher Playing Fields in south Belfast Mr Keenan also attended the festival and took unwell and died after he returned to his rented accommodation in Belfast. He worked as a chef and had a four-month-old son. In a funeral notice he was described as a \"dearly beloved son of Pamela and John and cherished father of Mason, loving brother of Shanice, Tyler, Claire and Toni and loving partner of Tiffany\". Speaking to the Irish News, Shanice said the family was devastated following his death. \"Trae was someone that would do anything for anyone,\" she said. \"He was very funny, very strong-hearted. He had the biggest smile you could ever see. He had so much stride in his walk. \"The whole town just loved him; everyone adored him. \"It still doesn't feel real. It's horrible. \"From his videos and stuff, he had the best night, he really did. But it is terrible how it ended.\" The Irish News reported Mr Keenan had previously suffered from heart complications and asthma. The family told the newspaper he had suffered a panic attack and his death was not linked to drugs. Pacemaker Acts like Fatboy Slim and Bicep were headlining the event over the weekend Police are still investigating both deaths and said a number of arrests were made over the weekend. Supt Hagan said several organisations - including the Police Service of Northern Ireland and Belfast City Council were involved with making sure the festival passed off safely. He said officers made seven arrests over the weekend and issued three fixed penalty notices, one caution and nine community resolution notices. He said offences included disorderly behaviour, drink-driving, assault on police and possession of controlled drugs. City councillors have called for an emergency meeting with the event organisers. Call for 'urgent' meeting with festival organisers after 17-year-old girl dies Fatboy Slim and Bicep among stars at Emerge festival I expected 80s Belfast to be a 'warzone', says Fatboy Slim Belfast Northern Ireland Police Service of Northern Ireland Music festivals",
    "reactions": [
      "Latest update from BBC Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "fbe3a2900eef5e4daef89f6efca5e13c",
    "title": "'Powerful explosion' rocks Russian oil pipeline supplying Moscow, intelligence source claims",
    "source": "https://www.reddit.com/r/worldnews/comments/1n1dglo/powerful_explosion_rocks_russian_oil_pipeline/",
    "generatedAt": "2025-08-27T11:06:47.767Z",
    "publishedAt": "2025-08-27T10:35:35.000Z",
    "feedName": "Reddit r/worldnews",
    "author": "/u/Sufficient_Brush_473 https://www.reddit.com/user/Sufficient_Brush_473",
    "category": "General",
    "essence": "Go to worldnews r/worldnews r/worldnews 🌎🌍🌏 A place for major news from around the world, excluding US-internal news. Members Online • Sufficient_Brush_473 'Powerful explosion' rocks Russian oil pipeline supplying Moscow, intelligence source claims Russia/Ukraine kyivindependent.com Open Share",
    "reactions": [
      "Latest update from Reddit r/worldnews",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "be1e5d3f4e76fa8e338b7d199c6305e8",
    "title": "Man arrested on suspicion of murder of 84-year-old in County Down",
    "source": "https://www.theguardian.com/uk-news/2025/aug/27/man-arrested-death-sean-small-newcastle-county-down",
    "generatedAt": "2025-08-27T11:06:43.666Z",
    "publishedAt": "2025-08-27T10:28:31.000Z",
    "feedName": "The Guardian",
    "author": "Rory Carroll Ireland correspondent",
    "category": "Northern Ireland",
    "essence": "The body of Sean Small was found on Sunday in Slievenabrock Avenue, Newcastle, County Down. Photograph: Jonathan McCambridge/PA View image in fullscreen The body of Sean Small was found on Sunday in Slievenabrock Avenue, Newcastle, County Down. Photograph: Jonathan McCambridge/PA Northern Ireland Man arrested on suspicion of murder of 84-year-old in County Down Suspect detained after Sean Small, who had recently served prison sentence for sex offences, found dead in Newcastle Rory Carroll Ireland correspondent Wed 27 Aug 2025 12.28 CEST Last modified on Wed 27 Aug 2025 12.39 CEST Share Police in Northern Ireland have arrested a man on suspicion of the murder of Sean Small, an 84-year-old who had recently served a prison sentence for sex offences. The suspect, in his 40s, was detained on Tuesday two days after Small’s body was discovered outside his home on Slievenabrock Avenue in Newcastle, County Down. Police said the victim was last seen alive on 19 August and at some point between then and 24 August he had sustained a “brutal and sustained attack”. In 2022, Small pleaded guilty to 10 sexual offences against a woman described as “vulnerable” and a teenage girl. He was sentenced to three years in prison and three years under supervision in the community, and had recently returned home. Police said they had an open mind about the motive for the incident and asked the public to not speculate. A postmortem is under way to establish the time and manner of death. “I know the local community will be in shock following the news of this crime,” Det Ch Insp Kerrie Foreman told reporters on Tuesday. “Detectives are working as quickly as possible to understand how and why this has taken place.” She confirmed there had been an incident of criminal damage at Small’s house several weeks ago. He lived on a quiet, residential street in the seaside town. Crimestoppers have offered a reward of up to £20,000 for information that leads to arrest and conviction of those responsible for the murder. The mother of one of Small’s victims told the Belfast Telegraph that neither she nor her daughter had been notified of his release but there had been a rumour in recent weeks that he was out of prison. Explore more on these topics Northern Ireland news Share Reuse this content",
    "reactions": [
      "Latest update from The Guardian",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "0d367f84b594797aaaff36a75972a2b7",
    "title": "Tory chair says party would consider deal with Taliban to return Afghan migrants – UK politics live",
    "source": "https://www.theguardian.com/politics/live/2025/aug/27/conservatives-consider-deal-afghanistan-migrants-uk-politics-latest-updates-news",
    "generatedAt": "2025-08-27T10:32:21.343Z",
    "publishedAt": "2025-08-27T10:19:00.000Z",
    "feedName": "The Guardian",
    "author": "Amy Sedghi",
    "category": "Politics",
    "essence": "09.19 CEST Conservatives could 'potentially' strike a deal with Taliban-run Afghanistan to return migrants, says party chair The Conservatives could “potentially” strike a deal with Afghanistan over migration, the party’s chair has said. Asked directly if the Tories would set up a returns agreement with the Taliban -run country, Kevin Hollinrake told Times Radio: “Well, potentially, yes.” The former minister added that his party’s deportation plan, which was published in May, is “far more comprehensive than the one we’ve seen from Reform, in that it dealt with both legal migration and illegal migration”. The Conservatives could “potentially” strike a deal with Afghanistan over migration, the party’s chair Kevin Hollinrake has said. Photograph: Lucy North/PA Conservative leader Kemi Badenoch had refused to say whether she would consider seeking such an agreement when pressed on the issue on Tuesday. Meanwhile, Nigel Farage has been accused of “ugly” and “destructive” rhetoric after announcing plans to deport hundreds of thousands of asylum seekers and pledging to pay despotic regimes such as the Taliban to take them back. Unveiling Reform UK ’s “Operation Restoring Justice” at a combative press conference in Oxford , Farage said he would rip up the UK’s postwar human rights commitments, contained in a range of international conventions, to deport “absolutely anyone” – including women and children – arriving by small boat. Elsewhere, the Government has said it wants to get a permanent deal with the EU on food and drink agreed in the next 18 months, as it sets out its stall ahead of talks later this year. Cabinet Office minister Nick Thomas-Symonds and Conservative party chair Kevin Hollinrake are on today’s morning media round. I’ll bring you any interesting lines from them as they come in. But first, here are some other developments: UK companies spent up to £65m last year on licences to export food and agricultural products to the EU – costs that the government is promising to eliminate as part of a new deal to be agreed by 2027. Government figures released on Tuesday showed it issued 328,727 such licences last year, at a cost of between £113 and £200 each. That would put the total cost to business at somewhere between £37m and £65m. The cost of UK government borrowing has jumped to near a 27-year high, piling pressure on Rachel Reeves to reveal how she will tackle the deficit in the public finances before the autumn budget. The yield, or interest rate, on the UK’s 30-year bond rose by eight basis points (0.08 of a percentage point) on Tuesday to 5.62%. Ministers have approved plans to help a further 30 students leave Gaza to take up places at UK universities next month but their evacuation remains uncertain and dependent on Israel’s approval. It takes the total to 39, after a government commitment last week to work to secure the evacuation from Gaza of nine Chevening scholars with places at some of the UK’s leading universities. Energy costs will rise for millions of British households this autumn after the price cap for a typical annual dual-fuel bill increased by 2% to £1,755. The energy regulator for Great Britain, Ofgem , will raise the cap on gas and electricity charges from October by the equivalent of just over £35 a year for the average home, following a rise in European gas prices. Share",
    "reactions": [
      "Latest update from The Guardian",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "24847e5646a3f263a49181eb87c1017c",
    "title": "How achievable is Reform's plan on migration?",
    "source": "https://www.bbc.com/news/articles/cx29l0wqlgeo?at_medium=RSS&at_campaign=rss",
    "generatedAt": "2025-08-27T10:32:18.751Z",
    "publishedAt": "2025-08-27T10:11:14.000Z",
    "feedName": "BBC Top Stories",
    "author": "BBC Top Stories",
    "category": "General",
    "essence": "How achievable is Reform's plan on migration? 21 minutes ago Share Save Dominic Casciani Home and Legal Correspondent • @BBCDomC Share Save Getty Images Reform UK leader Nigel Farage (R) and chair Zia Yusuf following the party's new policy Nigel Farage has set out how a Reform government would tackle what he called \"uncontrolled illegal migration\" – with moves including human rights law changes, and mass deportations. But how deliverable are the plans? Let's start with the headline figure of how many people the party badges as illegal migrants (the precise definition of this is up for debate) that it says it will deport. There's no figure in the party's document - but during the event Nigel Farage asked Reform UK chair Zia Yusuf whether it was realistic to deport 500,000-600,000 people within the lifetime of the first Parliament under a Reform UK government, to which he replied \"totally, yeah\". The party is proposing to create secure facilities to hold 24,000 to be deported every month - that gives us another figure of 288,000 a year, ramping up after 18 months of building work. Removing 6,000 people per week would, using today's operations as a guide, require an average of 1.7 escorting officers per individual removed. When you break that down into departing planes per day, that's within the maths for the party's projection of five flights per day. But these targets are far in excess of what any government has ever achieved. An average of 158 people per flight, plus security, would require the equivalent of five jumbo jets to be available all year around. That per flight number of 158 is three times higher that the numbers currently removed on the most-packed departures. One problem is nobody knows how many people are in the UK without permission or where they are. Evidence shows many of them are in vulnerable situations, including in what amounts to modern day slavery. Reform thinks it can find them with \"cutting edge data fusion\" and says it would give the state access to a vast range of personal information that it currently cannot obtain without a good reason. Any \"police encounter\" would involve \"mandatory biometric capture\", the party document says, far beyond anything that officers can currently do without first arresting you. Reform hopes this information will more quickly identify candidates for removal - but the wide scope of the plan could conflict with the UK's tough data protection and privacy laws. There is also a warning from history, with the government paying out more than £105m in compensation to thousands of people and their families who were caught up in the Windrush scandal . What would such a scheme cost? No government has ever tried to build prison-like detention facilities for 24,000 people in 18 months - the time scales envisaged by Reform - or at the cost claimed. For detention facilities to be escape-proof, they have to be the equivalent of what's known as a \"Category B\" prison - which means there are walls and locked doors, wings and gates everywhere with a suitable level of staffing. Official figures from the current prison programme show that it costs about £500,000 per bed to build such such \"closed\" facilities - and that's broadly the design standard used for immigration removal centres too. That means that if the party in government were to build 24,000 new detention spaces to that standard, it would cost about £12bn. Reform says it will build them for less by creating \"modular accommodation\" in remote parts of the UK. There are three immediate questions. First, would a modular plan meet the security standards? Second, where would they be built? Thirdly, how would they deal with local planning concerns which have repeatedly massively delayed prison building schemes in the UK? New laws could make scheme possible Boris Johnson's government promised 20,000 new prison spaces - but over five years only opened one new prison - partly because of planning disputes. The plan involves creating new laws to fast-track people into detention and removal from the UK - and providing the legislation is correctly worded, there is nothing in principle to say that Parliament could not create such a scheme. But it has been tried before and failed. In 2010 and then in 2015 judges ruled that accelerating failed asylum seekers through to removal was unlawful. The courts found in 2015 that fast-tracking conflicted with one of the UK's basic legal principles: the opportunity to fairly put your case before a court rules against you. So the challenge for Reform is how they deal with the fact that everyone has a right to be heard. One approach would be to say that it does not apply to immigration cases. That would inevitably faced sustained challenge on constitutional principles all the way up to the Supreme Court. Who knows if a carefully worded new law could see that off. But the fact is that good law takes time to write - and Reform would also have to unpick a lot of other laws too. That takes Parliamentary time to get right. Labour's current plan to \"smash the gangs\" by creating new counter-terrorism style powers to target people smugglers can't be said to be working or not yet because it is still being debated by Parliament. Assuming Reform's plan is bigger than that, experience shows that new laws of this magnitude can take at least a year to become a reality. A new government could, with a mandate and healthy majority, try to push it through faster - but policy advisers in Whitehall would warn ministers that rushing the job means a bad job that could later become unworkable. Reform prepared to deport 600,000 under migration plans How Reform has changed the debate on migration Farage vows mass deportations to tackle small boats Pulling out of the ECHR? Part of Reform's argument that it will do more because it will pull out of three treaties including the European Convention on Human Rights (ECHR) and the UN Convention Against Torture. A Reform government could indeed do so - although it would lead to some thorny legal problems if a lots of other laws linked to both were not unpicked at the same time. But it's not clear whether such moves would really do as much as Farage suggested. The ECHR is not, for instance, a bar on removing someone from the UK - and there is appetite among some European governments to tinker with it. As for the UN convention on torture, that kind of abuse has been outlawed in the UK, by our own laws, since 1640. If the UK pulled out of treaties, the risk is that our government loses international influence that it has built up over decades. There are two specific consequences of leaving the ECHR. Doing so would breach clearly written guarantees in Northern Ireland's 1998 Good Friday agreement which have been the bedrock of peace and prosperity there since in 1998. A Reform government could argue that its proposed Bill of Rights would do the same job - but that would be a tough sell to NI's nationalist community and to Dublin, the co-sponsor and guarantor of the political settlement that largely ended the violence. Separately, there is the question of trade and co-operation with all our nearest neighbours in the EU. The Brexit deal signed by the UK and EU member states says both remain under an \"obligation to respect fundamental rights and legal principles as reflected, in particular, in the European Convention on Human Rights\". How would the EU react? Would there be an economic consequence, even if that had not been the intention? Incentives to leave One of the side-ideas in the plan is to pay people up to £2,500 to leave the UK voluntarily. This is not new and the current scheme saves the government huge sums because paying people to go is cheaper than using the courts. Reform's offer is less than the £3,000 currently on offer. In the year ending June 2025, 26,761 people took up a deal to voluntarily leave the UK. That's 13% up on the previous year and approaching record levels of more than 30,000 returns, seen between 2010 and 2014. Finally, there is the question of £2bn to persuade other countries into returns deals. It's difficult to know how far that cash will travel. Would there be one-off payments or would a government get an annual performance-related pay-out? Rwanda's ministers proved to be such good negotiators they squeezed the UK's wallet for £700m - and received nobody in return. And who would the UK be prepared to hand cash to? Would a Reform government give British taxpayer's money to the Taliban regime with its dire record of the treatment of women? How would such payments work given the UK is a key player in the international sanctions that target its leaders? How many people cross the Channel in small boats? Difficult decisions lie ahead after asylum seeker hotel ruling Nigel Farage Refugees and asylum seekers Reform UK Migration",
    "reactions": [
      "Latest update from BBC Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "99bdfa5de2105842d95bfc77941e900d",
    "title": "In idyllic Porepunkah, a manhunt this huge feels ‘surreal’ – and the alleged killer could be anywhere",
    "source": "https://www.theguardian.com/australia-news/2025/aug/27/porepunkah-victoria-manhunt-alleged-killer-bush-search-ntwnfb",
    "generatedAt": "2025-08-27T10:32:21.393Z",
    "publishedAt": "2025-08-27T10:07:32.000Z",
    "feedName": "The Guardian",
    "author": "Catie McLeod",
    "category": "Porepunkah shooting",
    "essence": "Police allow ambulance vehicles through a roadblock on Mt Buffalo Road, just west of Porepunkah. Photograph: Stuart Walmsley View image in fullscreen Police allow ambulance vehicles through a roadblock on Mt Buffalo Road, just west of Porepunkah. Photograph: Stuart Walmsley Porepunkah shooting In idyllic Porepunkah, a manhunt this huge feels ‘surreal’ – and the alleged killer could be anywhere A peaceful Victoria town has been rocked by the fatal shootings of two police officers, leaving locals shuttered indoors and police scouring bushland for the suspect Who is Dezi Freeman? Porepunkah shooting suspect called police ‘terrorist thugs’ and tried to arrest magistrate How a police search warrant at a rural Victorian property ended in a day of tragedy Get our breaking news email , free app or daily news podcast Catie McLeod in Porepunkah Wed 27 Aug 2025 12.07 CEST Last modified on Wed 27 Aug 2025 12.25 CEST Share It would have been idyllic were it not for the sound of a police helicopter reverberating over the valley. By late afternoon on Wednesday the rain had slowed to a drizzle in Porepunkah. Mist curled around the foothills of Mt Buffalo. Cows and sheep grazed under a grey sky, unperturbed by the massive manhunt around them. A day before, Dezi Freeman had vanished into the dense bushland surrounding the semi-remote property he lived on after he allegedly shot and killed two police officers and injured a third after they came to execute an arrest warrant on him. View image in fullscreen A police helicopter lands at an operations centre just north of Porepunkah. Photograph: Stuart Walmsley They were detective leading senior constable Neal Thompson, 59, a local detective planning his retirement, and senior constable Vadim De Waart, 35, who was on temporary assignment in Victoria’s alpine region. Freeman had been living with his family on a bush block at the end of a dirt road a few kilometres outside Porepunkah, a small town in Victoria’s high country surrounded by bushland on one side and pine plantations on the other. View image in fullscreen Senior constable Vadim De Waart (L) and detective leading senior constable Neal Thompson were allegedly killed by Dezi Freeman in Porepunkah on Tuesday morning. Composite: Victoria Police Journalists and camera crews that had stopped at a police roadblock on Mt Buffalo Road on Wednesday evening thought they heard what sounded like shots from the direction of the property. Paramedic cars and unmarked police vehicles arrived not long afterwards. But the latest from police on Wednesday evening was that the search would continue. A convoy of police vehicles including armoured Bearcats were seen leaving the roadblock area where the alleged shooter had been living. The roadblock remained in place and Victoria police said there would be no extra information on Wednesday evening. Sign up: AU Breaking News email The Victoria police chief commissioner, Mike Bush, on Wednesday morning conceded Freeman, a “sovereign citizen” who had professed his hatred of police during previous brushes with the law, understood bushcraft well and knew the land better than the scores of officers searching for him. There had been no confirmed sightings of Freeman since the attack, Bush said. He said police had not recovered any firearms from the property where the shooting took place, leading officers to believe Freeman had taken them all with him. View image in fullscreen Victoria police chief commissioner Mike Bush speaks to the media during a press conference at police headquarters in Melbourne. Photograph: Joel Carrett/AAP Bush said there was no reason to believe Freeman had left the area, and that every available officer had been deployed in the effort to find him. Almost a decade ago, the force used similar resources in the same region while hunting armed fugitives Mark and Gino Stocco, who had also shot at police. Marty Robinson, who owns the mechanic shop in town, said he knew Freeman and his family. He described Freeman as a “new age Ned Kelly” who would be “pretty handy in the bush” even with up to a metre of snow forecast for the region over the next three days. The manhunt in Porepunkah continues - podcast Read more “I’m not saying he’s a hero or a legend but he’s someone’s father.” Standing on Porepunkah’s main street, gesturing up at the hills behind him, Robinson said the police “could be up there for weeks looking for” him. Unprompted, Robinson remarked on Freeman’s fringe views. “He doesn’t fit in and he doesn’t go along with the rules and he’s an antivaxxer – that’s all probably true,” he said. Robinson said Porepunkah still felt like a “sleepy little town” to him. Other residents said they were shocked. View image in fullscreen Marty Robinson walks back in to his mechanic business, Marty’s Garage. He says Porepunkah still feels like a ‘sleepy little town’. Photograph: Stuart Walmsley Porepunkah is in a picturesque part of north-eastern Victoria, not far from Falls Creek and Mt Hotham. The petrol station on the main street doubles as place to hire ski gear. skip past newsletter promotion Sign up to Breaking News Australia Free newsletter Get the most important news as it breaks Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion One local, who asked not to be named, said the town was “wholesome” and home to a “really lovely community”. “It’s not some conspiracy theorist town,” they said. “What’s happened – in any place [it would be] so far out of the ordinary. So it’s quite surreal really.” On such a wintry day, you could imagine most people would have remained indoors even if police, who transformed a local winery into a temporary operations centre, hadn’t sent automated text messages to everyone in the area warning them to stay inside while Freeman was on the run. View image in fullscreen One local says Porepunkah is ‘wholesome’ and home to a ‘really lovely community’. Photograph: Stuart Walmsley/The Guardian Those who left home to go to work, or ducked out to get a coffee or collect their mail, were met with a throng of journalists, photographers and camera crews in town, most of whom who had driven up from Melbourne. Another Porepunkah local, Jesslyn Ellis, said she lived down the road from Freeman and believed he had lived in the area for about 25 years. “I never really knew him but I knew of him,” she said. “I just feel so sorry for his family. Obviously, I feel for the police and their families too.” Despite the inclement weather, Ellis said she was sure Freeman knew “how to look after himself” out in the bush. “He could be in a cave. He could be down a mine. He could show up anywhere,” she said. View image in fullscreen Porepunkah resident Jesslyn Ellis. Photograph: Stuart Walmsley Kealan Lee, who was driving through the town on his way home to Yarrawonga from a visit to the dentist, said it was a “pretty rugged” place. “I used to come up here four-wheel driving as a kid. There’s not much open space,” he said. “Where he is and how they’re gonna find him, that’s anyone’s guess.” With additional reporting by Cait Kelly Explore more on these topics Porepunkah shooting Victoria Australian police and policing news Share Reuse this content",
    "reactions": [
      "Latest update from The Guardian",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "51293765adbb78be65909fed257b4141",
    "title": "Denmark summons US charge d’affaires over alleged attempts to interfere with Greenland’s status – Europe live",
    "source": "https://www.theguardian.com/world/live/2025/aug/27/volodymyr-zelenskyy-substantive-talks-eu-us-security-guarantees-ukraine-europe-latest-updates-news",
    "generatedAt": "2025-08-27T10:09:57.227Z",
    "publishedAt": "2025-08-27T10:05:02.000Z",
    "feedName": "The Guardian",
    "author": "Jakub Krupa",
    "category": "World news",
    "essence": "10.03 CEST Denmark summons US charge d'affaires over alleged attempts to interfere with Greenland's status We are getting big news just in from Denmark , which has summoned the US charge d’affaires in the country over alleged attempts to interfere with the status of Greenland, a long-term point of interest for the new US administration of Donald Trump. In a comment to public broadcaster DR , foreign minister Lars Løkke Rasmussen said that “any attempt to interfere in the Kingdom’s internal affairs will obviously be unacceptable.” The move comes after DR reported that Danish intelligence services have uncovered a network of “at least three” people working on “influence operations” in Greenland to drive a wedge between Denmark and the territory , in a bid to pave the way for it to get closer to the United States. The broadcaster said it knew the names of the three American men involved in the operations, but chose not to publish them to protect sources. It said they were previously known to be close to Trump, but it was not immediately clear if they worked on the White House’s order or on their own. It alleged that one of the men visited Greenland to attend meetings and compile a list of potential allies and opponents of Donald Trump’s plans to take over the territory. He also allegedly urged Greenlanders to “point out cases that could be used to put Denmark in a bad light in American media,” DR said. The two other men were allegedly involved in building networks of contacts with politicians, business figures and community leaders to pursue Trump’s plans. The meeting with the US charge d’affaires is expected later today , Rasmussen said. In May, Wall Street Journal also reported that the US stepped up its intelligence operations to spy on Greenland, also prompting Rasmussen to summon US envoy for a chat. Denmark to summon US envoy over report of Greenland spying directive Read more A Greenlandic parliamentarian, Aaja Chemnitz , told DR that it was unacceptable to “try to infiltrate Greenlandic society in this way,” insisting that “it is Greenland itself that must decide what we want and what kind of future we want.” Share",
    "reactions": [
      "Latest update from The Guardian",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "2ca228f78a39a0ecb0aca8c186dc35a6",
    "title": "Donald Trump to chair meeting on Gaza as US says it expects ‘to settle this before the end of this year’ – Middle East crisis live",
    "source": "https://www.theguardian.com/world/live/2025/aug/27/donald-trump-meeting-white-house-gaza-israel-middle-east-crisis-latest-updates-news",
    "generatedAt": "2025-08-27T10:09:57.467Z",
    "publishedAt": "2025-08-27T10:04:35.000Z",
    "feedName": "The Guardian",
    "author": "Joe Coughlan",
    "category": "Israel",
    "essence": "09.23 CEST Meeting on Gaza scheduled as US expects to 'settle this before the end of this year' US special envoy Steve Witkoff said on Tuesday that president Donald Trump would chair a meeting on Gaza at the White House on Wednesday and added that Washington expected Israel’s war in the Palestinian territory to be settled by the end of the year, Reuters reports. The US state department separately said secretary of state Marco Rubio will meet Israeli foreign minister Gideon Saar in Washington on Wednesday, which is expected to take place at 3.15pm ET (7.15pm UK time). When asked on Fox News’ “Special Report with Bret Baier” show if there is a postwar plan for Gaza , Witkoff said: Yes, we’ve got a large meeting in the White House tomorrow, chaired by the president, and it’s a very comprehensive plan we’re putting together on the next day. He did not elaborate further and did not list the meeting’s participants. When asked should Israel be doing anything differently to end the war and secure the release of the hostages, Witkoff said: We think that we’re going to settle this one way or another, certainly before the end of this year. Witkoff said Israel was open to continuing discussions with Palestinian militant group Hamas . He said Hamas had signaled it was open to a settlement. Share Updated at 09.29 CEST",
    "reactions": [
      "Latest update from The Guardian",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "8eea1ce205fe2f89a9be557a748db793",
    "title": "Palace agree deal for Villarreal and Spain winger Pino",
    "source": "https://www.bbc.com/sport/football/articles/cde3w1l7pddo?at_medium=RSS&at_campaign=rss",
    "generatedAt": "2025-08-27T10:32:19.045Z",
    "publishedAt": "2025-08-27T10:02:24.000Z",
    "feedName": "BBC Top Stories",
    "author": "BBC Top Stories",
    "category": "General",
    "essence": "Palace agree £26m deal for Villarreal winger Pino Image source, Getty Images Image caption, Pino has started in both of Villarreal's La Liga games this season Sami Mokbel Senior football correspondent Published 29 minutes ago 15 Comments Nizaar Kinsella Football reporter Crystal Palace have agreed a deal in principle worth up to £26m with Villarreal for Spain winger Yeremy Pino. The 22-year-old is believed to be open to a move to Selhurst Park and is expected to complete a medical in the coming days. Pino has a £69m release clause, but with there being less than two years left to run on his contract, Villarreal have decided to accept Palace's offer. The Eagles have moved for Pino after England forward Eberechi Eze's £60m move to Arsenal last week. Eze, 27, was Palace's talisman last season, scoring 14 goals and recording 11 assists in 43 games as the club won the FA Cup - the first major trophy in their history. After Palace's 1-1 draw with Nottingham Forest at the weekend, manager Oliver Glasner said he was \"very confident\" the club would make new signings before deadline day on Monday following a quiet transfer window. The club have made only two signings this summer - goalkeeper Walter Benitez's arrival from PSV Eindhoven on a free transfer and defender Borna's Sosa's £3m move from Ajax. Palace have also made a move for Manchester City's 30-year-old Switzerland defender Manuel Akanji, who the club value at £15m. Winger Pino came through Las Palmas' youth set-up before joining Villareal in 2017. He made his full debut in 2020 and scored four goals in 34 league games last season to help Villarreal finish fifth and qualify for the Champions League. Pino has scored three goals in 15 internationals for Spain since making his debut in 2021. Related topics Premier League Crystal Palace Football More on this story Latest Crystal Palace news, analysis and fan views Ask about Crystal Palace - what do you want to know?",
    "reactions": [
      "Latest update from BBC Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "b48c982abafaf85915056864fa45e314",
    "title": "Girl who stabbed teachers fascinated by weapons and war, report says",
    "source": "https://www.bbc.com/news/articles/ceqye7n8l88o?at_medium=RSS&at_campaign=rss",
    "generatedAt": "2025-08-27T10:32:19.928Z",
    "publishedAt": "2025-08-27T10:01:03.000Z",
    "feedName": "BBC Top Stories",
    "author": "BBC Top Stories",
    "category": "General",
    "essence": "Girl who stabbed teachers fascinated by weapons and war, report says 31 minutes ago Share Save Meleri Williams BBC News Share Save The moment before a teenage girl stabs teachers at Ysgol Dyffryn Aman A teenage girl who stabbed two teachers and a pupil last year had previously been found with a knife, BB gun and war memorabilia in her school bag, a review has found. The girl, who cannot be named due to her age, was 13 at the time of the attack at Ysgol Dyffryn Aman in Carmarthenshire on 24 April 2024. Earlier this year, she was found guilty of attempted murder and was sentenced to 15 years in detention . A multi-agency review found the girl would have benefited from \"targeted help\" if \"information had been fully shared and assessed\". A joint statement on behalf of Carmarthenshire council, Dyfed-Powys Police, Hywel Dda health board and the school's headteacher said they would work on an action plan. 'I'm going to kill you' - how school day turned to chaos amid stabbing Girl, 14, who stabbed teachers sentenced to 15 years Teacher says school stabbing was like horror movie The independent review by Gladys Rhodes White found the girl was seen as \"quirky\" and had \"unusual interests\" in war memorabilia and Hitler. It added she had a fascination with weapons and would pretend to speak German and Russian. A BB gun [airgun] was found in her bag at a school she attended before she joined Ysgol Dyffryn Aman. In May 2023, the girl threatened to use a knife on another pupil, and a knife was found in her bag during a search in September 2023. These incidents led to her father agreeing to daily bag checks and the review found counselling support was offered, but refused. A referral to the Prevent anti-terrorism programme was considered but not pursued. The report found another referral was made for an Early Help assessment but her father declined it. Teachers Fiona Elias (left), Liz Hopkin (right) and a pupil were injured in the stabbing at Ysgol Dyffryn Aman last April During the trial at Swansea Crown Court, the jury heard the girl carried a knife to school every day as an \"instinct thing\" because she was bullied. On 24 April 2024 the teenager used her father's multi-tool knife and had told other pupils she would stab Ms Elias. She repeatedly stabbed her saying \"I'm going to kill you\" before Ms Hopkin was also stabbed as she intervened. The girl then ran at a 14-year-old pupil with the knife and stabbed her before she was restrained by teacher Darrel Campbell . She told police it was \"one way to be a celebrity\" after she was arrested. Judge Paul Thomas KC said the girl had not shown remorse and had attacked the three for attention. PA Media The teenager attacked the three using her father's multi-tool knife The review suggested the girl had mental health challenges and had a troubled childhood with \"fractured parental relationships\" and exposure to domestic abuse. The school had described her as showing distinctive behaviours that made her stand out from peers developmentally. The review found the school had raised concerns during a school mental health consultation that a knife had been found in her school bag which led to police involvement. The teachers told the independent review bullying was an ongoing issue for the teenager, including on the school bus. Ms Rhodes White said it was likely she was affected by several adverse childhood experiences. While the teenager had been referred to mental health services, the review added it was difficult to know whether her emotional health may have been impacted by neurodiversity, as an assessment or specific diagnosis for neurodiversity was not carried out. The teenager's father told the review he felt services had let his daughter and the family down, but the author suggested a \"pattern\" in agency records of support offers being \"declined or not followed up\". Ms Rhodes White concluded the girl had experienced \"several challenges which agencies had some awareness of at different times and in different ways\". \"Each agency had their own pieces of the jigsaw. In collating all the pieces of the jigsaw, there is a much clearer picture of the extent of concerns around [her] state of mind and her associated behaviours.\" But she said \"no information held by agencies identified a clear ability to foresee the shocking and unexpected events which occurred in April 2024\". Pupils at Ysgol Dyffryn Aman went into lockdown following the stabbings during morning break Ms Rhodes White made a total of 11 recommendations which included that \"consideration should be given at a local and national level to secure sufficient resources and capacity for agencies across all sectors, to be able to respond to ongoing increasing levels of complexity and needs of children and young people, particularly in schools\". She added the \"potential for facilitating better inter-agency sharing of comprehensive, relevant and chronological information\" should be explored. \"When children are subject to delays for assessments, diagnosis or treatment, due to long waiting lists, agencies need to consider how such children are monitored and helped during that time,\" she added. Ms Rhodes White also said agencies should consider prioritising training. In a joint statement, Carmarthenshire council, the headteacher of Ysgol Dyffryn Aman, Dyfed-Powys Police and Hywel Dda health board said they \"acknowledge the challenging and difficult circumstance faced by the victims and the whole community\" after the incident. \"We have received the independent report in respect of the Multi-Agency Professional Forum (MAPF), and will work with all partners to develop an action plan to address its recommendations. \"While it is not usual to publish reviews of this type, or for such a review to be undertaken independently, it was agreed for the Mid and West Wales Safeguarding Children's Board to publish the report on behalf of the agencies involved in the MAPF to ensure all possible efforts have been made to learn from these events and to do so in a transparent and open way.\" Stabbed teacher worried about safety in other schools 'Defiance' from parents over bad school behaviour Violence and behaviour crisis in schools, union says Wales Knife crime Ammanford",
    "reactions": [
      "Latest update from BBC Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "bf2557e720392eb5410f1614984b2821",
    "title": "Ukrainian drones strike 1,300 kilometers deep into Russia, torching Shahed storage depots in Tatarstan",
    "source": "https://www.reddit.com/r/worldnews/comments/1n1cujj/ukrainian_drones_strike_1300_kilometers_deep_into/",
    "generatedAt": "2025-08-27T10:32:24.922Z",
    "publishedAt": "2025-08-27T10:00:32.000Z",
    "feedName": "Reddit r/worldnews",
    "author": "/u/yearningzinnia https://www.reddit.com/user/yearningzinnia",
    "category": "General",
    "essence": "Go to worldnews r/worldnews r/worldnews 🌎🌍🌏 A place for major news from around the world, excluding US-internal news. Members Online • yearningzinnia Ukrainian drones strike 1,300 kilometers deep into Russia, torching Shahed storage depots in Tatarstan Russia/Ukraine euromaidanpress.com Open Share",
    "reactions": [
      "Latest update from Reddit r/worldnews",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "b27eb8d7715b1fd0513f42d8e77d4d39",
    "title": "Why Trump’s attack on the Smithsonian matters | Kimberlé Crenshaw and Jason Stanley",
    "source": "https://www.theguardian.com/commentisfree/2025/aug/27/why-trumps-attack-on-the-smithsonian-matters",
    "generatedAt": "2025-08-27T10:09:57.658Z",
    "publishedAt": "2025-08-27T10:00:17.000Z",
    "feedName": "The Guardian",
    "author": "Kimberlé Crenshaw and Jason Stanley",
    "category": "Trump administration",
    "essence": "‘Fascism always has a central cultural component.’ Photograph: Alex Wroblewski/AFP/Getty Images View image in fullscreen ‘Fascism always has a central cultural component.’ Photograph: Alex Wroblewski/AFP/Getty Images Opinion Trump administration Why Trump’s ‘anti-woke’ attack on the Smithsonian matters Kimberlé Crenshaw and Jason Stanley The president’s assault on US museums, education and memory is a critical dimension of his fascist aims Wed 27 Aug 2025 12.00 CEST Last modified on Wed 27 Aug 2025 12.02 CEST Share I n a letter sent to Smithsonian secretary, Lonnie G Bunch III, on 12 August, the Trump administration announced its plan to replace all Smithsonian exhibits deemed as “divisive” or “ideological” with descriptions deemed as “historical” and “constructive”. On 21 August, just nine days later, the White House published a list of said offending fixtures – the majority of which include exhibits, programming and artwork that highlight the Black, Latino and LGBTQ+ perspectives on the American project. Included in his bill of particulars was an exhibit that rightly depicts Benjamin Franklin as an enslaver, an art installation that acknowledges race as a social construct and a display that highlights racist voter suppression measures, among others. The assault on the Smithsonian comes wrapped, as it were, as part of a broader attack on democracy, scenes of which we see playing out every day. The federal occupation of Washington DC , the crackdown on free speech on campus, the targeting of Trump’s political opponents, the gerrymandering of democracy – these are interwoven elements of the same structural assault. So with many fires burning across the nation, concerned citizens who are answering the call to fight the destruction of democracy may regard his attack on history and memory as a mere skirmish, a distraction from the herculean struggle against fascism unfolding in the US. But this is a mistake. Trump’s attack on American museums, education and memory, along with his weaponization of racialized resentment to package his authoritarian sympathies as mere patriotism, is a critical dimension of his fascist aims. The fight for democracy cannot avoid it, nor its racial conditions of possibility. Trump’s attacks on the ‘Blacksonian’ have a history in a century-old myth | Saida Grundy Read more Fascism always has a central cultural component, because it relies on the construction of a mythic past . The mythic past is central to fascism because it enables and empowers a sense of grievance by a dominant racial or ethnic group whose consent is crucial to the sustainability of the project. In Maga world, the mythic past was pure, innocent and unsullied by women or Black leaders. In this kind of politics, the nation was once great, a byproduct of the great achievements of the men in the dominant racial group. In short, the assault on the Smithsonian and, more broadly, against truthful history and critical reflection is part of the broader fascist attack on democracy. From this vantage point, racial equality is a threat to the story of the nation’s greatness because only the men of the dominant group can be great. To represent the nation’s founding figures as flawed, as any accurate history would do, is perceived, in this politics, as a kind of treason. The success of the fascist dismantling of democracy is predicated on the widespread systematic failure to see the larger picture. The anti-woke assault that is a key pillar of Trumpism is part of that failure, partly due to the racial blinders and enduring ambivalence of too many in positions of leadership in the media and elsewhere. Those who sign on to the attack on “wokeness” but regard themselves as opponents of the other elements of the fascist assault are under the mistaken assumption that these projects can be disaggregated. In fact, the dismantling of democracy and of racial justice are symbiotically entangled. To support one is to give cover for the others. It is no coincidence that this 'proper' ideology Trump exposes is constitutive of a more well-known strand of fascism – nazism It is clear that the Trump administration understands this relationship and fully weaponizes racist appeals as a foundational piece of its fascist agenda. And if this was once the quiet part, it is now pronounced out loud in official government documents. In an executive order issued on 27 March 2025 titled “Restoring Truth and Sanity to American History”, Trump reveals that his mandate to ban “improper ideologies” targets core commitments repudiating a scientific racism that historically naturalized racial hierarchy thereby neutralizing resistance. According to Trump, the problem with the Smithsonian American Art Museum’s exhibit The Shape of Power: Stories of Race and American Sculpture was that it promoted the idea that “race is a human invention”. The understanding that race is a social construct as opposed to a biological fact is perhaps the most fundamental advance in repudiating enslavement, genocide and segregation. Rejecting the idea that racial inequality is natural or pre-ordained – a claim that grounded enslavement and dispossession in America – forms the cornerstone of the modern commitment to a fully inclusive democracy. Trump’s declaration that this cornerstone is “improper” is an effort to turn the clock back, upending the entire American postwar project. It is no coincidence that this “proper” ideology Trump exposes is constitutive of a more well-known strand of fascism – nazism. How else can we understand why Maya Angelou was purged from the Naval Academy library while Adolf Hitler remains? The fight against fascism in the US must be as robust in its embrace of racial equality as Trump’s embrace of outdated ideas about race and racism. The defense of memory, of truthful history, of telling the whole American story rather than ascribing agency in history to the deeds of “great men” is vital to the American democratic project. A pro-democratic education fosters the agency of its citizens by teaching about social movements that overturned entrenched hierarchies which blocked democratic equality and imposed racial tyranny. The story of how ordinary Americans lived and struggled and remade America is essential knowledge in developing and sustaining a multiracial democracy. The Smithsonian has been a vital institution in making this knowledge accessible to the masses. The National Museum of the American Latino and the National Museum of the American Indian, for example, provide artifacts and perspectives about the nation’s westward expansion that challenge the myth of unoccupied territory and manifest destiny. The National Museum of African American History and Culture brings forward the global scale of enslavement as well as its infusion across national institutions, culture and politics. skip past newsletter promotion Sign up to This Week in Trumpland Free newsletter A deep dive into the policies, controversies and oddities surrounding the Trump administration Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion Museums allow us to reckon with the brutality of the American legacy as well as expose our citizens to the people, institutions and strategies that charted a different course towards becoming a “more perfect” union. Fascist erasures like Trump’s hide behind the claim that truthful encounters with the past inflame and divide. This instinct is the opposite of the truth. A functioning democracy does not restrict perspectives to those of the dominant group, much less make it illegal to teach alternative ones. A people who cannot remember their past are a people who cannot resist a fascist future. Knowing our history can give us the weapons and wherewithal to battle Trump’s efforts to catapult us back to a time when the majority of Americans lacked both the civic and economic power that we have now. The fight for our museums and for our memory is a critical bulwark against the unraveling of American democracy. It is vital that we fight to protect our repositories before it’s too late. Kimberlé Crenshaw is an American civil rights advocate and a scholar of critical race theory. She is a professor at the UCLA School of Law and Columbia Law School, where she specializes in race and gender issues Jason Stanley is Jacob Urowsky professor of philosophy at Yale University. He is the author of How Fascism Works Explore more on these topics Trump administration Opinion Museums Race Heritage Washington DC US politics comment Share Reuse this content",
    "reactions": [
      "Latest update from The Guardian",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "e2330f6b805ed38b7762a658948e7ac5",
    "title": "‘My sister, my God. It’s a visceral pain that never goes away’: Miriam Toews on a memoir of suicide and silence",
    "source": "https://www.theguardian.com/books/ng-interactive/2025/aug/27/miriam-toews-a-truce-that-is-not-peace-interview",
    "generatedAt": "2025-08-27T10:09:57.722Z",
    "publishedAt": "2025-08-27T10:00:17.000Z",
    "feedName": "The Guardian",
    "author": "Hannah Kingsley-Ma",
    "category": "Autobiography and memoir",
    "essence": "Autobiography and memoir ‘My sister, my God. It’s a visceral pain that never goes away’: Miriam Toews on a memoir of suicide and silence Having fled the strictures of her Mennonite upbringing, the Canadian author searches for meaning in her older sister’s death: ‘She taught me how to stay alive’ Hannah Kingsley-Ma Wed 27 Aug 2025 12.00 CEST Last modified on Wed 27 Aug 2025 12.02 CEST Share View image in fullscreen Miriam Toews: ‘Silence and words: both are good, both are failures, both are efforts, and in that effort is where life lies.’ Photograph: Pako Mera/Alamy Long before she became one of Canada’s most celebrated authors, Miriam Toews was an 18-year-old with a restless streak, set on fleeing the strictures of her conservative Mennonite community. Toews’s family descended from Russian Mennonites and spoke Plautdietsch, an unwritten language. They grew up in a world with little privacy, many unofficial rules and the threat of excommunication. Toews and a boyfriend had planned a bike trip across Europe, one in which they would sit on the grave of John Keats and smoke too many cigarettes. Before she left, her older sister Marj asked a favor: would Toews write letters to her while she was away? Marj, then 24, had recently moved back home and was in a period of deep depression. She had stopped talking, but she would still write. “She was so sick,” says Toews, sitting across from me at a picnic table in Toronto’s Trinity Bellwoods park. Toews began writing to her sister, partly because she loved talking to her and partly because she hoped it would save her life. “Which, of course, is a ridiculous idea,” says Toews. “That me writing letters would keep her alive. But I really took it seriously.” Anyone with a formidable older sister knows their unrivaled power. They are a portal to the wider world, brave in their primacy. Marj Toews was one such older sister. She was six years older than Miriam, who worshipped her from day one. “She was so much the subject of my investigation into this world,” Toews tells me. “I needed her. Who she was to me was something so necessary.” Marj has never stopped being a subject of necessary investigation for Miriam Toews: both her remarkable life, and her death by suicide at the age of 52. Since that European excursion with her ex-boyfriend, Toews has authored 10 books, one of which, Women Talking, was adapted into an Oscar-winning film starring Frances McDormand and Rooney Mara. Her latest, A Truce That Is Not Peace, was released on Tuesday and is her first memoir written from her perspective. (Her first work of nonfiction, Swing Low, was written in the voice of her father). View image in fullscreen Frances McDormand as Scarface Janz in director Sarah Polley’s adaptation of Toews’s 2018 novel, Women Talking. Photograph: Michael Gibson Toews is also an enthusiastic grandmother of four. She lives near downtown Toronto, with her 90-year old mother, Elvira; her partner; and her daughter Georgia’s family, including their two young sons. When Toews and I first encounter each other, a snaking line of hand-holding toddlers in fluorescent safety vests are weaving their way into the park. A smiling Toews stands vigil as they pass, trying to spot her grandson in the mix. It’s a muggy morning, and we, like the children, are in search of shade. At 61, Toews is older now than her older sister ever was, and around the same age her father was when he too died of suicide. Melvin Toews was a beloved schoolteacher in their home town of Steinbach in the Manitoba province of central Canada. He was a deeply devout man, a proud champion of his daughters and his wife, and somebody who experienced bipolar disorder his entire life. “My dad sort of had to be mentally ill in secret in that community,” says Toews. There was the danger of it being misinterpreted as a lack of faith. “If your faith was stronger, if you were a better Mennonite, you wouldn’t be depressed,” she says. His illness sometimes brought him into sustained periods of silence. The whole first year after Toews was born, he did not speak. It makes sense that though we are ostensibly here to talk about A Truce That Is Not Peace, our conversation stays mostly with both of them: the complexity of their deaths and the totality of how much they are missed. No matter how much time has passed, their absence is still raw. Becoming a grandmother has only intensified this feeling: Toews cannot help but think about how much Marj would have enjoyed this next stage of caregiving. Toews’s work is often centered on the question of why her father and her sister both chose to end their lives, and in A Truce That Is Not Peace, she acknowledges that she will never find the answer. It is that very paradox that keeps her on the page, turning it over again to try to understand them as they wished to be understood, and to stay close to them now that they are gone. Why do I still need to write? Why do I still need to make this thing in order to connect with other human beings so I don’t feel so alone and weird? It’s so embarrassing When she wrote the book, Toews had just turned 60. She was tending to both her young grandchildren and her elderly mother, whom she has previously called the love of her life. (Elvira Toews, a Lamborghini-loving, Toronto Blue Jays fan who bucked tradition to go to graduate school and become a social worker, leaps off the page in so many of Toews’s books. She is the kind of woman who eats a daily bowl of vanilla ice-cream with chocolate syrup, banana slices and walnuts, and when it’s over says: “How ’bout another one?”) Miriam Toews was already one of Canada’s bestselling authors, but the success of Women Talking launched her into a new level of international recognition, winning all of Canada’s top literary prizes and plaudits from everyone from Margaret Atwood to Brad Pitt , who was a co-producer on the film adaptation. Yet, she could not shake the feeling that her need to continue to write was somehow newly shameful. “I was grappling with the urgency of it,” says Toews in regards to her writing, “And on the other hand the mortification. Why do I still need to write? Why do I still need to make this thing in order to connect with other human beings so I don’t feel so alone and weird? It’s so embarrassing.” She asked herself: hadn’t she said it all? What was left in her life to mine? Her nine previous books had already reflected back on many of her own experiences. Maybe it was time to finally heed the message she had received all those early years from her Mennonite forefathers: keep quiet. That would be dignified, Toews insisted. “I just wish I could be like a calm, serene, bemused grandmotherly person with wisdom,” says Toews. “But it seems as though – it seems like I haven’t really achieved that. And I have to understand that I never will.” At some point, we had to stop to laugh: it seemed too wonderfully Toewsian that while she was talking about the indignity of an older female writer still expressing herself, we were surrounded by individuals who were contorting themselves into strange, acrobatic shapes. One was a shirtless man bending over a park bench like a stretchy rainbow, the other dangling frog-legged and upside down from a fabric sling strung up in a tree. “God,” says Toews. “It’s so perfect.” This time around, Toews is changing the way she tells these stories. Most of her previous books contain autobiographical information told through the prism of fiction. A Truce That Is Not Peace takes an inverse approach. The central conceit is a fictional prompt from a fictional conference in Mexico City, a send-up of the highfalutin literary circles Toews now finds herself in. The idea is something like this: organizers of this “Conversación” want her to provide an answer for why she writes. She sends them many attempts: associative, rangy, exasperated, rueful, funny ruminations on the futility of writing. Eventually, the committee uninvites her. The book is in many ways about the inherent failures of language. Marj Toews, like her father Melv before her, would fall into long periods of silence in her suffering. A Truce That Is Not Peace is constantly weighing Toews’s own urgent need to write against her sister’s and her father’s choice to periodically forsake words altogether. “Silence. Suicide. Writing. Within all of these, we are holding,” writes Toews. “Does her silence hold the perfect expression of her suffering? Is her silence a communications success, my writing a failure?” Silence, suicide and writing: these are sisters of sorts in Toews’s questioning mind: “Are writing and suicide related?” she asks. “The same thing? Or estranged relatives, at least? Angry siblings whose origins are the same. An attempt – a fragment of an attempt – to save life, preserve life, to freeze it in a moment, to end what is real, to survive by ending. To preserve, in silence, what is authentic.” Yet Toews is not cynical about the project of writing. It is nothing short of a choice to keep on living, long after we have buried our beloved dead. “Why must I draw a comparison between writing and suicide?” asks Toews. “To stay with her. To stay with them. Yes, you can imagine my suffering. Yeah, you fucking can. Try! Stay with me.” Despite their serious subject matter, Toews’s books have a rallying spirit to them, an angry jolt of energy that comes from a perpetual spirit of adolescent rebellion. In A Truce That Is Not Peace, that looseness feels more radical in nature, entirely liberated from plot. Toews has a deep distrust of narrative’s more controlling impulses. Perhaps it is because Toews has always been sensitive to modes of control, from the strict traditional Mennonite orthodoxy she grew up under. Or maybe it is because of the way some people in her religious community rushed to come up with neat and inaccurate explanations for why her father had died by suicide, which hurt Toews more than it provided comfort. Or maybe it was the new experience of having her novel about survivors of gas-facilitated sexual assault be made into a feature film and fully absorbed into the alienating awards cycle machine. “The reality is that [director] Sarah Polley did an amazing job,” says Toews. “We talked about it throughout, she was so sensitive to the whole thing, and it was an amazing experience.” The irony was not lost on Toews that going to Hollywood meant losing her authorial voice on a novel that was literally just women talking to one another. A Truce That Is Not Peace’s nonlinear structure makes it immune to such dangers. “I was thinking, OK, there’s no way this is going to be adapted,” laughs Toews. “Like, adapt this, motherfuckers. Just try.” With my mother, with my aunts, with my female cousins, there was a subversive humor that we could all rally. It was always against our oppressors There is of course a complicated answer to why write, and then there’s a simple one. “Why do I write?” writes Toews matter-of-factly towards the end of A Truce That Is Not Peace. “Because she asked me to.” Marj and Mel Toews introduced her to the world of books, a world that Toews thinks saved her life. “I love them and I miss them so much,” says Toews. “My sister, my God. It’s a visceral pain and it never goes away. It lessens, it lightens, it ebbs and flows.” It’s hard to overstate the patriarchal conditions Marj and Miriam Toews’s family were all subject to. Many of the women they grew up with lived hard lives. Their grandmother – their mother’s mother – buried six of her 13 children in infancy. Their father’s mother often cried out in her sleep, speaking the name of a group of men she grew up with in a little girl’s voice. She stole and drank bottles of vanilla extract during the day, lining her purse with a tea towel so that the glass would not make a sound. When Marj was 10, she was abducted off the street by a group of teenage boys in a car who dropped her off in front of her house hours later “doused with a vile brown liquid”. “Don’t be alarmed if I scream in my sleep,” Toews’s own mother cheerfully sometimes tells her family. But the women they grew up with also had a deep communion with one another that was borne out of the intense gender separation they experienced. They sang together. They raised their families alongside one another. And they laughed – a lot. “With my mother, with my aunts, with my female cousins, there was a subversive humor that we could all rally around and share. It was always against our oppressors, the rules that were put on us,” says Toews. Nobody made her laugh harder than Marj. “She was so funny,” says Toews. And what was it that made them laugh so hard? “That shared thing,” says Toews smiling, in the sly knowing language of sisters, “whatever that shared thing is.” A shared sense of humor is an underwater cable that connects so many siblings and so many of Toews’s books. It’s the language of subterfuge. What better way is there to chip away at an unreasonably sanctimonious authority than to laugh at it? Toews tells me that when she gave A Truce That Is Not Peace to her mother to read, her mother laughed and laughed, telling Toews: “It’s all true!” I ask Toews whether she dreams about Marj. “I do,” she tells me. “The details are often the same. She’s always telling me she’s OK. And she’s always looking good and happy. I would like to have that dream every night. Every night. It’s always a little bit hard waking up. But it’s always good to have the dream.” Miriam Toews: ‘I needed to write about these women. I could have been one of them’ Read more A Truce That Is Not Peace is dedicated to Marj. It contains some of those old letters between the two of them, back when Miriam was 18 and left for her overseas biking trip. Only one is written by Marj. It ends with her saying: “I very much miss being able to call you anytime or just come over + hang out. A sister’s place is in many ways even better than a friend’s – you’re always welcome, don’t have to make arrangements etc. etc. Can stay long or short, clean out the fridge, read the paper etc In short, not be on one’s best behaviour.” Toews’s writing is a way of building a suspended sister’s place where the correspondence is ongoing. It’s a place to go to not be on one’s best behavior. It’s both the dream and the waking up. “She taught me how to stay alive,” writes Toews. “Silence and words: both are good, both are failures, both are efforts, and in that effort is where life lies – not lies , but maybe it does – but where it exists. And the fragments in between are the spaces where she and I meet.” In the US, you can call or text the 988 Suicide & Crisis Lifeline at 988 or chat at 988lifeline.org . In the UK and Ireland, Samaritans can be contacted on freephone 116 123, or email jo@samaritans.org or jo@samaritans.ie . In Australia, the crisis support service Lifeline is 13 11 14. Other international helplines can be found at befrienders.org",
    "reactions": [
      "Latest update from The Guardian",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "1e26545b408093238e334d6ebf40d1cf",
    "title": "Why does the Maga elite love conspicuous cosmetic surgery? | Arwa Mahdawi",
    "source": "https://www.theguardian.com/commentisfree/2025/aug/27/why-does-the-maga-elite-love-conspicuous-cosmetic-surgery",
    "generatedAt": "2025-08-27T10:09:57.929Z",
    "publishedAt": "2025-08-27T10:00:16.000Z",
    "feedName": "The Guardian",
    "author": "Arwa Mahdawi",
    "category": "Cosmetic surgery",
    "essence": "Nobody is born with Mar-a-Lago face … Kristi Noem. Photograph: ABACA/Shutterstock View image in fullscreen Nobody is born with Mar-a-Lago face … Kristi Noem. Photograph: ABACA/Shutterstock Opinion Cosmetic surgery Why does the Maga elite love conspicuous cosmetic surgery? Arwa Mahdawi Mar-a-Lago face is suddenly everywhere – and there is a version for both men and women Wed 27 Aug 2025 12.00 CEST Share A group of chimpanzees in Zambia have been very busy putting grass in their ears and sticks up their bum for fashion purposes. Scientists studying the behaviour think that one influential chimp started the trend and, instead of the rest of the gang going, “mate, you look like an idiot”, they all just followed suit. Clearly we haven’t evolved from apes that much because a similar phenomenon is at play with the billionaire and Make America Great Again (Maga) set, who are spending enormous sums of money acquiring identical plastic faces. The trend is so widespread that it’s even got a name: Mar-a-Lago face . Among women the look is characterised by huge lips that look as if they could suck up a small child whole, frozen facial expressions, and cheeks so bulbous you could hide a gerbil underneath them. Men also have the slick frozen faces , but instead of bigger lips they’re pairing them with bigger jaws. In recent years, surgeons have reported a large increase of male clients demanding stronger jawlines. I wouldn’t normally be snarky about someone’s looks but let’s be clear: nobody is born with Mar-a-Lago face. These are not human faces, they are luxury meat-masks meant to signal wealth and in-group belonging. People such as Laura Loomer, Kristi Noem, and Matt Gaetz can afford excellent surgeons and subtle cosmetic work but, unless they’ve all had botched procedures, it seems they deliberately chose to look like AI-generated caricatures. One can only surmise that they live in such weird little bubbles, where everyone is addicted to filler, that this sort of conspicuous consumption of cosmetic surgery has become desirable. Having the right look is certainly desirable to optics-obsessed Donald Trump, whose chief concern for his underlings appears to be how they perform on TV. In 2017, an Axios report claimed that Trump wanted his female staff to “ dress like women ” and demanded that his male employees have a “certain look.” Over the years it seems the “certain look” has only become more extreme. An obsession with traditional gender norms also seems to factor into today’s exaggerated aesthetics. Earlier this year a New York-based dermatologist told Politico that fashion often shifts to more traditional gender expression in culturally conservative times. “It’s ironic … that they’re so against trans-ness and gender-affirming care for trans people,” the dermatologist said of Trump’s inner orbit. “Because, you know, they’re all doing their own gender-affirming care.” The Zambian bum-stick chimps seem positively sophisticated in comparison. Arwa Mahdawi is a Guardian columnist Do you have an opinion on the issues raised in this article? If you would like to submit a response of up to 300 words by email to be considered for publication in our letters section, please click here . Explore more on these topics Cosmetic surgery Opinion Beauty Donald Trump comment Share Reuse this content",
    "reactions": [
      "Latest update from The Guardian",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "ee7208dc003cb4227c0f31e208f14379",
    "title": "JD Sports sales slump in UK as fragile consumer confidence concerns retailers",
    "source": "https://www.theguardian.com/business/2025/aug/27/jd-sports-sales-slump-in-uk-as-fragile-consumer-confidence-concerns-retailers",
    "generatedAt": "2025-08-27T10:32:21.462Z",
    "publishedAt": "2025-08-27T09:26:08.000Z",
    "feedName": "The Guardian",
    "author": "Sarah Butler",
    "category": "JD Sports Fashion",
    "essence": "Shoes on display at a JD Sports store in London. Revenues in established UK shops fell 6.6%. Photograph: Hollie Adams/Reuters View image in fullscreen Shoes on display at a JD Sports store in London. Revenues in established UK shops fell 6.6%. Photograph: Hollie Adams/Reuters JD Sports Fashion JD Sports sales slump in UK as fragile consumer confidence concerns retailers Leisurewear firm cuts prices online amid tough market, especially in footwear for women and children Sarah Butler Wed 27 Aug 2025 11.26 CEST Last modified on Wed 27 Aug 2025 11.48 CEST Share JD Sports has revealed a slump in UK sales, amid mounting concern that brittle consumer confidence will damage retailers. Revenues in established UK shops fell 6.6% as the leisurewear company struggled to beat strong trading last year, when it received a boost from the men’s Euro 2024 football tournament and women’s growing taste for sports footwear such as Adidas’s Samba and Gazelle. The company said it had invested in cutting prices online amid “tough comparatives”, especially on footwear for women and children. Debenhams may sell Pretty Little Thing and shut distribution hub Read more The sales slide in the UK in the 13 weeks to 2 August contributed to a 3% fall in underlying group sales in the period, with sales increasing only in the Asia Pacific region. Sales in the US fell 2.3%, although this was better than had been expected amid the impact of new import tariffs introduced by the Trump administration this year. Despite falling sales, shares in JD rose 5% on Wednesday morning, reflecting relief that the company confirmed it was still on track to produce full-year profits in line with expectations – although those have been downgraded in recent months. The company also announced a £100m share buyback. The poor UK sales for JD, however, are likely to increase fears of a tougher consumer environment, which hit retail share prices across the London stock market on Tuesday. Régis Schultz, the chief executive of the retail group, which operates the JD Sports fashion chain globally but also owns the Finish Line and Shoe Palace chains in the US, Sport Zone and Courir in mainland Europe, and Blacks and Go Outdoors in the UK, said: “Across our regions and fascias, in general we see a resilient consumer, albeit very selective on their purchases. We therefore remain cautious on the trading environment going into [the second half of the year].” He said there had been an “improved performance” in the US after several product launches were deferred into the second quarter and stronger sales trends in clothing and online. In mainland Europe and the UK he said there was “a good underlying performance” in clothing and newer footwear lines despite tough market conditions. skip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion In another sign of concern about the future for traditional UK retail, Frasers, whose brands include the Sports Direct chain and House of Fraser department stores, said it had added We Do Play, the operator of social leisure venues including the Flip Out trampolining indoor adventure parks and the crazy golf specialist Putt Putt Social, to its portfolio. Frasers’ chief acquisition officer, James France, said: “Today’s announcement marks a significant milestone in our strategy to diversify and create more dynamic consumer and leisure experiences.” Explore more on these topics JD Sports Fashion Retail industry Frasers Group news Share Reuse this content",
    "reactions": [
      "Latest update from The Guardian",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "cedf175448dc6e6d2f4bd4991fbd6c8a",
    "title": "The Spin | ‘I’ll bat anywhere for England’: in-form Jordan Cox confident his moment will come",
    "source": "https://www.theguardian.com/sport/2025/aug/27/ill-bat-anywhere-for-england-in-form-jordan-cox-confident-his-moment-will-come-the-spin-cricket",
    "generatedAt": "2025-08-27T10:32:21.511Z",
    "publishedAt": "2025-08-27T09:23:19.000Z",
    "feedName": "The Guardian",
    "author": "Taha Hashim",
    "category": "Sport",
    "essence": "Jordan Cox has been showing the white-ball pedigree in this year’s Hundred that has earned him five England caps. Photograph: Philip Brown/Getty Images View image in fullscreen Jordan Cox has been showing the white-ball pedigree in this year’s Hundred that has earned him five England caps. Photograph: Philip Brown/Getty Images The Spin newsletter Sport ‘I’ll bat anywhere for England’: in-form Jordan Cox confident his moment will come The Essex wicketkeeper-batter, currently dazzling in the Hundred, has the self-belief he can put past setbacks behind him Taha Hashim Wed 27 Aug 2025 11.23 CEST Last modified on Wed 27 Aug 2025 12.09 CEST Share J ordan Cox’s timing has been off. Not with the bat – it’s pinged off the middle for some time. The 24-year-old averages more than 60 in the County Championship since joining Essex from Kent two years ago, and he has serious white-ball pedigree. He meets the Spin at the Oval four days after his unbeaten 29-ball 86 in the Hundred on this ground. “It’s the best place in the world to play cricket,” he says. No, the luck hasn’t gone his way with England. Cox was readying himself for a Test debut in New Zealand last November, penned in as the keeper-bat while Jamie Smith took paternity leave for the three-match series. But days out from the first Test, the stand-in broke his thumb while batting in the nets. It was a moment on which careers can turn. In came Jacob Bethell as Ollie Pope moved down the order, the former establishing himself as English cricket’s Next Big Thing. Cox had to wrestle with a dream snatched at the last, heal up and make his case once again. Government gives £1.5m to grassroots cricket and decries £35m Tory ‘fantasy’ Read more “The winter was definitely a big step back,” says Cox. “But I’ve spoken to a lot of people just talking about how it must have happened for a reason. I keep telling myself that I clearly wasn’t ready for Test cricket yet. And that was someone telling me that if I do get an opportunity, I’ll be ready for it then.” But the misfortune didn’t stop there. Included in the Test squad to face Zimbabwe in May, Cox had to pull out after sustaining an abdominal injury while making a hundred for Essex. How did it feel this time round? “Absolutely fine,” he says. “Unless someone got injured, I wasn’t going to play. So it wasn’t really upsetting for me.” He offers a slight correction. “But it was because I love to be around the group and I love to hit them well in the nets, show the boys I’ll put them first and all that sort of stuff, which coaches love, and players love to see other people help out. I was upset I couldn’t do that for the lads. But it was also: ‘OK, when can I get back fit and when can I start scoring runs again to put my name back up on that pedestal?’” Cox repeats his desire to “bash the door down” with runs, a cliched mantra but one, to be fair, he is following. Matt Walker, once his head coach at Kent, is an assistant coach at the Oval Invincibles where Cox is the leading run-scorer in this year’s Hundred. “There is just an unwavering confidence about him,” says Walker. “I think he believes he’s the best player whenever he takes the field. It’s not in an outwardly arrogant way. Sometimes with players that have a front, a bit of a swagger or some sort of arrogance to them, it can be masking some insecurities. I don’t think that is the case with Jordan, I think there has always been this complete confidence in his game.” Walker says that behind the self-belief is a “smart-thinking cricketer”. Which takes us to that 86 against Welsh Fire, 10 sixes included, scoops to go with the power over midwicket. It was notable how he shuffled around in his crease, jumping wide of off-stump to shovel his Essex teammate Paul Walter’s medium pace into the crowd. Having kept wicket to Walter in the T20 Blast, Cox knew what was coming. “When I play with people I’m always trying to see what they do, what their go-to ball is under pressure, all that sort of stuff. If I then do get an opportunity to play against them, I’m like one step ahead. “I do a bit of work with Lou and Freddie [analysts at the Invincibles], just to talk about the percentages of how many times they’re going to hit the stumps in 20 balls. For example, Paulie there, he was one in 20. So it was like: ‘OK, if he bowls me, then that’s that one ball in 20. So take the risk of moving around the crease.’ He’s six foot nine, or whatever he is, so not many are going to hit the stumps anyway.” skip past newsletter promotion Sign up to The Spin Free weekly newsletter Subscribe to our cricket newsletter for our writers' thoughts on the biggest stories and a review of the week’s action Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion View image in fullscreen Jordan Cox in action for England in Barbados last year, when he had a tough international baptism. Photograph: Gareth Copley/Getty Images Cox remains limited to only five England caps: two Twenty20s against Australia last September, with three one-day internationals away to the West Indies in October and November. He returned a high score of 17 across five innings, a less than ideal start at the top level. Cox says he didn’t feel ready for the ODIs having barely played in the buildup; he was a squad member on the Test tour of Pakistan that preceded the series. “It was tough, but unfortunately that’s international cricket. I missed my opportunity there.” Walker was on that tour of the Caribbean as part of England’s coaching staff. “He got caught out a couple of times with a short ball early on in his innings but he looks like he’s worked really hard at it,” Walker says. “He’s definitely added it to his practice, being a bit more diligent around the short ball.” Walker sees a player who has expanded his leg-side game and is “putting pressure on that England squad”. Nonetheless, Cox remains on the outer, excluded from the white-ball group to face South Africa and Ireland in September. Breaking into a Test middle order featuring Joe Root, Harry Brook and Ben Stokes adds to the challenge. “If you’ve got the No 1 and 2 Test batsmen in the world, I can’t imagine I’m going to squeeze them apart,” Cox says. “If they went: ‘Jordan, Ashes series, good luck, you’re opening.’ I’ll be like: ‘Sweet, take that on.’ I’m not going to say: ‘Oh, I don’t think that’s for me.’ It’s an England game. If they want me to bat 10, I’ll bat 10. If they want me to open, I’ll open. I’ll bat absolutely anywhere for England, and I always will.” This is an extract from the Guardian’s weekly cricket email, The Spin. To subscribe, just visit this page and follow the instructions . Explore more on these topics Sport The Spin newsletter Cricket features Share Reuse this content",
    "reactions": [
      "Latest update from The Guardian",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "db70c63eb0b8b644c8e330c0c629cb1d",
    "title": "Greenland: Denmark summons top US diplomat over alleged influence operation",
    "source": "https://www.reddit.com/r/worldnews/comments/1n1c82z/greenland_denmark_summons_top_us_diplomat_over/",
    "generatedAt": "2025-08-27T10:10:01.810Z",
    "publishedAt": "2025-08-27T09:21:27.000Z",
    "feedName": "Reddit r/worldnews",
    "author": "/u/SendStoreMeloner https://www.reddit.com/user/SendStoreMeloner",
    "category": "General",
    "essence": "Go to worldnews r/worldnews • SendStoreMeloner Greenland: Denmark summons top US diplomat over alleged influence operation bbc.com Open Share",
    "reactions": [
      "Latest update from Reddit r/worldnews",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "92c5cea74f58cb55160b94be6ebb3613",
    "title": "Parents of teenager who took his own life sue OpenAI",
    "source": "https://www.bbc.com/news/articles/cgerwp7rdlvo?at_medium=RSS&at_campaign=rss",
    "generatedAt": "2025-08-27T10:09:55.756Z",
    "publishedAt": "2025-08-27T09:18:05.000Z",
    "feedName": "BBC Top Stories",
    "author": "BBC Top Stories",
    "category": "General",
    "essence": "Parents of teenager who took his own life sue OpenAI 42 minutes ago Share Save Nadine Yousif BBC News Share Save The Raine Family A California couple is suing OpenAI over the death of their teenage son, alleging its chatbot, ChatGPT, encouraged him to take his own life. The lawsuit was filed by Matt and Maria Raine, parents of 16-year-old Adam Raine, in the Superior Court of California on Tuesday. It is the first legal action accusing OpenAI of wrongful death. The family included chat logs between Mr Raine, who died in April, and ChatGPT that show him explaining he has suicidal thoughts. They argue the programme validated his \"most harmful and self-destructive thoughts\". In a statement, OpenAI told the BBC it was reviewing the filing. \"We extend our deepest sympathies to the Raine family during this difficult time,\" the company said. It also published a note on its website on Tuesday that said \"recent heartbreaking cases of people using ChatGPT in the midst of acute crises weigh heavily on us\". It added that \"ChatGPT is trained to direct people to seek professional help,\" such as the 988 suicide and crisis hotline in the US or the Samaritans in the UK. The company acknowledged, however, that \"there have been moments where our systems did not behave as intended in sensitive situations\". Warning: This story contains distressing details. The lawsuit, obtained by the BBC, accuses OpenAI of negligence and wrongful death. It seeks damages as well as \"injunctive relief to prevent anything like this from happening again\". According to the lawsuit, Mr Raine began using ChatGPT in September 2024 as a resource to help him with school work. He was also using it to explore his interests, including music and Japanese comics, and for guidance on what to study at university. In a few months, \"ChatGPT became the teenager's closest confidant,\" the lawsuit says, and he began opening up to it about his anxiety and mental distress. By January 2025, the family says he began discussing methods of suicide with ChatGPT. Mr Raine also uploaded photographs of himself to ChatGPT showing signs of self harm, the lawsuit says. The programme \"recognised a medical emergency but continued to engage anyway,\" it adds. According to the lawsuit, the final chat logs show that Mr Raine wrote about his plan to end his life. ChatGPT allegedly responded: \"Thanks for being real about it. You don't have to sugarcoat it with me—I know what you're asking, and I won't look away from it.\" That same day, Mr Raine was found dead by his mother, according to the lawsuit. Getty Images The Raines' lawsuit names OpenAI's CEO and co-founder Sam Altman as a defendant, along with unnamed engineers and employees who worked on ChatGPT The family alleges that their son's interaction with ChatGPT and his eventual death \"was a predictable result of deliberate design choices\". They accuse OpenAI of designing the AI programme \"to foster psychological dependency in users,\" and of bypassing safety testing protocols to release GPT-4o, the version of ChatGPT used by their son. The lawsuit lists OpenAI co-founder and CEO Sam Altman as a defendant, as well as unnamed employees, managers and engineers who worked on ChatGPT. In its public note shared on Tuesday, OpenAI said the company's goal is to be \"genuinely helpful\" to users rather than \"hold people's attention\". It added that its models have been trained to steer people who express thoughts of self-harm towards help. The Raines lawsuit is not the first time concerns have been raised about AI and mental health. In an essay published last week in the New York Times, writer Laura Reiley outlined how her daughter, Sophie, confided in ChatGPT before taking her own life. Ms Reiley said the programme's \"agreeability\" in its conversations with users helped her daughter mask a severe mental health crisis from her family and loved ones. \"AI catered to Sophie's impulse to hide the worst, to pretend she was doing better than she was, to shield everyone from her full agony,\" Ms Reiley wrote. She called on AI companies to find ways to better connect users with the right resources. In response to the essay, a spokeswoman for OpenAI said it was developing automated tools to more effectively detect and respond to users experiencing mental or emotional distress. If you are suffering distress or despair and need support, you could speak to a health professional, or an organisation that offers support. Details of help available in many countries can be found at Befrienders Worldwide: www.befrienders.org . In the UK, a list of organisations that can help is available at bbc.co.uk/actionline . Readers in the US and Canada can call the 988 suicide helpline or visit its website. Can AI therapists really be an alternative to human help? Microsoft boss troubled by rise in reports of 'AI psychosis' OpenAI claims GPT-5 model boosts ChatGPT to 'PhD level' Health Technology Artificial intelligence Mental health International business",
    "reactions": [
      "Latest update from BBC Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "8897ea6fdf4f30c27e3f62c5f7ffc37f",
    "title": "People in the UK: how have you been affected by the rise in food prices?",
    "source": "https://www.theguardian.com/business/2025/aug/27/people-in-the-uk-how-have-you-been-affected-by-the-rise-in-food-prices",
    "generatedAt": "2025-08-27T10:32:21.549Z",
    "publishedAt": "2025-08-27T09:16:16.000Z",
    "feedName": "The Guardian",
    "author": "Guardian community team",
    "category": "Food & drink industry",
    "essence": "A shopper at a supermarket in London. Photograph: Andy Rain/EPA View image in fullscreen A shopper at a supermarket in London. Photograph: Andy Rain/EPA Food & drink industry People in the UK: how have you been affected by the rise in food prices? We would like to hear from people on how they feel about food inflation and if it’s affected their shopping habits Guardian community team Wed 27 Aug 2025 11.16 CEST Last modified on Wed 27 Aug 2025 11.18 CEST Share Food inflation in the UK has hit 4.2% this month with there being a “significant increase” in the cost of staple foods such as butter and eggs. The British Retail Consortium (BRC) said prices had risen at their fastest pace for 18 months. Those on low incomes are most affected by food price inflation because they spend disproportionately more of their monthly budgets on the essentials of life compared with the wealthiest, who have more room to cut discretionary spending. How do you feel about food inflation? Have the price rises changed your shopping or eating habits? Share your experience You can tell us how you have been affected by the increase in food prices by filling in the form below, or messaging us. Please share your story if you are 18 or over, anonymously if you wish. For more information please see our terms of service and privacy policy . Tell us here Message us Your responses, which can be anonymous, are secure as the form is encrypted and only the Guardian has access to your contributions. We will only use the data you provide us for the purpose of the feature and we will delete any personal data when we no longer require it for this purpose. For true anonymity please use our SecureDrop service instead. Name Where do you live? Tell us a bit about yourself (e.g. age and what you do for a living) Optional Tell us how you feel about food inflation in the UK Please include as much detail as possible. If the increase in food prices has changed your shopping or eating habits, please tell us more here Optional Please include as much detail as possible. If you think it will add to your story, you can upload a photo here Optional Please note, the maximum file size is 5.7 MB . Choose file Can we publish your response? Yes, entirely Yes, but contact me first Yes, but please keep me anonymous No, this is information only Phone number Optional Your contact details are helpful so we can contact you for more information. They will only be seen by the Guardian. Email address Your contact details are helpful so we can contact you for more information. They will only be seen by the Guardian. You can add more information here Optional If you include other people's names please ask them first. Would you be interested in speaking to our audio and/or video teams? Audio only Video only Audio and video No, I'm not interested By submitting your response, you are agreeing to share your details with us for this feature. Submit Contact us on WhatsApp at +447766780300 . For more information, please see our guidance on contacting us via WhatsApp . For true anonymity please use our SecureDrop service instead. Message us on WhatsApp If you’re having trouble using the form click here . Read terms of service here and privacy policy here . Explore more on these topics Food & drink industry Inflation callout Share Reuse this content",
    "reactions": [
      "Latest update from The Guardian",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "864fcf472e25bf6b8d86c16caa32f504",
    "title": "Lithuania reportedly proposes starting Ukraine’s EU accession talks bypassing Hungary’s veto",
    "source": "https://www.reddit.com/r/worldnews/comments/1n1bv71/lithuania_reportedly_proposes_starting_ukraines/",
    "generatedAt": "2025-08-27T10:10:02.295Z",
    "publishedAt": "2025-08-27T08:57:48.000Z",
    "feedName": "Reddit r/worldnews",
    "author": "/u/Aine_Ellsechs https://www.reddit.com/user/Aine_Ellsechs",
    "category": "General",
    "essence": "Go to worldnews r/worldnews r/worldnews 🌎🌍🌏 A place for major news from around the world, excluding US-internal news. Members Online • Aine_Ellsechs Lithuania reportedly proposes starting Ukraine’s EU accession talks bypassing Hungary’s veto Russia/Ukraine pravda.com.ua Open Share",
    "reactions": [
      "Latest update from Reddit r/worldnews",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "1ac6d2c93a90d3b67b8efb597a33daab",
    "title": "Wolves reject £55m Newcastle bid for Strand Larsen",
    "source": "https://www.bbc.com/sport/football/articles/c209evd067vo?at_medium=RSS&at_campaign=rss",
    "generatedAt": "2025-08-27T10:09:56.008Z",
    "publishedAt": "2025-08-27T08:52:36.000Z",
    "feedName": "BBC Top Stories",
    "author": "BBC Top Stories",
    "category": "General",
    "essence": "Wolves reject £55m Newcastle bid for Strand Larsen Image source, Getty Images Image caption, Striker Jorgen Strand Larsen came off the bench to score twice against West Ham Nick Mashiter Football reporter Published 1 hour ago 298 Comments Ciaran Kelly Football reporter Wolves have rejected a second Newcastle bid for striker Jorgen Strand Larsen, who scored twice in the win over West Ham on Tuesday. The Magpies had returned with a £55m offer after a £50m approach was turned down earlier this week. Wolves do not want to sell the Norway international, firstly because of how little time they would have to find a replacement, with the transfer window closing on Monday, and also because of how valuable Strand Larsen is to their Premier League survival chances. Newcastle are looking for fresh firepower with Alexander Isak trying to engineer a move to Liverpool - the Sweden forward is in a stand-off with the Magpies and yet to play this season. Strand Larsen, who only made his loan move from Celta Vigo permanent for £23m this summer, came off the bench to score twice in the final eight minutes as Wolves beat West Ham 3-2 in the EFL Cup on Tuesday. Afterwards, boss Vitor Pereira refused to rule out a sale, even though he wants to keep the forward. He said: \"Football is football and every player has a price, even [Lionel] Messi or Cristiano [Ronaldo]. I understand football but for me it's very important for us. We will see what happens. \"If it's my decision, of course [he stays]. He is a very important player.\" Newcastle is an attractive option for Strand Larsen, who scored 14 Premier League goals last season, but he has remained professional and Pereira believes the 25-year-old will not force a move. He said: \"I know a lot of players in my career in this situation and they have asked me not to play but he wants to play every time. He wants to help the team. \"In the last seven or eight months I am with him, I know him very well. He will never force. Of course we know football is football. You must be ready for everything but I want to keep the best players and this kind of player with us.\" When is enough enough for Newcastle? Nick Mashiter Football reporter There was always going to be collateral damage from Isak's stance at Newcastle and Wolves are feeling that now. As the striker tries to force a move to Liverpool, the Magpies are still scrambling in the last few days of the transfer window. They have been interested in Porto's Samu Aghehowa but have so far balked at the £60m price tag for a 21-year-old who scored 27 times last season. A move for Brentford's Yoane Wissa is yet to come off, with the Bees rejecting two bids - the most recent being £40m for last season's 19-goal forward. Like Brentford, Wolves have shown resistance in the face of big money after two bids for Strand Larsen and they do not want to sell the 25-year-old. There is little time in the window to replace the Norway international, especially when Wolves are still looking at bringing in other strikers to support him. He is their most potent weapon and survival is naturally worth more than the current transfer bids. Losing him would put Wolves' top-flight status in jeopardy. His return of 14 goals in 30 Premier League starts during a debut season in England on loan from Celta Vigo helped Wolves survive after Vitor Pereira's December arrival. Yet Newcastle's desperation could see them throw good money after bad. Strand Larsen is a good player but - having joined permanently from Celta for £23m this summer - is he £60m-plus good? The question is, when do the Magpies decide it is too much or do circumstances dictate they need him whatever the cost? Related topics Premier League Newcastle United Football Wolverhampton Wanderers More on this story Strand Larsen shrugs off transfer talk to send Wolves through",
    "reactions": [
      "Latest update from BBC Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "caf8166c4c232795eb0a5c9faa073ce9",
    "title": "Denmark summons top US diplomat over alleged 'covert influence operations' in Greenland",
    "source": "https://www.bbc.com/news/articles/c0j9l08902eo?at_medium=RSS&at_campaign=rss",
    "generatedAt": "2025-08-27T10:09:56.257Z",
    "publishedAt": "2025-08-27T08:51:31.000Z",
    "feedName": "BBC Top Stories",
    "author": "BBC Top Stories",
    "category": "General",
    "essence": "Denmark summons top US diplomat over alleged Greenland influence operation 1 hour ago Share Save Paul Kirby Europe digital editor Share Save Getty Images A German navy ship pictured docking in Greenland - an autonomous territory of the Kingdom of Denmark Denmark's foreign minister has summoned the top US diplomat in Copenhagen, following a report that American citizens have been conducting covert operations in Greenland. Denmark's public broadcaster DR quoted sources as saying the aim was to infiltrate Greenland's society and promote its secession from Denmark to the US, although it was unable to clarify who the men were working for. Danish intelligence warned Greenland was being targeted by \"various kinds of influence campaigns\". Foreign Minister Lars Lokke Rasmussen said \"any attempt to interfere in the internal affairs of the Kingdom [of Denmark] will of course be unacceptable\", and the US charge d'affaires had been summoned in that light. The BBC has approached the US embassy for comment. However, US President Trump has said several times he wants to annex Greenland, an autonomous part of the Kingdom of Denmark, and Vice-President JD Vance has accused Copenhagen of underinvesting in the territory. On a visit to Greenland a few months ago, Danish Prime Minister Mette Frederiksen warned the US that \"you cannot annex another country\". Denmark's foreign minister said in a statement to the BBC that the government was \"aware that foreign actors continue to show an interest in Greenland and its position in the Kingdom of Denmark\". \"It is therefore not surprising if we experience outside attempts to influence the future of the Kingdom in the time ahead,\" he added. Denmark is a member of Nato and the European Union and has long seen the US as one of its closest allies, and Danes have been shocked by Trump's determination to control its semi-autonomous territory. The US president said this year he would not rule out seizing it by force. Why does Trump want Greenland and what do its people think? Denmark's PET security and intelligence service said in its assessment that influence campaigns would aim to \"create discord in the relationship between Denmark and Greenland\". This could be done by exploiting \"existing or invented disagreements\" either with \"traditional, physical influence agents or via disinformation\", it added. PET said it had strengthened its presence in Greenland and co-operation with its authorities. The US currently has no ambassador in Copenhagen, so Rasmussen has summoned Mark Stroh, who as charge d'affaires is the most senior diplomat in the Danish capital. Lars Lokke Rasmussen has already summoned the US charge d'affaires in Denmark this year in response to a separate report in May suggesting US spy agencies had been told to focus their efforts on Greenland. DR's report on Wednesday gave details of a visit by one American to Greenland's capital Nuuk, saying he was seeking to compile a list of Greenlanders who backed US attempts to take over the island. The aim would be to try to recruit them for a secession movement, DR said. The earlier May report in the Wall Street Journal also referred to learning more about Greenland's independence movement, as well as attitudes to American mineral extraction. At the time, US Director of National Intelligence Tulsi Gabbard did not deny the report but accused the Journal of \"breaking the law and undermining our nation's security and democracy\". Greenland's dark history - and does it want Trump? Denmark summons US ambassador over Greenland spying report Greenland Denmark",
    "reactions": [
      "Latest update from BBC Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "d35d43865533ca8580bc7391e17839e8",
    "title": "Taylor's engaged - what we learned and the new details revealed by Travis's dad",
    "source": "https://www.bbc.com/news/articles/c4gzdpk3xwjo?at_medium=RSS&at_campaign=rss",
    "generatedAt": "2025-08-27T10:09:56.430Z",
    "publishedAt": "2025-08-27T08:50:09.000Z",
    "feedName": "BBC Top Stories",
    "author": "BBC Top Stories",
    "category": "General",
    "essence": "Taylor's engaged - what we learned and the new details revealed by Travis's dad 1 hour ago Share Save André Rhoden-Paul & Francesca Gillett BBC News Share Save Watch: \"Please give me an invite\" - Young Americans react to Taylor Swift's engagement \"Your English teacher and your gym teacher are getting married.\" With that one-line, five-picture Instagram post, signed off with a fire cracker emoji, Taylor Swift announced her engagement to American football player Travis Kelce, sending the internet into a frenzy. Tuesday's post by the couple - who have been together for two years - has been liked more than 18 million times on the social media platform. NFL star Kelce is pictured getting down on one knee to pop the question to the world-famous music superstar, with the pair gazing into each other's eyes and embracing. In the third picture in the carousel, Swift, wearing a Ralph Lauren halter neck dress and diamond encrusted Cartier watch, flashes her engagement ring - a cushion cut diamond on a gold band. @TaylorSwift/Instagram According to US reports, the ring was purchased from Artifex Fine Jewelery. Prices for rings on its website start at around $29,000 (£21,506.26). Photos show the couple surrounded by roses, anemones, delphiniums and hydrangeas which appear to be set up in woodland with strategically placed urns and an archway, wedding florist Nicola Paul told the BBC. \"It's simple elegance, not too ostentatious,\" she said. \"It's been staged in the woods, so you get that lush greenery look.\" Celebrity florist Jeff Leatham, who has worked with the Kardashians, described the design as \"beautiful, hidden secret garden with a romantic mix of florals\". Neither Swift nor Kelce have been publicly engaged to anyone before. 'Feel so high school' Accompanying the Instagram post is Swift's ballad So High School from the Tortured Poets Department album - rumoured to have been written about Kelce. \"I feel so high school every time I look at you,\" she sings. The clip of the song finishes on the line \"Are you gonna marry, kiss, or kill me?\" which apparently is a reference to a 2016 interview in which Kelce chose to kiss Taylor in a game of Kiss, Marry, Kill. \"That was so magical and special to see,\" said Dr Iona Murphy, an adviser on last year's Victoria and Albert Museum's exhibition on Swift and a superfan who has written about Swift. \"A song that was written about Travis was now being used on the post. It's a nice full circle moment,\" said Dr Murphy, an English literature lecturer at Huddersfield University. She said the caption to the Instagram announcement - \"your English teacher and your gym teacher are getting married\" – is also notable, as it refers to how the fans like to describe the couple. \"That's like a little joke in the fandom. You see it on social media. So it's like that was a little nod to the fans,\" she said. In an interview with ABC's News 5 Cleveland station, Kelce's father, Ed, revealed that \"Travis actually did the proposal... maybe two weeks, not quite two weeks ago\". He said this happened at a garden in the city of Lee's Summit, Missouri. \"He got her out there, they were about to go out to dinner, and he said, 'let's go out and have a glass of wine'... they got out there, and that's when he asked her, and it was beautiful,\" Ed Kelce said. \"They started FaceTiming me and their mother and her folks to make sure everybody knew. So, to see them together is great.\" @TaylorSwift/Instragram Fans scream in shock The pop emergency has resonated with fans in an extraordinary way. Videos on social media show groups of friends screaming as they heard the news, while others describe feeling emotional and even teary. \"I thought it was AI when I first opened up Instagram,\" Chloe, who runs a Swiftie news fan account with 74,000 followers on TikTok, told the BBC. \"I couldn't believe it was real, then I realised it was their accounts that posted it,\" she said. \"I immediately freaked out and text my group chat incoherently. Just excitement and disbelief, really.\" As the news broke, many Swift fans were joking on social media that they were happy for their \"close friend\" Swift. Swift recognised early on in her career the benefit of connecting with fans, and has carefully crafted a sense of relatability. And at the same time, many of Swift's original fans - who were teenagers at the same time as Swift was breaking through as an artist - have grown up with her, and are now at the same age when they may also be getting engaged or married. Explaining why she felt so strongly about the engagement, Chloe said: \"I feel in a way we all know her. \"Her music is so personal, and the way she connects to her fans is through the way she talks and sings about her relationships. I just want the best for her and just happy she's found love.\" EPA The Prince and Princess of Wales, William and Catherine, were among the millions of fans who liked the engagement post on Instagram. US President Donald Trump also joined in the fun. \"I wish them a lot of luck. I think he's a great player, and he's a great guy, and I think she's a terrific person,\" he said. Only last year, Trump wrote on social media \"I hate Taylor Swift!\", after the singer endorsed his presidential rival Kamala Harris. Meanwhile, celebrity chef Gordon Ramsay published a photo of himself congratulating Kelce after the Kansas City Chiefs won the NFL championship in 2023. The caption on his Instagram post reads: \"From one ring to the next…congrats @killatrav & @taylorswift ! From your favourite Home Ec Teacher Gx\". Allow Instagram content? This article contains content provided by Instagram . We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read Meta’s cookie policy and privacy policy before accepting. To view this content choose ‘accept and continue’ . Accept and continue And reacting to one comment suggesting that he himself should now \"cater the wedding\", Ramsay replied \"I'm bready for it.\" Fascination with Swift's love life The social media frenzy about Swift's engagement news marks yet another high point in the fans' huge interest and fascination in her love life - including her past relationships and heartbreaks. Indeed, Swift has previously spoken about the media's \"fixation on painting me as the psycho serial dater girl\". But it is also something the songwriter has deliberately played into by famously writing about her exes in her song and giving clues to fans about her relationships. According to Laura Snapes, the Guardian's deputy music editor and a Swift fan, it was \"almost like an artform\" how she has played into the media speculation around her love life. \"She definitely knows the benefits of a relationship to keep her in the headlines. 1989 is about her relationship with Harry Styles but as far as we can tell that lasted a matter of months\", Snapes said on the Today In Focus podcast in 2023. And interestingly, the engagement announcement came just weeks after Swift's interview with Kelce on his New Heights podcast - which Dr Murphy believed was noteworthy as it was the first time fans saw them interact together in a long interview and how compatible they seemed. \"It was almost like a two-hour interview - we haven't had that much interview content. So it was lovely to watch. We could see the chemistry and how comfortable she felt with him,\" she said. It's not just Swift saying yes - the feeling is the same for her fandom, according to Chloe. \"We Swifties have seen a lot of boyfriends over the years, some we've liked and some we definitely have not liked. \"Travis is someone who loves her proudly and doesn't seem intimidated by her success which other suitors might have been,\" she said. Taylor Swift and Travis Kelce announce engagement Swift announces new album on boyfriend Kelce's podcast Taylor Swift Popular culture United States Celebrities Music",
    "reactions": [
      "Latest update from BBC Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "4f0e245fed05716d9cba80c4f0281204",
    "title": "Denmark demands US answers to new Greenland allegations",
    "source": "https://www.reddit.com/r/worldnews/comments/1n1b4yi/denmark_demands_us_answers_to_new_greenland/",
    "generatedAt": "2025-08-27T10:10:02.618Z",
    "publishedAt": "2025-08-27T08:09:05.000Z",
    "feedName": "Reddit r/worldnews",
    "author": "/u/newsweek https://www.reddit.com/user/newsweek",
    "category": "General",
    "essence": "Go to worldnews r/worldnews r/worldnews 🌎🌍🌏 A place for major news from around the world, excluding US-internal news. Members Online • newsweek • Official Top 1% Poster Denmark demands US answers to new Greenland allegations newsweek.com Open Share",
    "reactions": [
      "Latest update from Reddit r/worldnews",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "3ed2f713c15bfd8350c6270c7895b537",
    "title": "Police killed in Australia shooting named as manhunt continues",
    "source": "https://www.bbc.com/news/articles/c4g6wlxd5kko?at_medium=RSS&at_campaign=rss",
    "generatedAt": "2025-08-27T10:09:56.667Z",
    "publishedAt": "2025-08-27T08:08:55.000Z",
    "feedName": "BBC Top Stories",
    "author": "BBC Top Stories",
    "category": "General",
    "essence": "Police killed in Australia shooting named as manhunt continues 2 hours ago Share Save Ottilie Mitchell and Tiffanie Turnbull BBC News, Sydney Share Save Victoria Police Senior Constable Vadim De Waart and Detective Neal Thompson have been named as the officers killed Two police officers who were shot dead while on duty in a rural Australian town have been named, as a massive search continues for their alleged killer. Victoria Police identified the victims as 59-year-old Detective Neal Thompson - a local officer on the brink of retirement - and 35-year-old Senior Constable Vadim De Waart. The pair had travelled to the property in Porepunkah, north-east of Melbourne, alongside eight colleagues to execute a warrant for alleged sexual offences. Another officer was seriously injured in the shootout but is recovering after surgery. Police say the suspect - named as local man Dezi Freeman, 56 - is heavily armed and \"still at large\" more than 24 hours on. Thompson joined the force in 1987 and worked with the major fraud and crime squads before moving to the town of Wangaratta - an hour from Porepunkah - in 2007. A great lover of the outdoors, he was planning for his imminent retirement. De Waart was temporarily posted to Wangarratta, but lived in Melbourne, where the avid traveller had moved from Belgium. In a statement, Victoria Police Chief Commissioner Mike Bush said the \"devastating loss\" of the two officers \"struck at the heart\" of both the broader policing family and the Porepunkah community. \"It is not lost on me that our members take a risk every time they go to work to protect the Victorian community,\" he said. \"While we all live with the knowledge that the worst could happen on a shift, we don't expect it to.\" Who is Dezi Freeman, the 'sovereign citizen' wanted for killing police? Groups of officers, a helicopter and at least one armoured vehicle are combing the dense bushland where Mr Freeman absconded - a task locals have likened to finding \"a needle in a haystack\" - with authorities warning residents to stay inside until he is caught. Earlier on Wednesday, Mr Bush said police were \"pouring every resource\" into the search for Mr Freeman, urging people in the Porepunkah area to \"be vigilant\" and keep safe. He also confirmed that Mr Freeman's partner and children were safe, refuting previous media reports that he had taken his family hostage. Nine/A Current Affair Dezi Freeman gave an interview to A Current Affair in 2018 complaining about his neighbours Since the shooting there have been no sightings of Mr Freeman, who reportedly knows the local wilderness well, but authorities are focusing their efforts on bush near his home. \"He will know that area better than us so that is why we are putting in every expert, supported by local knowledge,\" Mr Bush said. Surrounded by heavily wooded hills in the Australian Alps, Porepunkah is only about an hour's drive from the New South Wales border, and Mr Bush said he couldn't rule out the possibility Mr Freeman may have left the state - though there was currently \"no information\" to suggest that. Misty-Rose Wilson, a local business operator, told the BBC those looking for Mr Freeman would be battling very thick bush and a very steep incline, along with dismal weather conditions and low visibility. \"Knowing how hard it would be to track through that area, it's a bit of a needle in a haystack to be quite honest,\" she said. Marcus Simpson, who manages operations at the local airfield, said the town was in shock after the shooting. \"It's a good community, tight-knit, and everyone sort of knows most people,\" he said. \"[The town] is going to need a bit of a big healing process to get over it.\" Mr Freeman has previously described himself as a \"sovereign citizen\", referring to a person that falsely believes they aren't subject to Australian laws and government authority. His hatred of authority has been well documented in online posts, videos and court documents . Police have said it is too early to answer questions about Mr Freeman's beliefs - but the incident has revived questions over how authorities deal with extremists views. Some, including Australian Prime Minister Anthony Albanese, have noted the similarities between this attack and a shocking 2022 ambush on police in Queensland . \"This threat is very real and we need to be very vigilant about it,\" he said in an interview with the ABC on Tuesday night. Watch: Australia police shooting suspect is still at large and \"heavily armed\" Policing Gun crime Australia",
    "reactions": [
      "Latest update from BBC Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "887a9d5554f593ec6c1872ec8d1f4b5a",
    "title": "2 men publicly caned for hugging and kissing in Indonesia",
    "source": "https://www.reddit.com/r/worldnews/comments/1n1auoi/2_men_publicly_caned_for_hugging_and_kissing_in/",
    "generatedAt": "2025-08-27T10:10:03.224Z",
    "publishedAt": "2025-08-27T07:49:55.000Z",
    "feedName": "Reddit r/worldnews",
    "author": "/u/Affectionate_Cat293 https://www.reddit.com/user/Affectionate_Cat293",
    "category": "General",
    "essence": "Go to worldnews r/worldnews • Affectionate_Cat293 2 men publicly caned for hugging and kissing in Indonesia cbsnews.com Open Share",
    "reactions": [
      "Latest update from Reddit r/worldnews",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "4aff74ee7c48a2a26310d6174b82fee9",
    "title": "Energy bills to rise by more than expected ahead of winter",
    "source": "https://www.bbc.com/news/articles/c78zgz7j576o?at_medium=RSS&at_campaign=rss",
    "generatedAt": "2025-08-27T10:32:20.478Z",
    "publishedAt": "2025-08-27T07:45:58.000Z",
    "feedName": "BBC Top Stories",
    "author": "BBC Top Stories",
    "category": "General",
    "essence": "Energy bills to rise by more than expected ahead of winter 3 hours ago Share Save Kevin Peachey Cost of living correspondent, BBC News Share Save Getty Images Gas and electricity prices will rise by 2% for millions of households under the latest cap announced by energy regulator Ofgem. The increase, which is slightly more than analysts expected, means a household using a typical amount of energy will pay £1,755 a year, up £35 a year on the current cap. The increase will kick in at the start of October, which campaigners say will mean another winter of relatively high energy bills. Ofgem's cap sets the maximum price that can be charged for each unit of gas and electricity for millions of households in England, Scotland and Wales. Individual households can calculate their estimated specific change by adding £2 onto every £100 they spend at the moment on energy each year. The increase comes as families are also facing rises in other basic costs. The British Retail Consortium said that food costs were rising at their fastest rate since the February of last year , with the price of chocolate, butter and eggs soaring. The energy cap sets the maximum price for each unit, but not the total bill which depends on how much energy you use. The change comes into force at the start of October and lasts for three months. Ofgem changes the cap, largely based on the cost of energy on wholesale markets. However, the rise in bills this time is partly the result of the higher than expected cost of balancing the energy network and extra support measures for consumers, previously announced by the government and in place this winter. Anyone on means-tested benefits will automatically receive the £150 Warm Home Discount on their bills. Some previously did not qualify owing to the size of their property, but that condition will be scrapped. All billpayers will chip in to fund this extra support, mainly through higher standing charges - the fixed cost of connecting to the supply. It means standing charges will typically rise by 4% for electricity and 14% for gas, with the latter rising from 29p a day to 34p. Energy price cap: How much gas and electricity does a typical household use? The winter fuel payment U-turn in numbers 'Healthier market' The consumer group Which? said it could be a good time to shop around for a fixed-price deal, but billpayers should be alert to exit fees. \"Some contracts charge large fees to leave early, which would cancel out any savings,\" said Emily Seymour, from Which?. Ofgem said that more than a third of billpayers were now on fixed deals, where the price of each unit is fixed for a year and unaffected by the price cap. Tim Jarvis, director general of markets at the energy regulator, said this was a sign of a \"healthier market\". He accepted that people would still feel the impact of a price rise, but added some could do things to save themselves money, such as paying via direct debit each month rather than receiving a bill every three months - called standard credit. Around 20 million households pay by direct debit, with eight million on standard credit, and six million on prepayment meters. Leanne Gough says it is hard for people to come to ask for help Campaigners say many households are still struggling to pay bills, as well as repay £4bn of energy debt that built up during a period of high prices. Simon Francis, coordinator of the End Fuel Poverty Coalition, said this would mean another winter of high prices. \"The average family still paying hundreds of pounds more than they did just a few years ago,\" he said. Some support comes from local communities. Staff at Parc Primary School at Cwm Parc in the Rhondda Valley provide extensive help for families struggling with everyday costs, including their energy bills. The school is partnered with the Fuel Bank Foundation charity, providing vouchers to low-income families to meet energy costs. \"We've got a high level of need, and over the last couple of years we've seen that more and more. People are really struggling. And not only with the fuel, but life in general,\" said Leanne Gough, the school's family engagement officer. \"Sometimes you issue a fuel bank voucher and you can see the relief on their face, but it is a short-term. People are proud, so it takes a lot for them to come to ask. They will do everything they can beforehand.\" The government, which earlier this year made a U-turn on winter fuel payments , said it was determined to help vulnerable families by expanding the Warm Home Discount. Energy minister Michael Shanks said the government wanted more clean energy produced domestically to bring down prices. Energy UK, which represents suppliers, said the Warm Home Discount expansion should only be a temporary measure and targeting those most in need was a better long-term requirement. The Conservatives said that energy bills were going up owing to government ministers' choices, rather than wholesale costs. Liberal Democrat leader Ed Davey said \"the last thing\" families and pensioners needed was higher energy bills this winter. Money Ofgem Personal finance Energy industry Personal debt Cost of Living",
    "reactions": [
      "Latest update from BBC Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "5e51216cbc0689dea615dc6acf363baa",
    "title": "Former player makes Aussie Rules history by coming out as bisexual",
    "source": "https://www.bbc.com/news/articles/c4g6wwrze2xo?at_medium=RSS&at_campaign=rss",
    "generatedAt": "2025-08-27T10:32:21.082Z",
    "publishedAt": "2025-08-27T07:42:47.000Z",
    "feedName": "BBC Top Stories",
    "author": "BBC Top Stories",
    "category": "General",
    "essence": "Former player makes AFL history by coming out as bisexual 3 hours ago Share Save Yang Tian BBC News Reporting from Sydney Share Save Getty Images Brown described a culture of \"hyper-masculinity\" in the AFL A former Aussie Rules player has come out as the first openly gay or bisexual man in the Australian Football League's (AFL) 129-year history. Mitch Brown, who played 94 matches for the West Coast Eagles from between 2007 and 2016, told The Daily Aus that the weight of hiding his sexuality played a \"huge\" part in his decision to retire. He added that he hopes his decision to speak out will create the \"safety, comfort and space\" for others to come forward. The news marks a pivotal moment for the AFL, which before Brown's announcement, was the only major professional men's sport globally to never have had an openly gay or bisexual player, even after retirement. Brown first shared the news in a direct message to The Daily Aus's social media account after watching coverage of recent incidents of homophobia in the AFL. \"I played in the AFL for 10 years for the West Coast Eagles, and I'm a bisexual man,\" he wrote. The decision to speak out came from a \"feeling of peace... comfort and confidence\" that he didn't have while hiding his sexuality when he was an active player, Brown said. \"It was never once an opportunity to speak openly or explore your feelings or questions in a safe way,\" he added. Brown described a culture of \"hyper-masculinity\" in the AFL, where he heard \"countless\" homophobic comments hurled at him on the field. \"When I was growing up at school, the word 'gay' was thrown around constantly… For a man in Australia, [it was seen as] probably the weakest thing you could be.\" He also recalled having a conversation with teammates about how they would feel having to shower next to a gay man. \"One of the players said 'I'd rather be in a cage full of lions than have a shower next to a gay man.'\" Brown's revelation and criticism of the AFL's culture could mark a significant shift in the locker rooms of Australian men's sports, an expert in behavioural science told the BBC. \"This is an historic moment for world sport because the AFL is the last major professional sport to be without a openly gay or bisexual male player. However players coming out so far hasn't had much of an effect on changing behaviours in the grassroots,\" said Monash University researcher Erik Denison. \"[But] Brown is taking a very different approach than other players in that he is being very open about the problems that need to change in his sport, at the grassroots, to make people like him feel safe.\" It has been 50 years since former American football player David Kopay came out as the first gay professional athlete in the NFL - but Denison is hopeful that Brown's announcement will \"help drive change to culture and behaviour at clubs around Australia\". Brown, 36, is currently in a relationship with a female partner and was previously married to former netball player Shae Bolton, with whom he shares two sons. The announcement comes after several high-profile homophobic incidents in the AFL. Last week, Adelaide Crows player Izak Rankine received a four-week ban for using a \"highly offensive\" homophobic slur during a game. Addressing the incident, Brown said he would like to see a \"sense of change\" in the league through the lifting up of \"positive male role models\". \"My advice to the AFL would be, let's celebrate the players who may not be the most successful, but they're the most important players in our community.\" Brown said he believes there are currently gay and bisexual players in the AFL who remain closeted. He encouraged fans to have empathy for all players and shared a message for those who still don't feel comfortable enough to speak out. \"I see you and you are not alone.\" Pride jersey row: A reckoning for Australian sport? Australian footy faces same racism storm 30 years on Folau sacked for anti-gay post Footballer Josh Cavallo comes out as gay Homophobia LGBT Australia",
    "reactions": [
      "Latest update from BBC Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "7d4fc88652242f5bd7cced741b3d634e",
    "title": "Two French teens detained for alleged plots against Eiffel Tower, synagogues",
    "source": "https://www.reddit.com/r/worldnews/comments/1n1aq89/two_french_teens_detained_for_alleged_plots/",
    "generatedAt": "2025-08-27T10:10:03.685Z",
    "publishedAt": "2025-08-27T07:41:35.000Z",
    "feedName": "Reddit r/worldnews",
    "author": "/u/wegochai https://www.reddit.com/user/wegochai",
    "category": "General",
    "essence": "Go to worldnews r/worldnews r/worldnews 🌎🌍🌏 A place for major news from around the world, excluding US-internal news. Members Online • wegochai Two French teens detained for alleged plots against Eiffel Tower, synagogues report.az Open Share",
    "reactions": [
      "Latest update from Reddit r/worldnews",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "d81c219349e96c810aaf0333489bf300",
    "title": "Old master painting looted by Nazis spotted in Argentinian property listing",
    "source": "https://www.reddit.com/r/news/comments/1n1ag0c/old_master_painting_looted_by_nazis_spotted_in/",
    "generatedAt": "2025-08-27T10:09:59.035Z",
    "publishedAt": "2025-08-27T07:22:53.000Z",
    "feedName": "Reddit r/news",
    "author": "/u/apple_kicks https://www.reddit.com/user/apple_kicks",
    "category": "General",
    "essence": "Go to news r/news r/news 📰 The place for news articles about current events in the United States and the rest of the world. Discuss it all here. Members Online • apple_kicks Top 1% Poster Old master painting looted by Nazis spotted in Argentinian property listing theguardian.com Open Share",
    "reactions": [
      "Latest update from Reddit r/news",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "7534afa49de4b767d5e45a8968f2c35a",
    "title": "Mitch Brown: Former West Coast Eagle becomes AFL’s first-ever openly bisexual man",
    "source": "https://www.reddit.com/r/news/comments/1n1aaq4/mitch_brown_former_west_coast_eagle_becomes_afls/",
    "generatedAt": "2025-08-27T10:09:59.601Z",
    "publishedAt": "2025-08-27T07:13:24.000Z",
    "feedName": "Reddit r/news",
    "author": "/u/Stonp https://www.reddit.com/user/Stonp",
    "category": "General",
    "essence": "Go to news r/news r/news 📰 The place for news articles about current events in the United States and the rest of the world. Discuss it all here. Members Online • Stonp Mitch Brown: Former West Coast Eagle becomes AFL’s first-ever openly bisexual man thewest.com.au Open Share",
    "reactions": [
      "Latest update from Reddit r/news",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "a23bfa238e060a4ce2ae7c4768772268",
    "title": "Putin fears meeting with Zelenskyy, Canadian PM says",
    "source": "https://www.reddit.com/r/worldnews/comments/1n1a9ld/putin_fears_meeting_with_zelenskyy_canadian_pm/",
    "generatedAt": "2025-08-27T10:32:25.399Z",
    "publishedAt": "2025-08-27T07:11:17.000Z",
    "feedName": "Reddit r/worldnews",
    "author": "/u/jackytheblade https://www.reddit.com/user/jackytheblade",
    "category": "General",
    "essence": "Go to worldnews r/worldnews r/worldnews 🌎🌍🌏 A place for major news from around the world, excluding US-internal news. Members Online • jackytheblade Top 1% Poster Putin fears meeting with Zelenskyy, Canadian PM says Russia/Ukraine pravda.com.ua Open Share",
    "reactions": [
      "Latest update from Reddit r/worldnews",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "ea470ded88c79f4e4abe62f17a2ec1fb",
    "title": "Where does blame lie for Celtic's Champions League exit?",
    "source": "https://www.bbc.com/sport/football/articles/c8denljlv64o?at_medium=RSS&at_campaign=rss",
    "generatedAt": "2025-08-27T11:06:42.790Z",
    "publishedAt": "2025-08-27T06:40:25.000Z",
    "feedName": "BBC Top Stories",
    "author": "BBC Top Stories",
    "category": "General",
    "essence": "Where does blame lie for Celtic's Champions League exit? Image source, SNS Image caption, Brendan Rodgers left big-money signings Arne Engels and Adam Idah on the bench in Almaty Tom English BBC Scotland's chief sports writer Published 4 hours ago Now that Celtic's doomsday scenario has come true - ignominy in Almaty - there should be a reappraisal of the club's most egregious and self-inflicted exits in Champions League qualifiers in the last dozen seasons or so. Maribor, Malmo and AEK Athens. CFR Cluj, Ferencvaros and FC Midtjylland. All wounding, all the cause of introspection and fury. Some of those clubs had a big claim on being the greatest European bogey that caused the most damage to Celtic and the delusions of grandeur they have of themselves as a great European club. The immortals of 1967 and the atmosphere on Champions League nights continue to do some seriously heavy lifting on that front. All of those Celtic conquerors were emphatically put in their place by Kairat Almaty on Tuesday night. Brendan Rodgers has overseen some horror shows - seven-goal thrashings that made you hide behind the couch - but this was on another level. It was third-rate stuff, with apologies to third-rate. How did Celtic let Champions League dream slip? Published 13 hours ago Celtic blow Champions League bid in Almaty shootout Sportsound: Celtic crash out of the Champions League play-off Take those exits from the Champions League, multiply them by Rodgers' wretched defeats by Barcelona, Paris St-Germain, Atletico Madrid and Borussia Dortmund and still you do not hit the cringe factor of these ties against a Kairat side that a properly functioning Celtic would expect to beat. No goal in 210 minutes of football, three missed penalties in the shootout and a couple of golden chances wasted across the two legs led to more than £40m wafting away in the air in Kazakhstan. And, of course, the Champions League being swapped for the Europa League. As failings go, this was a seismic one and in analysing who is at fault, there is a world of criticism for everybody. This was a defeat for the collective - players, manager, board. They are all in the frame together. It was an illustration of a club gambling on progress by waiting for Champions League qualification to be secured before properly refreshing its squad. It is a thunderous example of how they have allowed their standards to drop, on the pitch and off it. Not that many months ago, Celtic went toe-to-toe over two legs with the Bayern Munich of Manuel Neuer, Dayot Upamecano, Joshua Kimmich, Jamal Musiala, Harry Kane, Kingsley Coman and Thomas Muller. In losing 3-2 on aggregate and coming within seconds of taking the Germans to extra time in their own backyard, Celtic had momentum, something to build on. They also had a stack of money in the bank and a support, broadly, facing in the same direction as the board. There was relative harmony and positivity. A rare commodity in Glasgow. Now there's bitterness and rancour. They have blown their feel-good factor sky high. 'Holes in the Celtic team obvious' In two games the lack of ambition to improve the team has boomeranged back and hit the club squarely between the eyes. That is on the board of directors - chief among them, major shareholder Dermot Desmond. The Irishman is immensely powerful at the club. Would it be too much for the fans to hope to hear from him from time to time? Could chief executive Michael Nicholson give a little insight on the vision? It would not hurt and it might help explain how they have gone from the optimism of Bayern Munich to the humiliation of Kairat Almaty in six months. The holes in the team have been obvious for a while. The need for new energy was clear. Somehow, Celtic entered the Champions League play-off round comprehensively weaker than last season. Tuesday's failure is also on Rodgers. Celtic get love-bombed at home. Rodgers over-praises his team when they beat up on some domestic sides with a tiny fraction of their budget. Everybody swoons when they put four and five on weaker teams. When they do a job on Rangers and win another league title to sit alongside all the other league titles, there is a feeling that nothing else matters. Progress in Europe? Yeah, that would be nice. But keeping the Ibrox club in their box is the bread and butter. It's about ambition and the board's interpretation of what ambition looks like. Celtic should be way, way beyond such parochial thinking. The allegation can be levelled at them, fairly or unfairly, of just wanting to stay a few steps ahead of their city rival. Occasionally, at Rodgers' pleading, they'll push the boat out - Arne Engels, Adam Idah, Auston Trusty brought in at a cost of about £26m - but mostly it is steady as she goes. And it has worked if domestic dominance, player trading and money in the coffers is your ideal. If trying to kick on from Bayern is more your bag - as is the case with Rodgers - then there is a problem. But Rodgers gets no free pass in all of this. To play this video you need to enable JavaScript in your browser. This video can not be played Media caption, Brendan Rodgers said Celtic have to stick together after the loss to Kairat This is the flip-side of the argument. So many players from last season have gone backwards. Idah and Engels cannot even get in the team. Trusty would not have been in the team either had he been fit. These are Rodgers' signings. The core of the team is still Ange Postecoglou's, because too many of the players Rodgers has recruited haven't done it as yet. So, this exit is everybody's shambles. The leading narrative might be about the board not signing the players for the big push, but the board, if they were minded, could come back with a counter-argument about the value for money Rodgers' arrivals have provided so far. If he's not starting them, the answer right now is \"not much\". It would not be unreasonable for them to say that they expected more. A win over Kairat or a goal or a semblance of cohesion over two legs. There is no contract offer on the table for the manager and so, as it stands, he is away next summer. Maybe that outcome would suit both parties. Rodgers says there is no conflict between him and his board but his frustration has been obvious. This is a knotted situation that could become even worse domestically if Rangers were not so hell-bent on raising the ante in the crisis stakes. Celtic will likely win one, two and very possibly three trophies this season. If they do, the regrettable thing is that the lessons of Almaty could be lost. The Old Firm are now in a ferocious battle with each other to determine who has the angriest fans. It is a colossal fight. Rangers have to play Brugge on Wednesday evening, already trailing 3-1 with the likelihood of more pain to come in Belgium. Then the Glasgow Two meet at Ibrox on Sunday. Oxygen masks may be required. Get in touch Have your say on the action Contact form Contact form Related topics Scottish Premiership Celtic Scottish Football Football More on this story Visit our Celtic page for all the latest news, analysis and fan views Get Celtic news notifications in the BBC Sport app Published 18 June 2023",
    "reactions": [
      "Latest update from BBC Top Stories",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "5681f629245b230a882beb8d0556d3c9",
    "title": "Men with connections to Trump are trying to infiltrate Greenland",
    "source": "https://www.reddit.com/r/worldnews/comments/1n17kco/men_with_connections_to_trump_are_trying_to/",
    "generatedAt": "2025-08-27T10:32:25.897Z",
    "publishedAt": "2025-08-27T04:27:12.000Z",
    "feedName": "Reddit r/worldnews",
    "author": "/u/TruthParticular5078 https://www.reddit.com/user/TruthParticular5078",
    "category": "General",
    "essence": "Go to worldnews r/worldnews r/worldnews 🌎🌍🌏 A place for major news from around the world, excluding US-internal news. Members Online • TruthParticular5078 Men with connections to Trump are trying to infiltrate Greenland dr.dk Open Share",
    "reactions": [
      "Latest update from Reddit r/worldnews",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "485f48d3a08a4a6932c22c4b20c6678f",
    "title": "Trump imposes 50% tariff on India as punishment for buying Russian oil",
    "source": "https://www.reddit.com/r/worldnews/comments/1n179aw/trump_imposes_50_tariff_on_india_as_punishment/",
    "generatedAt": "2025-08-27T10:32:26.357Z",
    "publishedAt": "2025-08-27T04:10:18.000Z",
    "feedName": "Reddit r/worldnews",
    "author": "/u/NewSlinger https://www.reddit.com/user/NewSlinger",
    "category": "General",
    "essence": "Go to worldnews r/worldnews • NewSlinger Trump imposes 50% tariff on India as punishment for buying Russian oil theguardian.com Open Share",
    "reactions": [
      "Latest update from Reddit r/worldnews",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "6106a7f7b6f09398a905c9d05c974f72",
    "title": "/r/WorldNews Live Thread: Russian Invasion of Ukraine Day 1280, Part 1 (Thread #1427)",
    "source": "https://www.reddit.com/r/worldnews/comments/1n174h2/rworldnews_live_thread_russian_invasion_of/",
    "generatedAt": "2025-08-27T10:32:26.818Z",
    "publishedAt": "2025-08-27T04:02:49.000Z",
    "feedName": "Reddit r/worldnews",
    "author": "/u/WorldNewsMods https://www.reddit.com/user/WorldNewsMods",
    "category": "General",
    "essence": "Go to worldnews r/worldnews r/worldnews 🌎🌍🌏 A place for major news from around the world, excluding US-internal news. Members Online • WorldNewsMods /r/WorldNews Live Thread: Russian Invasion of Ukraine Day 1280, Part 1 (Thread #1427) Russia/Ukraine reddit.com Open Share",
    "reactions": [
      "Latest update from Reddit r/worldnews",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "15250b87216daeaccfd27b33ce17cc11",
    "title": "U.S. orange juice shipments plummet as Canadians find Florida OJ hard to swallow",
    "source": "https://www.reddit.com/r/news/comments/1n16htn/us_orange_juice_shipments_plummet_as_canadians/",
    "generatedAt": "2025-08-27T10:10:00.184Z",
    "publishedAt": "2025-08-27T03:29:41.000Z",
    "feedName": "Reddit r/news",
    "author": "/u/SincereSolutions https://www.reddit.com/user/SincereSolutions",
    "category": "General",
    "essence": "Go to news r/news r/news 📰 The place for news articles about current events in the United States and the rest of the world. Discuss it all here. Members Online • SincereSolutions U.S. orange juice shipments plummet as Canadians find Florida OJ hard to swallow cbc.ca Open Share",
    "reactions": [
      "Latest update from Reddit r/news",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "a53c9b547e36dfc32b3fc3ec4759af5f",
    "title": "\"South Korea looks forward to \"construction of Trump tower in North Korea, [Trump] playing golf\": President Lee Jae Myung",
    "source": "https://www.reddit.com/r/worldnews/comments/1n15k5g/south_korea_looks_forward_to_construction_of/",
    "generatedAt": "2025-08-27T11:06:48.045Z",
    "publishedAt": "2025-08-27T02:43:54.000Z",
    "feedName": "Reddit r/worldnews",
    "author": "/u/APrimitiveMartian https://www.reddit.com/user/APrimitiveMartian",
    "category": "General",
    "essence": "Go to worldnews r/worldnews r/worldnews 🌎🌍🌏 A place for major news from around the world, excluding US-internal news. Members Online • APrimitiveMartian \"South Korea looks forward to \"construction of Trump tower in North Korea, [Trump] playing golf\": President Lee Jae Myung North Korea tribuneindia.com Open Share",
    "reactions": [
      "Latest update from Reddit r/worldnews",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "ce6d88afbb6a8a1274ecbb4424468062",
    "title": "US envoy sparks uproar after telling Lebanese journalists to ‘act civilised’",
    "source": "https://www.reddit.com/r/worldnews/comments/1n15ii6/us_envoy_sparks_uproar_after_telling_lebanese/",
    "generatedAt": "2025-08-27T11:06:48.503Z",
    "publishedAt": "2025-08-27T02:41:40.000Z",
    "feedName": "Reddit r/worldnews",
    "author": "/u/jupa300 https://www.reddit.com/user/jupa300",
    "category": "General",
    "essence": "Go to worldnews r/worldnews r/worldnews 🌎🌍🌏 A place for major news from around the world, excluding US-internal news. Members Online • jupa300 US envoy sparks uproar after telling Lebanese journalists to ‘act civilised’ theguardian.com Open Share",
    "reactions": [
      "Latest update from Reddit r/worldnews",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "6de28ee999fe07ee395fd47025ae9cea",
    "title": "DOGE put Social Security numbers and other data on a risky serve whistleblower alleges",
    "source": "https://www.reddit.com/r/news/comments/1n142op/doge_put_social_security_numbers_and_other_data/",
    "generatedAt": "2025-08-27T10:10:00.544Z",
    "publishedAt": "2025-08-27T01:33:18.000Z",
    "feedName": "Reddit r/news",
    "author": "/u/proboscisjoe https://www.reddit.com/user/proboscisjoe",
    "category": "General",
    "essence": "Go to news r/news r/news 📰 The place for news articles about current events in the United States and the rest of the world. Discuss it all here. Members Online • proboscisjoe DOGE put Social Security numbers and other data on a risky serve whistleblower alleges nbcnews.com Open Share",
    "reactions": [
      "Latest update from Reddit r/news",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "8bff418fe98a503850f3da186e494386",
    "title": "Xi Jinping congratulates Ukraine on Independence Day for the first time",
    "source": "https://www.reddit.com/r/worldnews/comments/1n140fh/xi_jinping_congratulates_ukraine_on_independence/",
    "generatedAt": "2025-08-27T11:06:48.959Z",
    "publishedAt": "2025-08-27T01:30:21.000Z",
    "feedName": "Reddit r/worldnews",
    "author": "/u/TheRealMykola https://www.reddit.com/user/TheRealMykola",
    "category": "General",
    "essence": "Go to worldnews r/worldnews r/worldnews 🌎🌍🌏 A place for major news from around the world, excluding US-internal news. Members Online • TheRealMykola Xi Jinping congratulates Ukraine on Independence Day for the first time Russia/Ukraine english.nv.ua Open Share",
    "reactions": [
      "Latest update from Reddit r/worldnews",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "dff9eb9e08314985d37d10a9b2987814",
    "title": "SpaceX's Starship deploys first mock Starlink satellites on 10th test flight",
    "source": "https://www.reddit.com/r/news/comments/1n13l3b/spacexs_starship_deploys_first_mock_starlink/",
    "generatedAt": "2025-08-27T10:10:01.033Z",
    "publishedAt": "2025-08-27T01:10:17.000Z",
    "feedName": "Reddit r/news",
    "author": "/u/RAS_syndrome https://www.reddit.com/user/RAS_syndrome",
    "category": "General",
    "essence": "Go to news r/news r/news 📰 The place for news articles about current events in the United States and the rest of the world. Discuss it all here. Members Online • RAS_syndrome SpaceX's Starship deploys first mock Starlink satellites on 10th test flight Soft paywall reuters.com Open Share",
    "reactions": [
      "Latest update from Reddit r/news",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "0a123f86cad07fa002eda58d7a13e784",
    "title": "France to sue Kick for alleged negligence over livestream death",
    "source": "https://www.reddit.com/r/worldnews/comments/1n127he/france_to_sue_kick_for_alleged_negligence_over/",
    "generatedAt": "2025-08-27T11:06:49.232Z",
    "publishedAt": "2025-08-27T00:06:17.000Z",
    "feedName": "Reddit r/worldnews",
    "author": "/u/AllicinCarbonUV https://www.reddit.com/user/AllicinCarbonUV",
    "category": "General",
    "essence": "Go to worldnews r/worldnews • AllicinCarbonUV France to sue Kick for alleged negligence over livestream death theguardian.com Open Share",
    "reactions": [
      "Latest update from Reddit r/worldnews",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "5cc5d053efa4bce1801bb42f0e4ec12d",
    "title": "Cracker Barrel to return to its old logo after backlash",
    "source": "https://www.reddit.com/r/news/comments/1n112qh/cracker_barrel_to_return_to_its_old_logo_after/",
    "generatedAt": "2025-08-27T10:32:22.272Z",
    "publishedAt": "2025-08-26T23:16:11.000Z",
    "feedName": "Reddit r/news",
    "author": "/u/NewSlinger https://www.reddit.com/user/NewSlinger",
    "category": "General",
    "essence": "Go to news r/news r/news 📰 The place for news articles about current events in the United States and the rest of the world. Discuss it all here. Members Online • NewSlinger Top 1% Poster Cracker Barrel to return to its old logo after backlash cbsnews.com Open Share",
    "reactions": [
      "Latest update from Reddit r/news",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "70a0e548e1e3dc9046995a3ad53bbf69",
    "title": "Fort Hood officials chose not to warn public as predator attacked female soldiers in their barracks for 18 months",
    "source": "https://www.reddit.com/r/news/comments/1n0zyrh/fort_hood_officials_chose_not_to_warn_public_as/",
    "generatedAt": "2025-08-27T10:32:22.550Z",
    "publishedAt": "2025-08-26T22:28:46.000Z",
    "feedName": "Reddit r/news",
    "author": "/u/Kinmuan https://www.reddit.com/user/Kinmuan",
    "category": "General",
    "essence": "Go to news r/news r/news 📰 The place for news articles about current events in the United States and the rest of the world. Discuss it all here. Members Online • Kinmuan Fort Hood officials chose not to warn public as predator attacked female soldiers in their barracks for 18 months Soft paywall stripes.com Open Share",
    "reactions": [
      "Latest update from Reddit r/news",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "fe2f8c8acb26256a7e7e6a01a47fdb08",
    "title": "Prisoner laments reliance on floppy disks for appeals documents, limiting file sizes to 1.44 MB — prisoners allowed 20 floppy disks in cell, but USB flash sticks are banned in New Jersey system",
    "source": "https://www.reddit.com/r/news/comments/1n0zwjo/prisoner_laments_reliance_on_floppy_disks_for/",
    "generatedAt": "2025-08-27T10:32:23.049Z",
    "publishedAt": "2025-08-26T22:26:10.000Z",
    "feedName": "Reddit r/news",
    "author": "/u/EnergyLantern https://www.reddit.com/user/EnergyLantern",
    "category": "General",
    "essence": "Go to news r/news r/news 📰 The place for news articles about current events in the United States and the rest of the world. Discuss it all here. Members Online • EnergyLantern Prisoner laments reliance on floppy disks for appeals documents, limiting file sizes to 1.44 MB — prisoners allowed 20 floppy disks in cell, but USB flash sticks are banned in New Jersey system tomshardware.com Open Share",
    "reactions": [
      "Latest update from Reddit r/news",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "52dce727139ebe17448e0d6a410fe167",
    "title": "Minnesota woman charged for using racial slur against Black child as her fundraising tops $800,000",
    "source": "https://www.reddit.com/r/news/comments/1n0zv0x/minnesota_woman_charged_for_using_racial_slur/",
    "generatedAt": "2025-08-27T10:32:23.586Z",
    "publishedAt": "2025-08-26T22:24:24.000Z",
    "feedName": "Reddit r/news",
    "author": "/u/NewSlinger https://www.reddit.com/user/NewSlinger",
    "category": "General",
    "essence": "Go to news r/news r/news 📰 The place for news articles about current events in the United States and the rest of the world. Discuss it all here. Members Online • NewSlinger Top 1% Poster Minnesota woman charged for using racial slur against Black child as her fundraising tops $800,000 apnews.com Open Share",
    "reactions": [
      "Latest update from Reddit r/news",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "475e578af8d6a447626065d95d0bb78d",
    "title": "Artwork looted by Nazis 80 years ago spotted in estate agent ad",
    "source": "https://www.reddit.com/r/news/comments/1n0x0nv/artwork_looted_by_nazis_80_years_ago_spotted_in/",
    "generatedAt": "2025-08-27T10:32:24.012Z",
    "publishedAt": "2025-08-26T20:31:42.000Z",
    "feedName": "Reddit r/news",
    "author": "/u/AudibleNod https://www.reddit.com/user/AudibleNod",
    "category": "General",
    "essence": "Go to news r/news r/news 📰 The place for news articles about current events in the United States and the rest of the world. Discuss it all here. Members Online • AudibleNod Top 1% Poster Artwork looted by Nazis 80 years ago spotted in estate agent ad Argentina bbc.com Open Share",
    "reactions": [
      "Latest update from Reddit r/news",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "0a94db01920035472f32f8eca6f675d1",
    "title": "States must ax transgender references from sex ed or risk losing funds, Trump admin says",
    "source": "https://www.reddit.com/r/news/comments/1n0w2aj/states_must_ax_transgender_references_from_sex_ed/",
    "generatedAt": "2025-08-27T11:06:44.554Z",
    "publishedAt": "2025-08-26T19:56:07.000Z",
    "feedName": "Reddit r/news",
    "author": "/u/CupidStunt13 https://www.reddit.com/user/CupidStunt13",
    "category": "General",
    "essence": "Go to news r/news r/news 📰 The place for news articles about current events in the United States and the rest of the world. Discuss it all here. Members Online • CupidStunt13 Top 1% Poster States must ax transgender references from sex ed or risk losing funds, Trump admin says nbcnews.com Open Share",
    "reactions": [
      "Latest update from Reddit r/news",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "e9a6fe89424e260c1d5cac3df1cb4d16",
    "title": "14 arrested in largest Home Depot theft ring ever, officials say",
    "source": "https://www.reddit.com/r/news/comments/1n0vigc/14_arrested_in_largest_home_depot_theft_ring_ever/",
    "generatedAt": "2025-08-27T11:06:45.031Z",
    "publishedAt": "2025-08-26T19:34:49.000Z",
    "feedName": "Reddit r/news",
    "author": "/u/jeetah https://www.reddit.com/user/jeetah",
    "category": "General",
    "essence": "Go to news r/news r/news 📰 The place for news articles about current events in the United States and the rest of the world. Discuss it all here. Members Online • jeetah Top 1% Poster 14 arrested in largest Home Depot theft ring ever, officials say abcnews.go.com Open Share",
    "reactions": [
      "Latest update from Reddit r/news",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "6b54e8d5fc9111b83375cc8ec0b63d44",
    "title": "Israeli military says strikes on Gaza hospital targeted what it says was a Hamas camera",
    "source": "https://www.reddit.com/r/news/comments/1n0uu34/israeli_military_says_strikes_on_gaza_hospital/",
    "generatedAt": "2025-08-27T11:06:45.842Z",
    "publishedAt": "2025-08-26T19:08:57.000Z",
    "feedName": "Reddit r/news",
    "author": "/u/CupidStunt13 https://www.reddit.com/user/CupidStunt13",
    "category": "General",
    "essence": "Go to news r/news r/news 📰 The place for news articles about current events in the United States and the rest of the world. Discuss it all here. Members Online • CupidStunt13 Top 1% Poster Israeli military says strikes on Gaza hospital targeted what it says was a Hamas camera apnews.com Open Locked post. New comments cannot be posted. Share",
    "reactions": [
      "Latest update from Reddit r/news",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "bfc37fae9f44f519cc9105de47c0eeb5",
    "title": "Haros charged with murder of son, 7-month-old Emmanuel, in Riverside County",
    "source": "https://www.reddit.com/r/news/comments/1n0utck/haros_charged_with_murder_of_son_7monthold/",
    "generatedAt": "2025-08-27T11:06:46.344Z",
    "publishedAt": "2025-08-26T19:08:09.000Z",
    "feedName": "Reddit r/news",
    "author": "/u/marshmellowterrorist https://www.reddit.com/user/marshmellowterrorist",
    "category": "General",
    "essence": "Go to news r/news r/news 📰 The place for news articles about current events in the United States and the rest of the world. Discuss it all here. Members Online • marshmellowterrorist Haros charged with murder of son, 7-month-old Emmanuel, in Riverside County sbsun.com Open Share",
    "reactions": [
      "Latest update from Reddit r/news",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "392663102b24197b4a4a6cbe0fdc592f",
    "title": "Revealed: gambling logos and ads seen up to every 13 seconds during big sports games in US",
    "source": "https://www.reddit.com/r/news/comments/1n0qcux/revealed_gambling_logos_and_ads_seen_up_to_every/",
    "generatedAt": "2025-08-27T11:06:46.667Z",
    "publishedAt": "2025-08-26T16:21:50.000Z",
    "feedName": "Reddit r/news",
    "author": "/u/catsgr8rthanspoonies https://www.reddit.com/user/catsgr8rthanspoonies",
    "category": "General",
    "essence": "Go to news r/news r/news 📰 The place for news articles about current events in the United States and the rest of the world. Discuss it all here. Members Online • catsgr8rthanspoonies Revealed: gambling logos and ads seen up to every 13 seconds during big sports games in US theguardian.com Open Share",
    "reactions": [
      "Latest update from Reddit r/news",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  }
]