[
  {
    "id": "0e007dae8c8da2b2b0f9b006c0fb4055",
    "title": "Older age and low fitness levels associated with heartbeat abnormalities that increase future cardiovascular risk",
    "source": "https://medicalxpress.com/news/2025-08-older-age-heartbeat-abnormalities-future.html",
    "generatedAt": "2025-08-27T11:29:10.292Z",
    "publishedAt": "2025-08-27T06:00:03.000Z",
    "feedName": "Medical Xpress – Health",
    "author": "Medical Xpress – Health",
    "category": "Health",
    "essence": "August 27, 2025 The GIST Older age and low fitness levels associated with heartbeat abnormalities that increase future cardiovascular risk by European Society of Cardiology edited by Sadie Harley , reviewed by Robert Egan Sadie Harley scientific editor Meet our editorial team Behind our editorial process Robert Egan associate editor Meet our editorial team Behind our editorial process Editors' notes This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility: fact-checked trusted source proofread Credit: Pixabay/CC0 Public Domain New research has revealed that older age and low aerobic fitness levels are strong and independent risk factors for a high burden of heartbeat irregularities, known as arrhythmias, that indicate future cardiovascular risk. The research was conducted in healthy participants between the ages of 40 and 60 years old with no heart symptoms. The findings were presented at the 2025 European Society of Cardiology Congress in Madrid, Spain. The researchers found that specific heart abnormalities, known as atrial arrhythmias, were closely associated with older age and fitness levels. Participants with lower fitness levels in particular had significantly higher risk of frequent and complex atrial arrhythmias. Old age was also a risk factor for ventricular arrhythmias . The results support age-based arrhythmia screening after the age of 50 to prevent heart disease , and highlight the important protective role of fitness in reducing arrhythmia risk—even for healthy individuals who do not yet have any heart symptoms. The study was led by Dr. Amit Moses, from the Chaim Sheba Medical Center, Israel. He explained, \"These findings are a powerful reminder that the heart often whispers before it shouts. Subtle signs, such as frequent irregular heartbeats and complex arrhythmias, give us an early warning of future risk before symptoms occur. This could allow early intervention to alter the trajectory of disease, allowing us to move to a new era of anticipatory heart medicine.\" \"We were particularly struck by the strength of the association between lower aerobic fitness levels and higher risk of frequent atrial ectopy and complex arrhythmias. This is further evidence that maintaining good physical fitness should be a priority for everyone to improve their heart health and prevent the development of arrhythmias later in life.\" Dr. Moses continued, \"Exercise should be tailored to one's age and capacity, and can involve simple and cheap activities such as walking, running, cycling or other aerobic activities performed consistently.\" A total of 1,151 healthy individuals aged between the ages of 40 and 65, without any heart symptoms or structural heart disease, took part in the study at the Institute for Medical Screening, Chaim Sheba Medical Center, Israel. The mean age of participants was 52 ± 7 years and 88% were men and 12% were female. Participants' fitness and heart health were monitored during exercise stress testing using portable and continuous electrocardiography (ECG) that records the heart's electrical activity, also known as Holter monitoring. This allowed researchers to look in detail at participants' heart health—in particular to detect irregular heartbeats, or arrhythmias, and identify whether they related to the ventricular or atrial heart muscles. Researchers grouped participants by their \"median ectopy daily burden,\" which is the average percentage of premature or early heartbeats per day. They categorized the participants into having a low or high ectopy (irregular heartbeat) burden. They found that 32% of participants had supraventricular tachycardia, 4% had atrial fibrillation and 6% had nonsustained ventriculatachycardia—all of which are complex arrhythmias. Univariate analysis revealed that \"high atrial ectopic burden\" was associated with older age, male sex, lower fitness levels, high blood pressure and a measure of reduced kidney health. High ventricular ectopic burden was associated with older age and a measure of reduced kidney health—but was not related to fitness levels. Multivariable analysis confirmed that older age and lower fitness levels were strong, independent risk factors for atrial ectopy burden. The researchers found that the chance of arrhythmia increased by 9% per year for atrial and 4% per year for ventricular arrhythmia. Age-stratified analysis demonstrated a marked rise in arrhythmia prevalence starting from the 50–54 age group. \"Our findings suggest that risk of arrhythmia begins to increase well before typical retirement age. They strongly support the need to screen older adults for arrhythmias, beginning at around age 50, to allow for timely intervention and improved long-term outcomes,\" Dr. Moses said. Atrial and ventricular arrhythmias are commonly observed in healthy individuals and were often considered harmless. However, it is now thought that a higher burden of irregular heartbeats, or ectopy, might be a precursor of heart disease. As a result, there is a need to find new ways to identify risk factors in healthy individuals where interventions may address long-term risks. Dr. Moses noted that more research is needed to confirm these findings. \"As this is an observational study, we need to be careful about drawing conclusions about causation, and it is also important to note that this study was conducted in a population that was not very diverse, particularly with regard to gender. \"Future research will be needed to tell us whether it is possible to intervene early to reduce the risk of arrhythmias using lifestyle changes, exercise programs or pharmacological treatments.\" More information: Abstract: Aging and arrhythmias: identifying early risk factors in healthy individuals. Provided by European Society of Cardiology Citation : Older age and low fitness levels associated with heartbeat abnormalities that increase future cardiovascular risk (2025, August 27) retrieved 27 August 2025 from https://medicalxpress.com/news/2025-08-older-age-heartbeat-abnormalities-future.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
    "reactions": [
      "Latest update from Medical Xpress – Health",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "f75f8082b7d1078586b5bbca74b2ce4b",
    "title": "Study reveals beneficial effects of diet and exercise on alcohol-related adverse liver health",
    "source": "https://medicalxpress.com/news/2025-08-reveals-beneficial-effects-diet-alcohol.html",
    "generatedAt": "2025-08-27T11:29:10.510Z",
    "publishedAt": "2025-08-27T04:10:01.000Z",
    "feedName": "Medical Xpress – Health",
    "author": "Medical Xpress – Health",
    "category": "Health",
    "essence": "August 27, 2025 The GIST Study reveals beneficial effects of diet and exercise on alcohol-related adverse liver health by Elsevier edited by Stephanie Baum , reviewed by Robert Egan Stephanie Baum scientific editor Meet our editorial team Behind our editorial process Robert Egan associate editor Meet our editorial team Behind our editorial process Editors' notes This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility: fact-checked trusted source proofread Healthy eating and physical activity significantly lower the sex-specific alcohol-attributable liver mortality. Credit: Journal of Hepatology (2025). DOI: 10.1016/j.jhep.2025.06.033 A novel study investigating how physical activity and diet quality interact with different levels and patterns of alcohol consumption shows that healthy eating and increased levels of physical activity significantly lower the risk of alcohol-attributable liver-related mortality. The findings from this comprehensive study in the Journal of Hepatology , use data from a large multi-ethnic US cohort and highlight the importance of considering other lifestyle behaviors when estimating the risk of death from alcohol-related liver disease at a population level. In the US, more than half (53%) of adults over 18 years of age regularly consume alcohol, and approximately 178,000 people die from excessive alcohol use each year. The risks of alcohol consumption are well documented, with strong evidence linking heavy and binge drinking to higher all-cause and cause-specific mortality (e.g., cancer, liver disease , cardiovascular disease [CVD]). Prior epidemiological studies have suggested that low-level drinking (one to two drinks per day) could be associated with lower risks of outcomes related to CVD, cancer, and liver issues. However, these findings require cautious interpretation due to residual confounding and unmeasured lifestyle behaviors that may differ substantially between nondrinkers and light-to-moderate drinkers, thereby influencing health risks. \"A significant knowledge gap exists regarding the interplay of dietary patterns and physical activity with alcohol-attributable liver-specific mortality. It is not well understood whether healthy diets or increased physical activity levels explain differences in liver-specific mortality risks between lifetime abstainers and light-to-moderate alcohol consumers,\" explains lead investigator Naga Chalasani, MD, Division of Gastroenterology and Hepatology, Department of Medicine, Indiana University School of Medicine. \"More importantly, it remains unclear whether a healthy diet and physical activity can lower liver-specific mortality in individuals engaging in high-risk alcohol consumption, such as heavy or binge drinking,\" This study analyzed data from 60,334 adults in NHANES (the US National Health and Nutrition Examination Survey) and linked these to the National Death Index, self-reported alcohol use (classified as light, moderate, or heavy drinkers based on National Institute on Alcohol Abuse and Alcoholism guidelines), the Healthy Eating Index, and information on physical activity levels. Key findings of the study include: Any amount of daily alcohol intake or binge drinking is associated with an increased risk of liver mortality. A healthy diet and increased physical activity lower the risk of liver-related death across all drinking patterns, even among heavy or binge drinkers. While women face a significantly higher risk of alcohol-related liver death than men, they also gain greater liver protection from physical activity and a healthy diet , even if they drink. A diet rich in vegetables, fruits, grains, seafood, plant-based proteins, and healthy fats, while reducing the intake of \"empty calories\" from solid fats, alcohol, and added sugars, is strongly associated with a lower risk of liver-related death. Economically disadvantaged populations are exposed to high-risk alcohol use, unhealthy diet, and physical inactivity, and therefore increased liver mortality. \"We found that adherence to high levels of physical activity and/or diet quality was associated with a lower risk of liver-related death across all drinking patterns, including 36% and 69% liver mortality risk reduction from physical activity and 86% and 84% liver mortality risk reduction from healthier eating among heavy and binge drinkers, respectively,\" says Dr. Chalasani. \"The uniqueness of our study lies in its ability to simultaneously assess the moderating effects of two important lifestyle behaviors on liver mortality risk across different levels and patterns of alcohol consumption in a representative US population, offering a more nuanced and complete view of the risks of drinking.\" More information: Healthy eating and physical activity significantly lower sex-specific alcohol-attributable liver mortality in the United States, Journal of Hepatology (2025). DOI: 10.1016/j.jhep.2025.06.033 Provided by Elsevier Citation : Study reveals beneficial effects of diet and exercise on alcohol-related adverse liver health (2025, August 27) retrieved 27 August 2025 from https://medicalxpress.com/news/2025-08-reveals-beneficial-effects-diet-alcohol.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
    "reactions": [
      "Latest update from Medical Xpress – Health",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "68b53023e21f9076b893977dc1c86427",
    "title": "The hidden DNA organizer linking fertility and cancer",
    "source": "https://www.sciencedaily.com/releases/2025/08/250826005229.htm",
    "generatedAt": "2025-08-27T11:29:07.918Z",
    "publishedAt": "2025-08-27T03:06:39.000Z",
    "feedName": "ScienceDaily Health",
    "author": "ScienceDaily Health",
    "category": "General",
    "essence": "Science News from research organizations The hidden DNA organizer linking fertility and cancer Date: August 26, 2025 Source: Institute for the Advanced Study of Human Biology (ASHBi), Kyoto University Summary: Scientists at Kyoto University have uncovered a hidden protein complex that organizes DNA in sperm stem cells, a discovery that reveals surprising ties between fertility and cancer. When this protein, called STAG3, is missing, sperm stem cells cannot mature properly, leading to infertility in mice. Even more intriguing, the same protein is found in high levels in certain immune cells and cancers, and blocking it slowed tumor growth in the lab. Share: Facebook Twitter Pinterest LinkedIN Email FULL STORY Researchers uncovered STAG3, a secret DNA organizer tied to both sperm production and cancer growth — a surprising double role with big medical potential. Credit: Shutterstock A research team at Kyoto University has discovered STAG3-cohesin, a new mitotic cohesin complex that helps establish the unique DNA architecture of spermaotogonial stem cells (SSCs), the stem cells that give rise to sperm. This \"DNA organizer\" is crucial for sperm production in mice: without STAG3, SSCs cannot differentiate properly, leading to a fertility problem. In humans, the researchers found that STAG3 is highly expressed in immune B cells and in B-cell lymphomas (a type of blood cancer), and blocking it slowed the growth of these cells. This discovery might open the door to new strategies for treating infertility and certain cancers. This research is led by Prof. Mitinori Saitou, Director/Principal Investigator at the Institute for the Advanced Study of Human Biology (WPI-ASHBi), Kyoto University (also Professor at the Graduate School of Medicine), Dr. Masahiro Nagano (then Assistant Professor at the Graduate School of Medicine, currently Research Fellow at ASHBi and Postdoctoral Researcher at the Massachusetts Institute of Technology), and Dr. Bo Hu (then Ph.D. student, currently Research Fellow at ASHBi). The results of this study will be published online in Nature Structural & Molecular Biology at 10:00 am GMT (6:00 pm Japan Standard Time) on August 25, 2025. Background Our bodies contain many different types of cells, yet they all contain the same DNA. What makes each cell type unique is how this DNA is modified, packaged, folded, and organized. Think of DNA as a very long piece of string. Inside every nucleus, about two meters of this DNA string must be folded and stored in a space smaller than the width of a human hair. This folding is highly organized, with special boundaries called insulation that separate different regions of DNA and control which genes are turned on or off. Ring-shaped protein complexes called cohesins serve as the key players that create these boundaries. Cohesin complexes were previously thought to exist in two main forms: mitotic cohesins (contain STAG1 or STAG2 together with RAD21) and meiotic cohesins (contain STAG3 together with REC8 or RAD21L). Germ cells are unique because they pass DNA to the next generation, and they undergo major changes in DNA folding during development. These cells undergo massive reorganization of their DNA packaging during development. Notably, SSCs have a unique way of organizing their DNA with unusually weak boundaries, but scientists do not yet understand how this happens. Key findings Because cohesin complexes contribute to DNA boundaries, and SSCs are mitotically dividing cells before entering meiosis, the research team decided to map where different cohesin proteins were located in SSCs cultured in vitro, and which proteins were present at each site. They found that RAD21, which normally partners with STAG1 or STAG2 in dividing cells, was instead partnering with STAG3. This protein was previously thought to function only during meiosis. Using immunoprecipitation-mass spectrometry (a technique that identifies which proteins stick together), they confirmed that RAD21 and STAG3 form a complex, revealing a new type of cohesin, which they referred to as STAG3-cohesin. To find out what this new complex does, the researchers created two types of genetically modified SSCs in vitro: one set completely lacked STAG3, while the other contained only STAG3 (without STAG1 or STAG2). They discovered that STAG3-cohesin is responsible for the unusually weak DNA boundaries in SSCs. Most importantly, in mice missing STAG3, the SSCs could not progress from their stem-cell state to the next stage of sperm development in an efficient manner. This led to a fertility problem, showing that STAG3-cohesin does more than organize DNA and is critical for proper germ cell development. As STAG3 functions in mitotically dividing cells, the team then investigated whether it might also function in other human cell types. By analyzing large datasets of all human cell types, they found that STAG3 is highly expressed in immune B cells and in B-cell lymphomas, a type of blood cancer. Interestingly, blocking STAG3 caused these lymphoma cells to grow much more slowly in laboratory studies, suggesting that STAG3 could be explored as a possible target for future cancer research. Outlook This study has revealed STAG3-cohesin as a new type of DNA-organizing protein complex that works very differently from previously known complexes. Because of its unique properties, further research on this complex is expected to advance our understanding of how gene activity is controlled through DNA organization. One of the most striking discoveries was that simply changing STAG3 levels could alter the proportion of stem cells in the testis. This suggests a novel mechanism that regulates the SSC state at the boundary between normal cell division and the start of meiosis. Beyond germ cells, the discovery that blocking STAG3 slows the growth of B-cell cancers points to a possible role for STAG3 in future cancer research. Although more research is needed to uncover the precise mechanisms, these findings offer new insights that could advance stem cell biology, reproductive medicine, and cancer treatment. Glossary Spermatogonial stem cells (SSCs): The stem cells in the testis that self-renew and also differentiate to give rise to sperm. Mitosis : The process by which a cell produces identical copies of itself, resulting in daughter cells with the same genetic information. Meiosis : A specialized form of division unique to germ cells, through which sperm or eggs are generated. Insulation: The \"boundaries\" within the 3D structure of DNA. They prevent enhancers (DNA elements that help turn genes on) from influencing genes across the boundary, effectively dividing the genome into separate functional regions. B cells: Immune cells that play a central role in antibody production within the immune system. Cohesin complex: A ring-shaped protein complex that holds chromatids together and helps organize DNA into loops essential for gene regulation and mitosis. RELATED TOPICS Health & Medicine Fertility Lymphoma Diseases and Conditions Pregnancy and Childbirth Personalized Medicine Genes Pharmacology Human Biology RELATED TERMS Cancer Adult stem cell Embryonic stem cell Monoclonal antibody therapy Stem cell DNA Telomere Immune system Story Source: Materials provided by Institute for the Advanced Study of Human Biology (ASHBi), Kyoto University . Note: Content may be edited for style and length. Journal Reference : Masahiro Nagano, Bo Hu, Kosuke Ogata, Fumiya Umemura, Yukiko Ishikura, Shinnosuke Suzuki, Christos C. Katsifis, Masanori Yoshinaga, Gabriele Litos, Kota Nagasaka, Wen Tang, Yoshiaki Nosaka, Hiromichi Sasada, Hanbo Wang, Daichi Kondo, Yoshitaka Katou, Ken Mizuta, Yukihiro Yabuta, Hiroshi Ohta, Francisca Nathalia de Luna Vitorino, Hiroshi Arima, Takafumi Ichikawa, Michele Gabriele, Jacek Majewski, Benjamin A. Garcia, Osamu Takeuchi, Shosei Yoshida, Anders S. Hansen, Jan-Michael Peters, Yasushi Ishihama, Mitinori Saitou. The mitotic STAG3–cohesin complex shapes male germline nucleome . Nature Structural , 2025; DOI: 10.1038/s41594-025-01647-w Cite This Page : MLA APA Chicago Institute for the Advanced Study of Human Biology (ASHBi), Kyoto University. \"The hidden DNA organizer linking fertility and cancer.\" ScienceDaily. ScienceDaily, 26 August 2025. <www.sciencedaily.com / releases / 2025 / 08 / 250826005229.htm>. Institute for the Advanced Study of Human Biology (ASHBi), Kyoto University. (2025, August 26). The hidden DNA organizer linking fertility and cancer. ScienceDaily . Retrieved August 26, 2025 from www.sciencedaily.com / releases / 2025 / 08 / 250826005229.htm Institute for the Advanced Study of Human Biology (ASHBi), Kyoto University. \"The hidden DNA organizer linking fertility and cancer.\" ScienceDaily. www.sciencedaily.com / releases / 2025 / 08 / 250826005229.htm (accessed August 26, 2025). Explore More from ScienceDaily RELATED STORIES Multi-Target Approach Counters Tumor Growth in Several Cancers Jan. 16, 2025  The tissue adjacent to a tumor behaves differently than areas farther away: The tumor's cancerous cells influence their surroundings, blocking the body's immune defenses and creating a sort ... Infertility: Sperm Need a Breakthrough for Fertilization Jan. 8, 2024  A new study identifies the defective function of CatSper, an ion channel controlling calcium levels in sperm, as a common cause of seemingly unexplained male infertility. CatSper-deficient human ... Cancer's Sweet Achilles Heel Oct. 25, 2023  A high expression of the enzyme beta1,4-galactosyltransferase-3, or B4GALT3 is associated with noticeably shortened survival rates in several types of immunotherapy cancersdeficiency in mice TIME ... Artificial DNA Kills Cancer Dec. 21, 2022  Researchers have used artificial DNA to target and kill cancer cells in a completely new way. The method was effective in lab tests against human cervical cancer- and breast cancer-derived cells, and ... Device Directs Sperm to &lsquo;go Against the Flow&rsquo; to Help Infertility Mar. 31, 2022  Out of about 100 million sperm, only a few hundred make it to the fallopian tubes. A directional movement called rheotaxis, guides sperm cells to swim against the cervical mucus flow to reach the egg ... Break Through the Tumor&rsquo;s Protective Shield Oct. 12, 2021  The immune system protects the body from cancer. To protect healthy body cells from its own immune system, they have developed a protective shield: the protein CD47 is a so called 'don't ... TRENDING AT SCITECHDAILY.com After 60 Years, Scientists Uncover Hidden Brain Pathway Behind Diabetes Drug Metformin No Pills, No Surgery: Scientists Discover Simple Way To Relieve Arthritis Pain Challenging Over 150 Years of Immunotherapy: Scientists Unveil New Weapon That Kills Cancer Without the Immune System Superfood for Bees Sparks 15-Fold Colony Boom",
    "reactions": [
      "Latest update from ScienceDaily Health",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "7c2b3a0804c968a699c9e6d39610eae5",
    "title": "People without health insurance are less likely to obtain life-saving hospital transfers, analysis finds",
    "source": "https://medicalxpress.com/news/2025-08-people-health-life-hospital-analysis.html",
    "generatedAt": "2025-08-27T11:29:10.647Z",
    "publishedAt": "2025-08-26T20:48:03.000Z",
    "feedName": "Medical Xpress – Health",
    "author": "Medical Xpress – Health",
    "category": "Health",
    "essence": "August 26, 2025 The GIST People without health insurance are less likely to obtain life-saving hospital transfers, analysis finds by University of Michigan edited by Stephanie Baum , reviewed by Robert Egan Stephanie Baum scientific editor Meet our editorial team Behind our editorial process Robert Egan associate editor Meet our editorial team Behind our editorial process Editors' notes This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility: fact-checked peer-reviewed publication trusted source proofread Credit: Pixabay/CC0 Public Domain Does insurance play a role in which critically ill patients live or die? The unfortunate answer may be yes, due in part to a difference in the rate of inter-hospital transfer, according to new research from the University of Michigan. The work is published in the journal JAMA Network Open . The research team, led by Emily Harlan, M.D. and Thomas Valley, M.D. of the Division of Pulmonary and Critical Care Medicine, examined the factors that determined which critically ill patients with acute respiratory failure were transferred to high-volume specialty hospitals for treatment. Care in such hospitals is associated with a lower risk of death for patients on a ventilator. \"We were motivated to do this study because there are times that as doctors, we get a call from an outside hospital asking us to accept a patient for transfer to our ICU. We'll accept a patient, but then we're told that the patient's insurance needs to be reviewed first. We wanted to see if those experiences were unique to us,\" noted Valley. \"There are laws in place to ensure that anyone who needs emergency care is stabilized and admitted to the hospital. But those laws tend to end there. If a patient needs more advanced treatments at another hospital, there is nothing that requires hospitals to accept those patients for transfer—that's where factors like a patient's insurance might play a role.\" The researchers looked at data from more than 700,000 patients from throughout the U.S. who were critically ill and on ventilators between 2017 and 2021. Over half were insured through Medicare, 19% through Medicaid, 18% through commercial insurance and 6% were uninsured. After controlling for patient characteristics, such as age, sex, chronic illnesses , severity of illness and the year they were admitted (to account for the COVID-19 pandemic), the team discovered that around 4% of patients underwent inter-hospital transfer and 37% of patients died or were discharged to hospice. The odds of transfer for patients without insurance were nearly half that of patients with commercial insurance. Patients with Medicare or Medicaid were also less likely to receive inter-hospital transfer than those with commercial insurance. Patients without insurance or with Medicare or Medicaid were also transferred later during their hospital stays than patients with commercial insurance. Furthermore, patients without insurance had significantly higher odds of death relative to patients with commercial insurance. This study adds to the growing body of evidence of a relationship between insurance status and inter-hospital transfer for serious health conditions. \"We need to further evaluate how hospitals make decisions to transfer patients to ensure transfer decisions are made equitably,\" said Harlan. More information: Emily A. Harlan et al, Health Insurance and Interhospital Transfer for Critically Ill Patients With Respiratory Failure, JAMA Network Open (2025). DOI: 10.1001/jamanetworkopen.2025.28889 Journal information: JAMA Network Open Provided by University of Michigan Citation : People without health insurance are less likely to obtain life-saving hospital transfers, analysis finds (2025, August 26) retrieved 27 August 2025 from https://medicalxpress.com/news/2025-08-people-health-life-hospital-analysis.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
    "reactions": [
      "Latest update from Medical Xpress – Health",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "c1d701da309d4bca64a80a49f60cf37c",
    "title": "The experts' guide to safely pumping, storing and thawing breast milk",
    "source": "https://medicalxpress.com/news/2025-08-experts-safely-breast.html",
    "generatedAt": "2025-08-27T11:29:10.784Z",
    "publishedAt": "2025-08-26T19:39:10.000Z",
    "feedName": "Medical Xpress – Health",
    "author": "Medical Xpress – Health",
    "category": "Health",
    "essence": "August 26, 2025 The GIST The experts' guide to safely pumping, storing and thawing breast milk by I. Edwards edited by Stephanie Baum , reviewed by Andrew Zinin Stephanie Baum scientific editor Meet our editorial team Behind our editorial process Andrew Zinin lead editor Meet our editorial team Behind our editorial process Editors' notes This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility: fact-checked reputable news agency proofread Breastfeeding offers many benefits, from emotional bonding to better nutrition and immune support. But for parents who need to pump and store breast milk, handling it safely is key. \"Parents often feel nervous about food safety when handling and storing their breast milk ,\" said Dr. Patricia Campbell, a pediatrician and lactation consultant at Children's Hospital Los Angeles. \"Thankfully,\" she added in a news release, \"Scientific organizations like the Centers for Disease Control and Prevention (CDC) help to provide straightforward guidance that anyone can access.\" Here's what experts recommend for pumping, storing, and thawing breast milk safely: Wash your hands before pumping. If soap and water aren't available, use hand sanitizer with at least 60% alcohol. Use clean, food-grade containers or breast milk storage bags. Avoid using food bags or bottle liners. Label each container with the date it was pumped and your baby's name if sending milk to childcare. Don't reuse storage bags—they're single-use only. Clean and sanitize bottles after every use. Keep fresh and frozen milk separate—never mix them. Discard leftover milk after feeding instead of reheating it later. To store breast milk safely, follow these guidelines from Children's Hospital Los Angeles: Room temperature: Up to 77°F (25°C) for up to 4 hours Cooler with ice packs: Up to 24 hours Refrigerator (fresh or thawed milk): 40°F (4°C) for up to 48 hours Home freezer (attached to a fridge): 0°F (-18°C) for up to 3 months Deep freezer: -4°F (-20°C) for 6 to 12 months Once thawed, breast milk should be used within 24 hours and never refrozen. The best way to thaw breast milk is to place it in the refrigerator or swirl the container in a bowl of warm water. Avoid boiling water or microwaves, which can overheat the milk and damage nutrients. More information: The U.S. Centers for Disease Control and Prevention has more on breast milk storage and prep . 2025 HealthDay. All rights reserved. Citation : The experts' guide to safely pumping, storing and thawing breast milk (2025, August 26) retrieved 27 August 2025 from https://medicalxpress.com/news/2025-08-experts-safely-breast.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
    "reactions": [
      "Latest update from Medical Xpress – Health",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "1881537c57a767923c367e8666e17e0d",
    "title": "BPA replacements in food packaging may disrupt key ovarian cell functions",
    "source": "https://medicalxpress.com/news/2025-08-bpa-food-packaging-disrupt-key.html",
    "generatedAt": "2025-08-27T11:29:10.912Z",
    "publishedAt": "2025-08-26T19:13:03.000Z",
    "feedName": "Medical Xpress – Health",
    "author": "Medical Xpress – Health",
    "category": "Health",
    "essence": "August 26, 2025 The GIST BPA replacements in food packaging may disrupt key ovarian cell functions by McGill University edited by Gaby Clark , reviewed by Robert Egan Gaby Clark scientific editor Meet our editorial team Behind our editorial process Robert Egan associate editor Meet our editorial team Behind our editorial process Editors' notes This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility: fact-checked peer-reviewed publication trusted source proofread Effects of BPS and alternative color developers on lipid droplets in KGN cells. Credit: Toxicological Sciences (2025). DOI: 10.1093/toxsci/kfaf096 Chemicals used to replace bisphenol A (BPA) in food packaging can trigger potentially harmful effects in human ovarian cells, according to McGill University researchers. A new study examined several chemicals commonly used in price stickers on packaged meat, fish, cheese and produce and found early signs of potential toxicity. The findings, published in the journal Toxicological Sciences , raise concerns about the safety of BPA-free packaging and whether current regulations go far enough to protect consumers. BPA substitutes disrupt gene expression The research began with the 2023 discovery by Stéphane Bayen, Associate Professor in McGill's Department of Food Science and Agricultural Chemistry, that label-printing chemicals like bisphenol S (BPS), a BPA replacement, were leaching through plastic wrap into the food. He teamed up with colleagues in reproductive toxicology to investigate what these substances could be doing inside the body. Lab-grown human ovarian cells were exposed to four commonly used BPA substitutes: TGSA, D-8, PF-201 and BPS. Several of the chemicals, particularly TGSA and D-8, caused a buildup of fat droplets in the cells and changed the activity of genes that help cells grow and repair their DNA. \"These are major cellular functions,\" said Bernard Robaire, co-senior author of the study and James McGill Professor in McGill's Departments of Pharmacology & Therapeutics and Obstetrics & Gynecology. \"Disrupting them doesn't prove harm in humans, but it gives us a strong signal that these chemicals should be further investigated.\" Unregulated replacements under the radar BPA is a chemical that can interfere with the body's hormones, and has been linked to problems with fertility, early development and metabolism. Because of these risks, it has been banned in baby bottles and restricted in some products in Canada. Many of the chemicals used to replace BPA are not regulated or routinely tested, the researchers explained. \"'BPA-free' is an incredibly misleading label,\" said Robaire. \"It usually means one bisphenol has been swapped for another, and there are more than 200 of them. Some may be just as harmful, or even worse. We need to test these compounds before they're widely adopted, not after.\" Health Canada has now added all four substances to a list of chemicals requiring further investigation. For consumers looking to err on the side of caution, Robaire suggests removing labels and plastic wrap from fresh foods before storing. He also recommends choosing items from the top of store display piles rather than the bottom, where pressure from stacking may push chemicals more deeply into the packaging and food. More information: Lama Iskandarani et al, High-content imaging and transcriptomic analyses of the effects of bisphenol S and alternative color developers on KGN granulosa cells, Toxicological Sciences (2025). DOI: 10.1093/toxsci/kfaf096 Journal information: Toxicological Sciences Provided by McGill University Citation : BPA replacements in food packaging may disrupt key ovarian cell functions (2025, August 26) retrieved 27 August 2025 from https://medicalxpress.com/news/2025-08-bpa-food-packaging-disrupt-key.html This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.",
    "reactions": [
      "Latest update from Medical Xpress – Health",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "14e1d02736e60a384472904f015a93f6",
    "title": "Scientists crack indole’s toughest bond with copper, unlocking new medicines",
    "source": "https://www.sciencedaily.com/releases/2025/08/250826005224.htm",
    "generatedAt": "2025-08-27T11:29:08.305Z",
    "publishedAt": "2025-08-26T13:38:36.000Z",
    "feedName": "ScienceDaily Health",
    "author": "ScienceDaily Health",
    "category": "General",
    "essence": "Science News from research organizations Scientists crack indole&rsquo;s toughest bond with copper, unlocking new medicines A cost-effective copper-catalyzed reaction enables selective modification at the C5 position of the indole ring, a backbone for pharmaceutical compounds. Date: August 26, 2025 Source: Chiba University Summary: Scientists have cracked one of chemistry&rsquo;s toughest challenges with indoles, using copper to unlock a spot once thought too stubborn to change. The discovery could pave the way for easier, cheaper drug development. Share: Facebook Twitter Pinterest LinkedIN Email FULL STORY By using highly reactive carbenes and a copper–silver catalyst system, researchers have developed a method to selectively attach alkyl groups to the C5 position of indoles, which are found in bioactive compounds and are considered valuable building blocks for drug development. Credit: OLCF (CC BY 2.0) Indole, a molecule made up of a six-membered benzene ring fused to a five-membered ring containing nitrogen, forms the core structure of many biologically active compounds. Derivatives of indole, where hydrogen atoms are replaced by various chemical groups, are naturally produced by plants, fungi, and even the human body. Due to their properties, indoles have gained attention as a backbone for synthesizing a wide variety of drugs. Since 2015, the U.S. Food and Drug Administration has approved 14 indole drugs to treat conditions, such as migraines, infections, and hypertension. Chemists have developed many strategies to attach different chemical groups to indoles. Some approaches introduce new groups directly onto the ring, while others involve temporary structural changes through intermediates. However, modifying specific positions on the indole ring, such as the C5 carbon, remains a challenge due to its low reactivity. In a recent study, researchers at Chiba University, Japan, reported a method for selectively attaching an alkyl group to the C5 position of indole using a relatively inexpensive copper-based catalyst, which produced the desired product in yields of up to 91%. This method offers a more affordable and scalable approach for modifying indoles, which could be especially valuable in drug development. The study, led by Associate Professor Shingo Harada, included Mr. Tomohiro Isono, B.Pharm., Ms. Mai Yanagawa, M.Pharm., and Professor Tetsuhiro Nemoto from the Graduate School of Pharmaceutical Sciences at Chiba University, and was published online in the journal Chemical Science . \"We developed a direct, regioselective C5-H functionalization reaction of indoles under copper catalysis. The resulting compounds contain structural features commonly found in natural indole alkaloids and drug molecules, highlighting the usefulness of this approach for making biologically important compounds,\" says Dr. Harada. The reaction uses carbenes, highly reactive carbon species that can form new carbon-carbon bonds. In an earlier study, the team used rhodium-based carbenes to attach groups at the C4 position of indole, guided by unsaturated enone groups placed at the 3-position. In this study, they used a similar strategy but altered the reaction conditions to target the C5 position instead. They tested the reaction using a model compound, N-benzyl indole with an enone group, together with dimethyl &alpha;-diazomalonates as the carbene source and different combinations of rhodium, copper, and silver salts as catalysts. Initially, the desired C5-functionalized product formed only in small amounts, with yields up to 18%. However, when they used a combination of copper and silver salts (Cu(OAc) 2 &middot;H 2 O and AgSbF 6 ), the yield rose to 62%. Upon carrying out further optimizations, such as adjusting the solvent volume and increasing the concentration, they improved the yield to 77%. The reaction proved to be highly versatile, working with a wide range of indoles. When the enone group was replaced at the 3-position with a benzoyl group, the yield increased to 91%. Successful reactions were also observed with indoles bearing other substituents, such as methoxybenzyl, allyl, and phenyl groups, opening the door to the synthesis of structurally diverse molecules. To uncover the reaction mechanism, the team carried out quantum chemical calculations, which suggested that the carbene does not react directly at C5. Instead, it first forms a bond at the C4 position, creating a strained three-membered ring. This intermediate then rearranges, shifting the new bond to the C5 position. The copper catalyst plays a critical role in making this pathway possible by stabilizing the intermediate and lowering the energy barrier for the rearrangement. This copper-catalyzed strategy offers a reliable and cost-effective approach for modifying indoles at the C5 position, producing compounds that closely resemble biologically active indole-based agents. Dr. Harada highlights the method's potential for drug discovery by stating, \"While it may not cause a significant shift right away, it could foster steady progress in drug discovery, leading to a small yet beneficial long-term impact.\" The team is continuing its research, exploring other metal-carbene reactions to develop more selective and efficient strategies for constructing indole-based molecules that might one day contribute to the treatment of specific diseases. RELATED TOPICS Health & Medicine Hypertension Pharmacology Pharmaceuticals Alternative Medicine Matter & Energy Chemistry Physics Inorganic Chemistry Organic Chemistry RELATED TERMS Nanoparticle Drug discovery Antibiotic resistance Wind power Pharmaceutical company Introduction to quantum mechanics Organic chemistry Nocebo - Placebo Story Source: Materials provided by Chiba University . Note: Content may be edited for style and length. Journal Reference : Tomohiro Isono, Shingo Harada, Mai Yanagawa, Tetsuhiro Nemoto. Copper-catalyzed direct regioselective C5–H alkylation reactions of functionalized indoles with &alpha;-diazomalonates . Chemical Science , 2025; 16 (33): 14967 DOI: 10.1039/D5SC03417E Cite This Page : MLA APA Chicago Chiba University. \"Scientists crack indole&rsquo;s toughest bond with copper, unlocking new medicines.\" ScienceDaily. ScienceDaily, 26 August 2025. <www.sciencedaily.com / releases / 2025 / 08 / 250826005224.htm>. Chiba University. (2025, August 26). Scientists crack indole&rsquo;s toughest bond with copper, unlocking new medicines. ScienceDaily . Retrieved August 26, 2025 from www.sciencedaily.com / releases / 2025 / 08 / 250826005224.htm Chiba University. \"Scientists crack indole&rsquo;s toughest bond with copper, unlocking new medicines.\" ScienceDaily. www.sciencedaily.com / releases / 2025 / 08 / 250826005224.htm (accessed August 26, 2025). Explore More from ScienceDaily RELATED STORIES Scientists Reveal Gut Microbes' Hidden Role in Anxiety: Could Probiotics Be the Next Mental Health Breakthrough? Feb. 5, 2025  Could the key to easing anxiety be hidden in our gut? Scientists have discovered a crucial connection between gut microbes and anxiety-related behavior. Their research suggests that microbial ... Novel Catalysts for Improved Methanol Production Using Carbon Dioxide Dehydrogenation June 21, 2024  Encapsulating copper nanoparticles within hydrophobic porous silicate crystals has been shown to significantly enhance the catalytic activity of copper-zinc oxide catalysts used in methanol synthesis ... How Does HIV Get Into the Cell's Cenetr to Kickstart Infection? Jan. 24, 2024  UNSW Sydney medical scientists have cracked a mystery whose solution has long eluded researchers. UNSW Sydney medical scientists have cracked a mystery whose solution has long eluded ... New Strategy for Drug Design: Keeping Copper Atoms Closer to Keep Bacteria Away July 27, 2021  Hydrogen peroxide reacts with copper to produce hydroxyl radicals with strong antibacterial properties. However, this requires high copper concentrations because two copper atoms have to come close ... From Toxic Ions to Single-Atom Copper Apr. 23, 2021  Researchers offer conclusive research for understanding how bacteria found in copper mines convert toxic copper ions to stable single-atom copper. Their research demonstrates how copper-resistant ... Enantioselective Synthesis of Indole Derivatives Apr. 8, 2021  Indole, and structures derived from it, are a component of many natural substances, such as the amino acid tryptophan. A new catalytic reaction produces cyclopenta[b]indoles -- frameworks made of ... TRENDING AT SCITECHDAILY.com After 60 Years, Scientists Uncover Hidden Brain Pathway Behind Diabetes Drug Metformin No Pills, No Surgery: Scientists Discover Simple Way To Relieve Arthritis Pain Challenging Over 150 Years of Immunotherapy: Scientists Unveil New Weapon That Kills Cancer Without the Immune System Superfood for Bees Sparks 15-Fold Colony Boom",
    "reactions": [
      "Latest update from ScienceDaily Health",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "f50deadc21b28756c03802bd4c98b6ca",
    "title": "The surprising reason x-rays can push arthritis patients toward surgery",
    "source": "https://www.sciencedaily.com/releases/2025/08/250826081915.htm",
    "generatedAt": "2025-08-27T11:29:08.685Z",
    "publishedAt": "2025-08-26T13:27:09.000Z",
    "feedName": "ScienceDaily Health",
    "author": "ScienceDaily Health",
    "category": "General",
    "essence": "Science News from research organizations The surprising reason x-rays can push arthritis patients toward surgery Date: August 26, 2025 Source: The Conversation Summary: Knee osteoarthritis is a major cause of pain and disability, but routine X-rays often do more harm than good. New research shows that being shown an X-ray can increase anxiety, make people fear exercise, and lead them to believe surgery is the only option, even when less invasive treatments could help. By focusing on clinical diagnosis instead, patients may avoid unnecessary scans, reduce health costs, and make better choices about their care. Share: Facebook Twitter Pinterest LinkedIN Email FULL STORY Routine X-rays for knee pain can backfire, making patients more anxious and more likely to seek unnecessary surgery. Clinical diagnosis is safer, cheaper, and just as effective. Credit: Shutterstock Osteoarthritis is a leading cause of chronic pain and disability, affecting more than two million Australians . Routine x-rays aren&rsquo;t recommended to diagnose the condition. Instead, GPs can make a diagnosis based on symptoms and medical history. Yet nearly half of new patients with knee osteoarthritis who visit a GP in Australia are referred for imaging. Osteoarthritis imaging costs the health system A$104.7 million each year. Our new study shows using x-rays to diagnose knee osteoarthritis can affect how a person thinks about their knee pain – and can prompt them to consider potentially unnecessary knee replacement surgery. What happens when you get osteoarthritis? Osteoarthritis arises from joint changes and the joint working extra hard to repair itself. It affects the entire joint, including the bones, cartilage, ligaments and muscles. It is most common in older adults, people with a high body weight and those with a history of knee injury. Many people with knee osteoarthritis experience persistent pain and have difficulties with everyday activities such as walking and climbing stairs. How is it treated? In 2021–22, more than 53,000 Australians had knee replacement surgery for osteoarthritis. Hospital services for osteoarthritis, primarily driven by joint replacement surgery, cost $3.7 billion in 2020–21. While joint replacement surgery is often viewed as inevitable for osteoarthritis, it should only be considered for those with severe symptoms who have already tried appropriate non-surgical treatments. Surgery carries the risk of serious adverse events , such as blood clot or infection, and not everyone makes a full recovery. Most people with knee osteoarthritis can manage it effectively with: education and self-management exercise and physical activity weight management (if necessary) medicines for pain relief (such as paracetamol and non-steroidal anti-inflammatory drugs). Debunking a common misconception A common misconception is that osteoarthritis is caused by &ldquo;wear and tear&rdquo;. However, research shows the extent of structural changes seen in a joint on an x-ray does not reflect the level of pain or disability a person experiences, nor does it predict how symptoms will change. Some people with minimal joint changes have very bad symptoms, while others with more joint changes have only mild symptoms. This is why routine x-rays aren&rsquo;t recommended for diagnosing knee osteoarthritis or guiding treatment decisions. Instead, guidelines recommend a &ldquo;clinical diagnosis&rdquo; based on a person&rsquo;s age (being 45 years or over) and symptoms : experiencing joint pain with activity and, in the morning, having no joint-stiffness or stiffness that lasts less than 30 minutes. Despite this, many health professionals in Australia continue to use x-rays to diagnose knee osteoarthritis . And many people with osteoarthritis still expect or want them . What did our study investigate? Our study aimed to find out if using x-rays to diagnose knee osteoarthritis affects a person&rsquo;s beliefs about osteoarthritis management, compared to a getting a clinical diagnosis without x-rays. We recruited 617 people from across Australia and randomly assigned them to watch one of three videos. Each video showed a hypothetical consultation with a general practitioner about knee pain. One group received a clinical diagnosis of knee osteoarthritis based on age and symptoms, without being sent for an x-ray. The other two groups had x-rays to determine their diagnosis (the doctor showed one group their x-ray images and not the other). After watching their assigned video, participants completed a survey about their beliefs about osteoarthritis management. What did we find? People who received an x-ray-based diagnosis and were shown their x-ray images had a 36% higher perceived need for knee replacement surgery than those who received a clinical diagnosis (without x-ray). They also believed exercise and physical activity could be more harmful to their joint, were more worried about their condition worsening, and were more fearful of movement. Interestingly, people were slightly more satisfied with an x-ray-based diagnosis than a clinical diagnosis. This may reflect the common misconception that osteoarthritis is caused by &ldquo;wear and tear&rdquo; and an assumption that the &ldquo;damage&rdquo; inside the joint needs to be seen to guide treatment . What does this mean for people with osteoarthritis? Our findings show why it&rsquo;s important to avoid unnecessary x-rays when diagnosing knee osteoarthritis. While changing clinical practice can be challenging, reducing unnecessary x-rays could help ease patient anxiety, prevent unnecessary concern about joint damage, and reduce demand for costly and potentially unnecessary joint replacement surgery. It could also help reduce exposure to medical radiation and lower health-care costs . Previous research in osteoarthritis , as well as back and shoulder pain, similarly shows that when health professionals focus on joint &ldquo;wear and tear&rdquo; it can make patients more anxious about their condition and concerned about damaging their joints. If you have knee osteoarthritis, know that routine x-rays aren&rsquo;t needed for diagnosis or to determine the best treatment for you. Getting an x-ray can make you more concerned and more open to surgery. But there are a range of non-surgical options that could reduce pain, improve mobility and are less invasive. Written by: Belinda Lawford Senior Research Fellow in Physiotherapy, The University of Melbourne Kim Bennell Professor of Physiotherapy, The University of Melbourne Rana Hinman Professor in Physiotherapy, The University of Melbourne Travis Haber Postdoctoral Research Fellow in Physiotherapy, The University of Melbourne RELATED TOPICS Health & Medicine Arthritis Today's Healthcare Diet and Weight Loss Back and Neck Pain Science & Society Public Health Sports Religion Resource Shortage RELATED TERMS Anxiety Antibiotic resistance Fear Mental illness Cancer Workaholic Aerobic exercise Bioethics Story Source: Materials provided by The Conversation . Original written by Belinda Lawford, Kim Bennell, Rana Hinman, Travis Haber. Note: Content may be edited for style and length. Journal Reference : Belinda J. Lawford, Kim L. Bennell, Dan Ewald, Peixuan Li, Anurika De Silva, Jesse Pardo, Barbara Capewell, Michelle Hall, Travis Haber, Thorlene Egerton, Stephanie Filbay, Fiona Dobson, Rana S. Hinman. Effects of X-ray–based diagnosis and explanation of knee osteoarthritis on patient beliefs about osteoarthritis management: A randomised clinical trial . PLOS Medicine , 2025; 22 (2): e1004537 DOI: 10.1371/journal.pmed.1004537 Cite This Page : MLA APA Chicago The Conversation. \"The surprising reason x-rays can push arthritis patients toward surgery.\" ScienceDaily. ScienceDaily, 26 August 2025. <www.sciencedaily.com / releases / 2025 / 08 / 250826081915.htm>. The Conversation. (2025, August 26). The surprising reason x-rays can push arthritis patients toward surgery. ScienceDaily . Retrieved August 26, 2025 from www.sciencedaily.com / releases / 2025 / 08 / 250826081915.htm The Conversation. \"The surprising reason x-rays can push arthritis patients toward surgery.\" ScienceDaily. www.sciencedaily.com / releases / 2025 / 08 / 250826081915.htm (accessed August 26, 2025). Explore More from ScienceDaily RELATED STORIES Toward Better Surgical Outcomes in Patients Undergoing Knee Replacement Surgery Nov. 5, 2024  When performing a knee replacement surgery or total knee arthroplasty, doctors traditionally try to align the hip, knee, and ankle in a straight line, forming a neutral alignment, rather than ... Pharmacists Prove Effective, Less Costly Care Option for Minor Illnesses May 28, 2024  Greater use of pharmacists to treat minor illnesses could potentially save millions of dollars in health care costs, according to new research. The findings also indicate a way to improve healthcare ... Artificial Intelligence Searches an Early Sign of Osteoarthritis from an X-Ray Image Dec. 15, 2022  Researchers have developed an AI based neural network to detect an early knee osteoarthritis from x-ray images. AI was able to match a doctors' diagnosis in 87% of cases. The result is important ... Quarter of Former Olympians Suffer from Osteoarthritis Nov. 23, 2022  Competing at elite level in sport is linked with an increased risk of developing osteoarthritis and joint pain in later life, a study suggests. One in four retired Olympians reported a diagnosis of ... Walking Towards Healthier Knees June 8, 2022  A new study reveals that walking for exercise can reduce new frequent knee pain among people age 50 and older diagnosed with knee osteoarthritis, the most common form of arthritis. Additionally, ... Stroke Treatments Safe and Effective for People With Existing Disability or Dementia, Study Suggests Mar. 28, 2022  A research review found that clot-busting therapy and mechanical clot removal to treat ischemic stroke in people with a pre-existing disability or dementia was as safe and effective as in adults ... TRENDING AT SCITECHDAILY.com After 60 Years, Scientists Uncover Hidden Brain Pathway Behind Diabetes Drug Metformin No Pills, No Surgery: Scientists Discover Simple Way To Relieve Arthritis Pain Challenging Over 150 Years of Immunotherapy: Scientists Unveil New Weapon That Kills Cancer Without the Immune System Superfood for Bees Sparks 15-Fold Colony Boom",
    "reactions": [
      "Latest update from ScienceDaily Health",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "aaf17360aac2e22111c6086d91b01db6",
    "title": "The common cold’s unexpected superpower against COVID",
    "source": "https://www.sciencedaily.com/releases/2025/08/250826005217.htm",
    "generatedAt": "2025-08-27T11:29:08.955Z",
    "publishedAt": "2025-08-26T08:54:56.000Z",
    "feedName": "ScienceDaily Health",
    "author": "ScienceDaily Health",
    "category": "General",
    "essence": "Science News from research organizations The common cold&rsquo;s unexpected superpower against COVID Date: August 26, 2025 Source: National Jewish Health Summary: A nationwide study found that recent colds caused by rhinoviruses can give short-term protection against COVID-19. Children benefit most, as their immune systems react strongly with antiviral defenses, helping explain their lower rates of severe illness. Share: Facebook Twitter Pinterest LinkedIN Email FULL STORY Recent colds may boost the immune system&rsquo;s defenses, making it harder for COVID-19 to take hold, especially in children. Credit: Shutterstock A new study led by researchers at National Jewish Health has found that recent infection with the common cold -- often caused by rhinoviruses -- may offer temporary protection against infection with SARS-CoV-2, the virus that causes COVID-19. The research provides fresh insight into why children are less likely than adults to develop symptoms and could point toward new ways to reduce the severity of respiratory illnesses. Published in the Journal of Infectious Diseases earlier this month, the study analyzed data from the nationwide Human Epidemiology and Response to SARS-CoV-2 (HEROS) study, which tracked more than 4,100 people in 1,394 households from May 2020 to February 2021. Researchers found that people, particularly children who had a recent rhinovirus infection, were significantly less likely to become infected with SARS-CoV-2 in the following weeks. This effect is thought to be linked to the body's antiviral defenses. Rhinoviruses trigger a strong interferon response in the airways, which can temporarily prime the immune system to fight off other viruses. \"Our findings suggest that the immune boost from a recent cold may give the body an early advantage in fighting SARS-CoV-2 before it has a chance to take hold,\" said senior author of the study Max Seibold, PhD, a researcher and Director of the Regenerative Medicine and Genome Editing Program (REGEN) at National Jewish Health. \"This may help explain why children, who tend to get more colds than adults, generally experience fewer and less severe COVID cases.\" Using thousands of self-collected nasal swabs, the team tested for both SARS-CoV-2 and other common respiratory viruses, including rhinovirus, in participants of all ages. They also analyzed airway gene expression to see how recent viral infections influenced the body's antiviral defenses. Children were found to have higher baseline expression of interferon-related genes -- proteins that act as the immune system's first line of defense against viruses -- compared to adults. While this phenomenon, known as heterologous viral interference, has been observed with other respiratory viruses, this is the first prospective study to show it may also occur with SARS-CoV-2. \"This doesn't mean people should intentionally try to catch a cold,\" said Camille Moore, PhD and lead author of the study at National Jewish Health. \"But understanding how one virus can affect the body's response to another could help us develop new prevention strategies, especially for vulnerable populations.\" The research builds on earlier findings from the HEROS study showing that children are six times less likely than adults to develop symptomatic COVID. The new data highlights the role that both age-related immune differences and recent viral exposures may play in that protection. National Jewish Health researchers conducted the study in collaboration with partners from 12 cities across the United States. RELATED TOPICS Health & Medicine Infectious Diseases Healthy Aging HIV and AIDS Cold and Flu Viruses Diseases and Conditions Personalized Medicine Alternative Medicine RELATED TERMS Immune system Psychopathology Antiviral drug Pathogen Antibiotic resistance Monoclonal antibody therapy Cancer Hurricane Katrina Story Source: Materials provided by National Jewish Health . Note: Content may be edited for style and length. Journal Reference : Camille M Moore, Elizabeth A Secor, Jamie L Everman, Ana Fairbanks-Mahnke, Nathan Jackson, Elmar Pruesse, Katrina Diener, Andrew Morin, Samuel J Arbes, Leonard B Bacharier, Casper G Bendixsen, Agustin Calatroni, William D Dupont, Glenn T Furuta, Tebeb Gebretsadik, Rebecca S Gruchalla, Ruchi S Gupta, Gurjit K Khurana Hershey, Meyer Kattan, Andrew H Liu, Stephanie J Lussier, Liza Bronner Murrison, Mari Numata, George T O&rsquo;Connor, Katherine Rivera-Spoljaric, Wanda Phipatanakul, Marc E Rothenberg, Christine M Seroogy, Edward M Zoratti, Sharon Castina, Daniel J Jackson, Carlos A Camargo, Christine C Johnson, Rachel Ethridge, Sima Ramratnam, Lia Stelzig, Stephen J Teach, Alkis G Togias, Patricia C Fulkerson, Tina V Hartert, Max A Seibold. The Common Cold Is Associated With Protection From SARS-CoV-2 Infections . The Journal of Infectious Diseases , 2025; DOI: 10.1093/infdis/jiaf374 Cite This Page : MLA APA Chicago National Jewish Health. \"The common cold&rsquo;s unexpected superpower against COVID.\" ScienceDaily. ScienceDaily, 26 August 2025. <www.sciencedaily.com / releases / 2025 / 08 / 250826005217.htm>. National Jewish Health. (2025, August 26). The common cold&rsquo;s unexpected superpower against COVID. ScienceDaily . Retrieved August 26, 2025 from www.sciencedaily.com / releases / 2025 / 08 / 250826005217.htm National Jewish Health. \"The common cold&rsquo;s unexpected superpower against COVID.\" ScienceDaily. www.sciencedaily.com / releases / 2025 / 08 / 250826005217.htm (accessed August 26, 2025). Explore More from ScienceDaily RELATED STORIES New Study Offers Insights Into Designing Safe, Effective Nasal Vaccines May 14, 2025  Most vaccines -- and boosters -- are injected directly into muscle tissue, usually in the upper arm, to kickstart the body's immune system in the fight against disease. But for respiratory ... Latest Booster Reduces Adults' Risk of Moderate or Severe COVID by More Than Half Mar. 1, 2024  The most recent COVID-19 booster shot reduces adults' risk of moderate or severe COVID by more than half, according to a new nationwide data study from September 2023 through January 2024, a ... One of the Coronaviruses Causing Common Colds Boosts Immune Response to COVID-19 in Children, Study Finds Mar. 14, 2023  During the pandemic, it became clear that children who contracted COVID-19 became less ill than adults. One hypothesis has been that common colds would give children immunity protecting against a ... Vaccines Are Effective in Preventing COVID-19-Related Emergency Department and Urgent Care Visits for Both Children and Adolescents Mar. 1, 2022  A new study shows that two doses of an mRNA vaccine provide protection against COVID-19 associated emergency department and urgent care visits among children ages 5 to 11. The study also finds that ... Novel Synthetic Process for the Core Structure of the Fungal Antiviral Agent Neoechinulin B and Its Derivatives Feb. 9, 2022  The fungus-derived compound neoechinulin B demonstrates promising antiviral activity. To realize its potential as an antiviral agent, however, a viable method for preparing more potent derivatives ... Common Cold Jumpstarts Defense Against Influenza Sep. 6, 2020  As the flu season approaches, a strained public health system may have a surprising ally -- the common cold virus. Rhinovirus, the most frequent cause of common colds, can prevent the flu virus from ... TRENDING AT SCITECHDAILY.com After 60 Years, Scientists Uncover Hidden Brain Pathway Behind Diabetes Drug Metformin No Pills, No Surgery: Scientists Discover Simple Way To Relieve Arthritis Pain Challenging Over 150 Years of Immunotherapy: Scientists Unveil New Weapon That Kills Cancer Without the Immune System Superfood for Bees Sparks 15-Fold Colony Boom",
    "reactions": [
      "Latest update from ScienceDaily Health",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  },
  {
    "id": "9695dc96f1cf8e5b1646089a6397359b",
    "title": "9 in 10 Australian Teachers Are Stressed to Breaking Point",
    "source": "https://www.sciencedaily.com/releases/2025/08/250826005215.htm",
    "generatedAt": "2025-08-27T11:29:09.215Z",
    "publishedAt": "2025-08-26T08:08:13.000Z",
    "feedName": "ScienceDaily Health",
    "author": "ScienceDaily Health",
    "category": "General",
    "essence": "Science News from research organizations 9 in 10 Australian Teachers Are Stressed to Breaking Point Nine out of 10 Australian teachers are experiencing severe stress, and nearly 70% say their workload is unmanageable, says UNSW Sydney research. Date: August 26, 2025 Source: University of New South Wales Summary: Australian teachers are in crisis, with 9 in 10 experiencing severe stress and nearly 70% saying their workload is unmanageable. A major UNSW Sydney study found teachers suffer depression, anxiety, and stress at rates three to four times higher than the national average, largely driven by excessive administrative tasks. These mental health struggles are pushing many to consider leaving the profession, worsening the teacher shortage. Share: Facebook Twitter Pinterest LinkedIN Email FULL STORY Teachers across Australia face severe stress and burnout from overwhelming workloads, with mental health issues well above national norms. This crisis fuels teacher shortages and impacts student outcomes. Credit: Shutterstock Nine out of 10 Australian teachers are experiencing severe stress, and nearly 70% say their workload is unmanageable, says UNSW Sydney research. A new study from researchers at UNSW Sydney - the first to examine rates of depression, anxiety and stress in Australian teachers - has found they experience these mental health issues at three times the national norm. The study 'Teachers' workload, turnover intentions, and mental health' published in Social Psychology of Education surveyed nearly 5000 primary and secondary school teachers across the country. Researchers found that 90% of teachers reported moderate to extremely severe levels of stress, while more than two-thirds experienced moderate to extremely severe symptoms of depression and anxiety. The figures for depression and anxiety alone are more than double the national averages and point to a profession under immense pressure. \"This is not just a well-being issue - it's a workforce issue,\" said lead researcher Dr Helena Granziera, from the School of Education at UNSW's Faculty of Arts, Design & Architecture. \"Our findings show that teachers are experiencing mental health symptoms at rates far above the general population, and that these symptoms are closely linked to their workload and intentions to leave the profession.\" Using validated psychological measures (the DASS test), the study revealed that teachers' average scores for depression, anxiety, and stress were in the \"extremely severe\" range. Compared to national norms, teachers scored three times higher for depression and nearly four times higher for stress. Causes of mental health issues The research also found that workload manageability was a key factor influencing teachers' mental health. Teachers who reported their workload as unmanageable were significantly more likely to experience depressive symptoms, which in turn were strongly associated with their intentions to leave the profession. Notably, 68.8% of teachers described their workload as largely or completely unmanageable. \"Teachers are telling us they're overwhelmed - not by teaching itself, but by the growing burden of non-core tasks,\" said Dr Granziera. \"Administrative duties, compliance requirements, and excessive data collection are taking time away from lesson planning and student engagement. This is leading to burnout and a sense of professional disillusionment.\" Impact on education The study's findings come at a time when Australia is facing a critical teacher shortage. According to recent data from the Australian Institute for Teaching and School Leadership, up to 30% of teachers are considering leaving the profession before retirement age. The results shown in the paper add new urgency to these concerns, showing that poor mental health - particularly depression - is a significant predictor of turnover intentions. \"This research provides clear evidence that improving teachers' working conditions is not just beneficial - it's essential,\" said Dr Granziera. \"If we want to retain skilled educators and ensure quality education for all students, we must address the root causes of teacher stress and mental health decline.\" The study also highlighted disparities based on location, with teachers in rural and remote areas reporting higher levels of depressive symptoms. Female teachers were also more likely to report depressive symptoms and turnover intentions, reflecting broader trends in occupational mental health. What needs to change In response to these findings, the research team is calling for a multi-pronged approach to support teacher well-being, including: Policy reforms to reduce non-essential workload and streamline administrative processes School-level monitoring of teacher well-being and workload Investment in digital mental health programs tailored for educators, allowing flexible, self-paced support System-wide interventions to support teacher retention and reduce burnout. The study took place between October 2022 and May 2024, with recruitment via the Black Dog Institute website and social media channels using targeted social media outreach and teacher-specific platforms. \"This is one of the largest and most comprehensive studies of teacher mental health in Australia,\" said Dr Granziera. \"It provides a clear and urgent message: our teachers are struggling, and they need support.\" The implications of these findings extend beyond the classroom. Poor teacher mental health has been linked to lower student achievement, reduced classroom quality, and diminished student well-being. \"Teachers' mental health is intricately related to students' outcomes, both in terms of students' mental health themselves, but also students' academic achievement,\" says Dr Granziera. \"It's clear improving teacher well-being should be a priority of policy makers not just for teachers but for our education system as a whole.\" RELATED TOPICS Health & Medicine Personalized Medicine Mental Health Research Medical Education and Training Mind & Brain K-12 Education Intelligence Psychology Science & Society Poverty and Learning STEM Education Educational Policy RELATED TERMS Mental illness Anxiety Water scarcity Stock market Psychology Psychopathology Workaholic Commercial fishing Story Source: Materials provided by University of New South Wales . Note: Content may be edited for style and length. Journal Reference : Helena Granziera, Rebecca J. Collie, Anna Roberts, Brittany Corkish, Ashleigh Tickell, Mark Deady, Bridianne O&rsquo;Dea, Michelle Tye, Aliza Werner-Seidler. Teachers&rsquo; workload, turnover intentions, and mental health: perspectives of Australian teachers . Social Psychology of Education , 2025; 28 (1) DOI: 10.1007/s11218-025-10113-w Cite This Page : MLA APA Chicago University of New South Wales. \"9 in 10 Australian Teachers Are Stressed to Breaking Point.\" ScienceDaily. ScienceDaily, 26 August 2025. <www.sciencedaily.com / releases / 2025 / 08 / 250826005215.htm>. University of New South Wales. (2025, August 26). 9 in 10 Australian Teachers Are Stressed to Breaking Point. ScienceDaily . Retrieved August 26, 2025 from www.sciencedaily.com / releases / 2025 / 08 / 250826005215.htm University of New South Wales. \"9 in 10 Australian Teachers Are Stressed to Breaking Point.\" ScienceDaily. www.sciencedaily.com / releases / 2025 / 08 / 250826005215.htm (accessed August 26, 2025). Explore More from ScienceDaily RELATED STORIES Nursing 2025: No Relief in Sight as Burnout, Stress and Short Staffing Persist Apr. 30, 2025  A national survey of 2,600 nurses and nursing students reveals a profession under severe strain, with widespread stress, burnout, and staffing shortages threatening both nurse well-being and patient ... How Does HIV Get Into the Cell's Cenetr to Kickstart Infection? Jan. 24, 2024  UNSW Sydney medical scientists have cracked a mystery whose solution has long eluded researchers. UNSW Sydney medical scientists have cracked a mystery whose solution has long eluded ... Teachers Who Struggle to Cope With Stress Report Far Lower Job Satisfaction Apr. 10, 2023  As teacher shortages continue to worsen across the United States, a new study gives insight into why so many stressed and burnt-out teachers are leaving the profession. The study found teachers who ... Think You're Good at Math? Study Shows It May Be Because You Had Equitable Math Teachers Mar. 3, 2023  A new study finds that high school students identify more with math if they see their math teacher treating everyone in the class equitably, especially in racially diverse schools. While the ... Pre-School Play With Friends Lowers Risk of Mental Health Problems Later June 14, 2022  Children who learn to play well with others at pre-school age tend to enjoy better mental health as they get older, new research shows. The study provides the first clear evidence that the ability to ... Rap Music Increasingly Mixes in Mental Health Metaphors Dec. 7, 2020  The proportion of rap songs that referenced depression, suicide and mental health struggles more than doubled between 1998 and 2018, according to a study by the University of North Carolina at Chapel ... TRENDING AT SCITECHDAILY.com After 60 Years, Scientists Uncover Hidden Brain Pathway Behind Diabetes Drug Metformin No Pills, No Surgery: Scientists Discover Simple Way To Relieve Arthritis Pain Challenging Over 150 Years of Immunotherapy: Scientists Unveil New Weapon That Kills Cancer Without the Immune System Superfood for Bees Sparks 15-Fold Colony Boom",
    "reactions": [
      "Latest update from ScienceDaily Health",
      "Read more at the source for full details",
      "Stay informed with curated technology news"
    ],
    "promoBanner": {
      "text": "Axiologic News",
      "url": "https://axiologic.news"
    }
  }
]